{"methods":["final void await() Implements interruptible condition wait.","final boolean await(long time, TimeUnit unit) Implements timed condition wait.","final long awaitNanos(long nanosTimeout) Implements timed condition wait.","final void awaitUninterruptibly() Implements uninterruptible condition wait.","final boolean awaitUntil(Date deadline) Implements absolute timed condition wait.","final void signal() Moves the longest-waiting thread, if one exists, from the wait queue for this condition to the wait queue for the owning lock.","final void signalAll() Moves all threads from the wait queue for this condition to the wait queue for the owning lock.","final int getWaitQueueLength() Returns an estimate of the number of threads waiting on this condition.","final Collection<Thread> getWaitingThreads() Returns a collection containing those threads that may be waiting on this Condition.","final boolean hasWaiters() Queries whether any threads are waiting on this condition.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.concurrent.locks.Condition abstract void await() Causes the current thread to wait until it is signalled or interrupted. abstract boolean await(long time, TimeUnit unit) Causes the current thread to wait until it is signalled or interrupted, or the specified waiting time elapses. abstract long awaitNanos(long nanosTimeout) Causes the current thread to wait until it is signalled or interrupted, or the specified waiting time elapses. abstract void awaitUninterruptibly() Causes the current thread to wait until it is signalled. abstract boolean awaitUntil(Date deadline) Causes the current thread to wait until it is signalled or interrupted, or the specified deadline elapses. abstract void signal() Wakes up one waiting thread. abstract void signalAll() Wakes up all waiting threads.","abstract void await() Causes the current thread to wait until it is signalled or interrupted.","abstract boolean await(long time, TimeUnit unit) Causes the current thread to wait until it is signalled or interrupted, or the specified waiting time elapses.","abstract long awaitNanos(long nanosTimeout) Causes the current thread to wait until it is signalled or interrupted, or the specified waiting time elapses.","abstract void awaitUninterruptibly() Causes the current thread to wait until it is signalled.","abstract boolean awaitUntil(Date deadline) Causes the current thread to wait until it is signalled or interrupted, or the specified deadline elapses.","abstract void signal() Wakes up one waiting thread.","abstract void signalAll() Wakes up all waiting threads."],"package":"java.util.concurrent.locks","constants":[],"class":"AbstractQueuedLongSynchronizer.ConditionObject","constructors":[],"fields":[]}