{"methods":["abstract Bundle addAccount(AccountAuthenticatorResponse response, String accountType, String authTokenType, String[] requiredFeatures, Bundle options) Adds an account of the specified accountType.","Bundle addAccountFromCredentials(AccountAuthenticatorResponse response, Account account, Bundle accountCredentials) Creates an account based on credentials provided by the authenticator instance of another user on the device, who has chosen to share the account with this user.","abstract Bundle confirmCredentials(AccountAuthenticatorResponse response, Account account, Bundle options) Checks that the user knows the credentials of an account.","abstract Bundle editProperties(AccountAuthenticatorResponse response, String accountType) Returns a Bundle that contains the Intent of the activity that can be used to edit the properties.","Bundle getAccountCredentialsForCloning(AccountAuthenticatorResponse response, Account account) Returns a Bundle that contains whatever is required to clone the account on a different user.","Bundle getAccountRemovalAllowed(AccountAuthenticatorResponse response, Account account) Checks if the removal of this account is allowed.","abstract Bundle getAuthToken(AccountAuthenticatorResponse response, Account account, String authTokenType, Bundle options) Gets the authtoken for an account.","abstract String getAuthTokenLabel(String authTokenType) Ask the authenticator for a localized label for the given authTokenType.","final IBinder getIBinder()","abstract Bundle hasFeatures(AccountAuthenticatorResponse response, Account account, String[] features) Checks if the account supports all the specified authenticator specific features.","abstract Bundle updateCredentials(AccountAuthenticatorResponse response, Account account, String authTokenType, Bundle options) Update the locally stored credentials for an account.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.accounts","constants":[],"class":"AbstractAccountAuthenticator","constructors":[],"fields":[]}