{"methods":["static String capabilityToString(int capability) Returns the string representation of a capability.","int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","static String feedbackTypeToString(int feedbackType) Returns the string representation of a feedback type.","static String flagToString(int flag) Returns the string representation of a flag.","boolean getCanRetrieveWindowContent() This method was deprecated in API level 18. Use getCapabilities().","int getCapabilities() Returns the bit mask of capabilities this accessibility service has such as being able to retrieve the active window content, etc.","String getDescription() This method was deprecated in API level 16. Use loadDescription(PackageManager).","String getId() The accessibility service id.","ResolveInfo getResolveInfo() The service ResolveInfo.","String getSettingsActivityName() The settings activity name.","int hashCode() Returns an integer hash code for this object.","String loadDescription(PackageManager packageManager) The localized description of the accessibility service.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel parcel, int flagz) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.accessibilityservice","constants":["int CAPABILITY_CAN_REQUEST_ENHANCED_WEB_ACCESSIBILITY Capability: This accessibility service can request enhanced web accessibility enhancements.","int CAPABILITY_CAN_REQUEST_FILTER_KEY_EVENTS Capability: This accessibility service can request to filter the key event stream.","int CAPABILITY_CAN_REQUEST_TOUCH_EXPLORATION Capability: This accessibility service can request touch exploration mode in which touched items are spoken aloud and the UI can be explored via gestures.","int CAPABILITY_CAN_RETRIEVE_WINDOW_CONTENT Capability: This accessibility service can retrieve the active window content.","int DEFAULT If an AccessibilityService is the default for a given type.","int FEEDBACK_ALL_MASK Mask for all feedback types.","int FEEDBACK_AUDIBLE Denotes audible (not spoken) feedback.","int FEEDBACK_BRAILLE Denotes braille feedback.","int FEEDBACK_GENERIC Denotes generic feedback.","int FEEDBACK_HAPTIC Denotes haptic feedback.","int FEEDBACK_SPOKEN Denotes spoken feedback.","int FEEDBACK_VISUAL Denotes visual feedback.","int FLAG_INCLUDE_NOT_IMPORTANT_VIEWS If this flag is set the system will regard views that are not important for accessibility in addition to the ones that are important for accessibility.","int FLAG_REPORT_VIEW_IDS This flag requests that the AccessibilityNodeInfos obtained by an AccessibilityService contain the id of the source view.","int FLAG_REQUEST_ENHANCED_WEB_ACCESSIBILITY This flag requests from the system to enable web accessibility enhancing extensions.","int FLAG_REQUEST_FILTER_KEY_EVENTS This flag requests from the system to filter key events.","int FLAG_REQUEST_TOUCH_EXPLORATION_MODE This flag requests that the system gets into touch exploration mode.","int FLAG_RETRIEVE_INTERACTIVE_WINDOWS This flag indicates to the system that the accessibility service wants to access content of all interactive windows.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"AccessibilityServiceInfo","constructors":[],"fields":["public static final Creator<AccessibilityServiceInfo> CREATOR","public int eventTypes The event types an AccessibilityService is interested in.","public int feedbackType The feedback type an AccessibilityService provides.","public int flags This field represents a set of flags used for configuring an AccessibilityService.","public long notificationTimeout The timeout after the most recent event of a given type before an AccessibilityService is notified.","public String[] packageNames The package names an AccessibilityService is interested in."]}