{"methods":["boolean addAccessibilityStateChangeListener(AccessibilityManager.AccessibilityStateChangeListener listener) Registers an AccessibilityManager.AccessibilityStateChangeListener for changes in the global accessibility state of the system.","boolean addTouchExplorationStateChangeListener(AccessibilityManager.TouchExplorationStateChangeListener listener) Registers a AccessibilityManager.TouchExplorationStateChangeListener for changes in the global touch exploration state of the system.","List<ServiceInfo> getAccessibilityServiceList() This method was deprecated in API level 14. Use getInstalledAccessibilityServiceList()","List<AccessibilityServiceInfo> getEnabledAccessibilityServiceList(int feedbackTypeFlags) Returns the AccessibilityServiceInfos of the enabled accessibility services for a given feedback type.","List<AccessibilityServiceInfo> getInstalledAccessibilityServiceList() Returns the AccessibilityServiceInfos of the installed accessibility services.","void interrupt() Requests feedback interruption from all accessibility services.","boolean isEnabled() Returns if the accessibility in the system is enabled.","boolean isTouchExplorationEnabled() Returns if the touch exploration in the system is enabled.","boolean removeAccessibilityStateChangeListener(AccessibilityManager.AccessibilityStateChangeListener listener) Unregisters an AccessibilityManager.AccessibilityStateChangeListener.","boolean removeTouchExplorationStateChangeListener(AccessibilityManager.TouchExplorationStateChangeListener listener) Unregisters a AccessibilityManager.TouchExplorationStateChangeListener.","void sendAccessibilityEvent(AccessibilityEvent event) Sends an AccessibilityEvent.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view.accessibility","constants":[],"class":"AccessibilityManager","constructors":[],"fields":[]}