{"methods":["static void appendRecord(AccessibilityEvent event, AccessibilityRecordCompat record) Appends an AccessibilityRecord to the end of event records.","static AccessibilityRecordCompat asRecord(AccessibilityEvent event) Creates an AccessibilityRecordCompat from an AccessibilityEvent that can be used to manipulate the event properties defined in AccessibilityRecord.","static AccessibilityRecordCompat getRecord(AccessibilityEvent event, int index) Gets the record at a given index.","static int getRecordCount(AccessibilityEvent event) Gets the number of records contained in the event.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.view.accessibility","constants":["int TYPES_ALL_MASK Mask for AccessibilityEvent all types.","int TYPE_ANNOUNCEMENT Represents the event of an application making an announcement.","int TYPE_GESTURE_DETECTION_END Represents the event of ending gesture detection.","int TYPE_GESTURE_DETECTION_START Represents the event of beginning gesture detection.","int TYPE_TOUCH_EXPLORATION_GESTURE_END Represents the event of ending a touch exploration gesture.","int TYPE_TOUCH_EXPLORATION_GESTURE_START Represents the event of starting a touch exploration gesture.","int TYPE_TOUCH_INTERACTION_END Represents the event of the user ending to touch the screen.","int TYPE_TOUCH_INTERACTION_START Represents the event of the user starting to touch the screen.","int TYPE_VIEW_ACCESSIBILITY_FOCUSED Represents the event of gaining accessibility focus.","int TYPE_VIEW_ACCESSIBILITY_FOCUS_CLEARED Represents the event of clearing accessibility focus.","int TYPE_VIEW_HOVER_ENTER Represents the event of a hover enter over a View.","int TYPE_VIEW_HOVER_EXIT Represents the event of a hover exit over a View.","int TYPE_VIEW_SCROLLED Represents the event of scrolling a view.","int TYPE_VIEW_TEXT_SELECTION_CHANGED Represents the event of changing the selection in an EditText.","int TYPE_VIEW_TEXT_TRAVERSED_AT_MOVEMENT_GRANULARITY Represents the event of traversing the text of a view at a given movement granularity.","int TYPE_WINDOW_CONTENT_CHANGED Represents the event of changing the content of a window."],"class":"AccessibilityEventCompat","constructors":[],"fields":[]}