{"methods":["abstract CharSequence getContentDescription() Gets a brief description of this tab's content for use in accessibility support.","abstract View getCustomView() Retrieve a previously set custom view for this tab.","abstract Drawable getIcon() Return the icon associated with this tab.","abstract int getPosition() Return the current position of this tab in the action bar.","abstract Object getTag()","abstract CharSequence getText() Return the text of this tab.","abstract void select() Select this tab.","abstract ActionBar.Tab setContentDescription(int resId) Set a description of this tab's content for use in accessibility support.","abstract ActionBar.Tab setContentDescription(CharSequence contentDesc) Set a description of this tab's content for use in accessibility support.","abstract ActionBar.Tab setCustomView(int layoutResId) Set a custom view to be used for this tab.","abstract ActionBar.Tab setCustomView(View view) Set a custom view to be used for this tab.","abstract ActionBar.Tab setIcon(Drawable icon) Set the icon displayed on this tab.","abstract ActionBar.Tab setIcon(int resId) Set the icon displayed on this tab.","abstract ActionBar.Tab setTabListener(ActionBar.TabListener listener) Set the ActionBar.TabListener that will handle switching to and from this tab.","abstract ActionBar.Tab setTag(Object obj) Give this Tab an arbitrary object to hold for later use.","abstract ActionBar.Tab setText(int resId) Set the text displayed on this tab.","abstract ActionBar.Tab setText(CharSequence text) Set the text displayed on this tab.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.app","constants":["int INVALID_POSITION An invalid position for a tab."],"class":"ActionBar.Tab","constructors":[],"fields":[]}