{"methods":["static ActivityOptions makeCustomAnimation(Context context, int enterResId, int exitResId) Create an ActivityOptions specifying a custom animation to run when the activity is displayed.","static ActivityOptions makeScaleUpAnimation(View source, int startX, int startY, int width, int height) Create an ActivityOptions specifying an animation where the new activity is scaled from a small originating area of the screen to its final full representation.","static ActivityOptions makeSceneTransitionAnimation(Activity activity, Pair...<View, String> sharedElements) Create an ActivityOptions to transition between Activities using cross-Activity scene animations.","static ActivityOptions makeSceneTransitionAnimation(Activity activity, View sharedElement, String sharedElementName) Create an ActivityOptions to transition between Activities using cross-Activity scene animations.","static ActivityOptions makeTaskLaunchBehind() If set along with Intent.FLAG_ACTIVITY_NEW_DOCUMENT then the task being launched will not be presented to the user but will instead be only available through the recents task list.","static ActivityOptions makeThumbnailScaleUpAnimation(View source, Bitmap thumbnail, int startX, int startY) Create an ActivityOptions specifying an animation where a thumbnail is scaled from a given position to the new activity window that is being started.","Bundle toBundle() Returns the created options as a Bundle, which can be passed to Context.startActivity(Intent, Bundle) and related methods.","void update(ActivityOptions otherOptions) Update the current values in this ActivityOptions from those supplied in otherOptions.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":[],"class":"ActivityOptions","constructors":[],"fields":[]}