{"methods":["abstract void addOnMenuVisibilityListener(ActionBar.OnMenuVisibilityListener listener) Add a listener that will respond to menu visibility change events.","abstract void addTab(ActionBar.Tab tab, int position) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void addTab(ActionBar.Tab tab) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void addTab(ActionBar.Tab tab, boolean setSelected) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void addTab(ActionBar.Tab tab, int position, boolean setSelected) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract View getCustomView()","abstract int getDisplayOptions()","float getElevation() Get the Z-axis elevation of the action bar in pixels.","abstract int getHeight() Retrieve the current height of the ActionBar.","int getHideOffset() Return the current vertical offset of the action bar.","abstract int getNavigationItemCount() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract int getNavigationMode() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract int getSelectedNavigationIndex() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract ActionBar.Tab getSelectedTab() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract CharSequence getSubtitle() Returns the current ActionBar subtitle in standard mode.","abstract ActionBar.Tab getTabAt(int index) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract int getTabCount() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","Context getThemedContext() Returns a Context with an appropriate theme for creating views that will appear in the action bar.","abstract CharSequence getTitle() Returns the current ActionBar title in standard mode.","abstract void hide() Hide the ActionBar if it is currently showing.","boolean isHideOnContentScrollEnabled() Return whether the action bar is configured to scroll out of sight along with a nested scrolling child.","abstract boolean isShowing()","abstract ActionBar.Tab newTab() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void removeAllTabs() This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void removeOnMenuVisibilityListener(ActionBar.OnMenuVisibilityListener listener) Remove a menu visibility listener.","abstract void removeTab(ActionBar.Tab tab) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void removeTabAt(int position) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void selectTab(ActionBar.Tab tab) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void setBackgroundDrawable(Drawable d) Set the ActionBar's background.","abstract void setCustomView(int resId) Set the action bar into custom navigation mode, supplying a view for custom navigation.","abstract void setCustomView(View view, ActionBar.LayoutParams layoutParams) Set the action bar into custom navigation mode, supplying a view for custom navigation.","abstract void setCustomView(View view) Set the action bar into custom navigation mode, supplying a view for custom navigation.","abstract void setDisplayHomeAsUpEnabled(boolean showHomeAsUp) Set whether home should be displayed as an \"up\" affordance.","abstract void setDisplayOptions(int options, int mask) Set selected display options.","abstract void setDisplayOptions(int options) Set display options.","abstract void setDisplayShowCustomEnabled(boolean showCustom) Set whether a custom view should be displayed, if set.","abstract void setDisplayShowHomeEnabled(boolean showHome) Set whether to include the application home affordance in the action bar.","abstract void setDisplayShowTitleEnabled(boolean showTitle) Set whether an activity title/subtitle should be displayed.","abstract void setDisplayUseLogoEnabled(boolean useLogo) Set whether to display the activity logo rather than the activity icon.","void setElevation(float elevation) Set the Z-axis elevation of the action bar in pixels.","void setHideOffset(int offset) Set the current hide offset of the action bar.","void setHideOnContentScrollEnabled(boolean hideOnContentScroll) Enable hiding the action bar on content scroll.","void setHomeActionContentDescription(CharSequence description) Set an alternate description for the Home/Up action, when enabled.","void setHomeActionContentDescription(int resId) Set an alternate description for the Home/Up action, when enabled.","void setHomeAsUpIndicator(Drawable indicator) Set an alternate drawable to display next to the icon/logo/title when DISPLAY_HOME_AS_UP is enabled.","void setHomeAsUpIndicator(int resId) Set an alternate drawable to display next to the icon/logo/title when DISPLAY_HOME_AS_UP is enabled.","void setHomeButtonEnabled(boolean enabled) Enable or disable the \"home\" button in the corner of the action bar.","abstract void setIcon(Drawable icon) Set the icon to display in the 'home' section of the action bar.","abstract void setIcon(int resId) Set the icon to display in the 'home' section of the action bar.","abstract void setListNavigationCallbacks(SpinnerAdapter adapter, ActionBar.OnNavigationListener callback) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void setLogo(int resId) Set the logo to display in the 'home' section of the action bar.","abstract void setLogo(Drawable logo) Set the logo to display in the 'home' section of the action bar.","abstract void setNavigationMode(int mode) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","abstract void setSelectedNavigationItem(int position) This method is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","void setSplitBackgroundDrawable(Drawable d) Set the ActionBar's split background.","void setStackedBackgroundDrawable(Drawable d) Set the ActionBar's stacked background.","abstract void setSubtitle(int resId) Set the action bar's subtitle.","abstract void setSubtitle(CharSequence subtitle) Set the action bar's subtitle.","abstract void setTitle(int resId) Set the action bar's title.","abstract void setTitle(CharSequence title) Set the action bar's title.","abstract void show() Show the ActionBar if it is not currently showing.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.app","constants":["int DISPLAY_HOME_AS_UP Display the 'home' element such that it appears as an 'up' affordance.","int DISPLAY_SHOW_CUSTOM Show the custom view if one has been set.","int DISPLAY_SHOW_HOME Show 'home' elements in this action bar, leaving more space for other navigation elements.","int DISPLAY_SHOW_TITLE Show the activity title and subtitle, if present.","int DISPLAY_USE_LOGO Use logo instead of icon if available.","int NAVIGATION_MODE_LIST This constant is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","int NAVIGATION_MODE_STANDARD This constant is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead.","int NAVIGATION_MODE_TABS This constant is deprecated. Action bar navigation modes are deprecated and not supported by inline toolbar action bars. Consider using other common navigation patterns instead."],"class":"ActionBar","constructors":[],"fields":[]}