{"methods":["abstract void finish() Finish and close this action mode.","abstract View getCustomView() Returns the current custom view for this action mode.","abstract Menu getMenu() Returns the menu of actions that this action mode presents.","abstract MenuInflater getMenuInflater() Returns a MenuInflater with the ActionMode's context.","abstract CharSequence getSubtitle() Returns the current subtitle of this action mode.","Object getTag() Retrieve the tag object associated with this ActionMode.","abstract CharSequence getTitle() Returns the current title of this action mode.","boolean getTitleOptionalHint()","abstract void invalidate() Invalidate the action mode and refresh menu content.","boolean isTitleOptional()","abstract void setCustomView(View view) Set a custom view for this action mode.","abstract void setSubtitle(int resId) Set the subtitle of the action mode.","abstract void setSubtitle(CharSequence subtitle) Set the subtitle of the action mode.","void setTag(Object tag) Set a tag object associated with this ActionMode.","abstract void setTitle(CharSequence title) Set the title of the action mode.","abstract void setTitle(int resId) Set the title of the action mode.","void setTitleOptionalHint(boolean titleOptional) Set whether or not the title/subtitle display for this action mode is optional.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"ActionMode","constructors":[],"fields":[]}