{"methods":["View.OnClickListener getToolbarNavigationClickListener() Returns the fallback listener for Navigation icon click events.","boolean isDrawerIndicatorEnabled()","void onConfigurationChanged(Configuration newConfig) This method should always be called by your Activity's onConfigurationChanged method.","void onDrawerClosed(View drawerView) DrawerLayout.DrawerListener callback method.","void onDrawerOpened(View drawerView) DrawerLayout.DrawerListener callback method.","void onDrawerSlide(View drawerView, float slideOffset) DrawerLayout.DrawerListener callback method.","void onDrawerStateChanged(int newState) DrawerLayout.DrawerListener callback method.","boolean onOptionsItemSelected(MenuItem item) This method should be called by your Activity's onOptionsItemSelected method.","void setDrawerIndicatorEnabled(boolean enable) Enable or disable the drawer indicator.","void setHomeAsUpIndicator(Drawable indicator) Set the up indicator to display when the drawer indicator is not enabled.","void setHomeAsUpIndicator(int resId) Set the up indicator to display when the drawer indicator is not enabled.","void setToolbarNavigationClickListener(View.OnClickListener onToolbarNavigationClickListener) When DrawerToggle is constructed with a Toolbar, it sets the click listener on the Navigation icon.","void syncState() Synchronize the state of the drawer indicator/affordance with the linked DrawerLayout.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.support.v4.widget.DrawerLayout.DrawerListener abstract void onDrawerClosed(View drawerView) Called when a drawer has settled in a completely closed state. abstract void onDrawerOpened(View drawerView) Called when a drawer has settled in a completely open state. abstract void onDrawerSlide(View drawerView, float slideOffset) Called when a drawer's position changes. abstract void onDrawerStateChanged(int newState) Called when the drawer motion state changes.","abstract void onDrawerClosed(View drawerView) Called when a drawer has settled in a completely closed state.","abstract void onDrawerOpened(View drawerView) Called when a drawer has settled in a completely open state.","abstract void onDrawerSlide(View drawerView, float slideOffset) Called when a drawer's position changes.","abstract void onDrawerStateChanged(int newState) Called when the drawer motion state changes."],"package":"android.support.v7.app","constants":[],"class":"ActionBarDrawerToggle","constructors":[],"fields":[]}