{"methods":["static void finishAffinity(Activity activity) Finish this activity, and tries to finish all activities immediately below it in the current task that have the same affinity.","static void finishAfterTransition(Activity activity) Reverses the Activity Scene entry Transition and triggers the calling Activity to reverse its exit Transition.","static boolean invalidateOptionsMenu(Activity activity) Invalidate the activity's options menu, if able.","static void postponeEnterTransition(Activity activity)","static void setEnterSharedElementCallback(Activity activity, SharedElementCallback callback) When makeSceneTransitionAnimation(Activity, android.view.View, String) was used to start an Activity, callback will be called to handle shared elements on the launched Activity.","static void setExitSharedElementCallback(Activity activity, SharedElementCallback callback) When makeSceneTransitionAnimation(Activity, android.view.View, String) was used to start an Activity, callback will be called to handle shared elements on the launching Activity.","static void startActivity(Activity activity, Intent intent, Bundle options) Start an activity with additional launch information, if able.","static void startActivityForResult(Activity activity, Intent intent, int requestCode, Bundle options) Start new activity with options, if able, for which you would like a result when it finished.","static void startPostponedEnterTransition(Activity activity)","[Expand] Inherited Methods","From class android.support.v4.content.ContextCompat final File getCodeCacheDir(Context context) Returns the absolute path to the application specific cache directory on the filesystem designed for storing cached code. final static Drawable getDrawable(Context context, int id) Return a drawable object associated with a particular resource ID. static File[] getExternalCacheDirs(Context context) Returns absolute paths to application-specific directories on all external storage devices where the application can place cache files it owns. static File[] getExternalFilesDirs(Context context, String type) Returns absolute paths to application-specific directories on all external storage devices where the application can place persistent files it owns. final File getNoBackupFilesDir(Context context) Returns the absolute path to the directory on the filesystem similar to getFilesDir(). static File[] getObbDirs(Context context) Returns absolute paths to application-specific directories on all external storage devices where the application's OBB files (if there are any) can be found. static boolean startActivities(Context context, Intent[] intents) Start a set of activities as a synthesized task stack, if able. static boolean startActivities(Context context, Intent[] intents, Bundle options) Start a set of activities as a synthesized task stack, if able.","final File getCodeCacheDir(Context context) Returns the absolute path to the application specific cache directory on the filesystem designed for storing cached code.","final static Drawable getDrawable(Context context, int id) Return a drawable object associated with a particular resource ID.","static File[] getExternalCacheDirs(Context context) Returns absolute paths to application-specific directories on all external storage devices where the application can place cache files it owns.","static File[] getExternalFilesDirs(Context context, String type) Returns absolute paths to application-specific directories on all external storage devices where the application can place persistent files it owns.","final File getNoBackupFilesDir(Context context) Returns the absolute path to the directory on the filesystem similar to getFilesDir().","static File[] getObbDirs(Context context) Returns absolute paths to application-specific directories on all external storage devices where the application's OBB files (if there are any) can be found.","static boolean startActivities(Context context, Intent[] intents) Start a set of activities as a synthesized task stack, if able.","static boolean startActivities(Context context, Intent[] intents, Bundle options) Start a set of activities as a synthesized task stack, if able.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":[],"class":"ActivityCompat","constructors":[],"fields":[]}