{"methods":["void cancel(PendingIntent operation) Remove any alarms with a matching Intent.","AlarmManager.AlarmClockInfo getNextAlarmClock() Gets information about the next alarm clock currently scheduled.","void set(int type, long triggerAtMillis, PendingIntent operation) Schedule an alarm.","void setAlarmClock(AlarmManager.AlarmClockInfo info, PendingIntent operation) Schedule an alarm that represents an alarm clock.","void setExact(int type, long triggerAtMillis, PendingIntent operation) Schedule an alarm to be delivered precisely at the stated time.","void setInexactRepeating(int type, long triggerAtMillis, long intervalMillis, PendingIntent operation) Schedule a repeating alarm that has inexact trigger time requirements; for example, an alarm that repeats every hour, but not necessarily at the top of every hour.","void setRepeating(int type, long triggerAtMillis, long intervalMillis, PendingIntent operation) Schedule a repeating alarm.","void setTime(long millis) Set the system wall clock time.","void setTimeZone(String timeZone) Set the system default time zone.","void setWindow(int type, long windowStartMillis, long windowLengthMillis, PendingIntent operation) Schedule an alarm to be delivered within a given window of time.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["String ACTION_NEXT_ALARM_CLOCK_CHANGED Broadcast Action: Sent after the value returned by getNextAlarmClock() has changed.","int ELAPSED_REALTIME Alarm time in SystemClock.elapsedRealtime() (time since boot, including sleep).","int ELAPSED_REALTIME_WAKEUP Alarm time in SystemClock.elapsedRealtime() (time since boot, including sleep), which will wake up the device when it goes off.","long INTERVAL_DAY Available inexact recurrence interval recognized by setInexactRepeating(int, long, long, PendingIntent) when running on Android prior to API 19.","long INTERVAL_FIFTEEN_MINUTES Available inexact recurrence interval recognized by setInexactRepeating(int, long, long, PendingIntent) when running on Android prior to API 19.","long INTERVAL_HALF_DAY Available inexact recurrence interval recognized by setInexactRepeating(int, long, long, PendingIntent) when running on Android prior to API 19.","long INTERVAL_HALF_HOUR Available inexact recurrence interval recognized by setInexactRepeating(int, long, long, PendingIntent) when running on Android prior to API 19.","long INTERVAL_HOUR Available inexact recurrence interval recognized by setInexactRepeating(int, long, long, PendingIntent) when running on Android prior to API 19.","int RTC Alarm time in System.currentTimeMillis() (wall clock time in UTC).","int RTC_WAKEUP Alarm time in System.currentTimeMillis() (wall clock time in UTC), which will wake up the device when it goes off."],"class":"AlarmManager","constructors":[],"fields":[]}