{"methods":["final String getAlgorithm() Returns the name of the algorithm.","final byte[] getEncoded(String format) Returns this AlgorithmParameters in the specified encoding format.","final byte[] getEncoded() Returns this AlgorithmParameters in their default encoding format.","static AlgorithmParameters getInstance(String algorithm, String provider) Returns a new instance of AlgorithmParameters from the specified provider for the specified algorithm.","static AlgorithmParameters getInstance(String algorithm, Provider provider) Returns a new instance of AlgorithmParameters from the specified provider for the specified algorithm.","static AlgorithmParameters getInstance(String algorithm) Returns a new instance of AlgorithmParameters for the specified algorithm.","final <T extends AlgorithmParameterSpec> T getParameterSpec(Class<T> paramSpec) Returns the AlgorithmParameterSpec for this AlgorithmParameters.","final Provider getProvider() Returns the provider associated with this AlgorithmParameters.","final void init(AlgorithmParameterSpec paramSpec) Initializes this AlgorithmParameters with the specified AlgorithmParameterSpec.","final void init(byte[] params, String format) Initializes this AlgorithmParameters with the specified byte[] using the specified decoding format.","final void init(byte[] params) Initializes this AlgorithmParameters with the specified byte[] using the default decoding format for parameters.","final String toString() Returns a string containing a concise, human-readable description of this AlgorithmParameters.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security","constants":[],"class":"AlgorithmParameters","constructors":[],"fields":[]}