{"methods":[],"package":"org.apache.http.client.params","constants":["[Expand] Inherited Constants","From interface org.apache.http.auth.params.AuthPNames String CREDENTIAL_CHARSET Defines the charset to be used when encoding Credentials.","String CREDENTIAL_CHARSET Defines the charset to be used when encoding Credentials.","From interface org.apache.http.client.params.ClientPNames String ALLOW_CIRCULAR_REDIRECTS Defines whether circular redirects (redirects to the same location) should be allowed. String CONNECTION_MANAGER_FACTORY Defines the factory to create a default ClientConnectionManager. String CONNECTION_MANAGER_FACTORY_CLASS_NAME Defines the class name of the default ClientConnectionManager This parameter expects a value of type String. String COOKIE_POLICY Defines the name of the cookie specification to be used for HTTP state management. String DEFAULT_HEADERS Defines the request headers to be sent per default with each request. String DEFAULT_HOST Defines the default host. String HANDLE_AUTHENTICATION Defines whether authentication should be handled automatically. String HANDLE_REDIRECTS Defines whether redirects should be handled automatically This parameter expects a value of type Boolean. String MAX_REDIRECTS Defines the maximum number of redirects to be followed. String REJECT_RELATIVE_REDIRECT Defines whether relative redirects should be rejected. String VIRTUAL_HOST Defines the virtual host name.","String ALLOW_CIRCULAR_REDIRECTS Defines whether circular redirects (redirects to the same location) should be allowed.","String CONNECTION_MANAGER_FACTORY Defines the factory to create a default ClientConnectionManager.","String CONNECTION_MANAGER_FACTORY_CLASS_NAME Defines the class name of the default ClientConnectionManager This parameter expects a value of type String.","String COOKIE_POLICY Defines the name of the cookie specification to be used for HTTP state management.","String DEFAULT_HEADERS Defines the request headers to be sent per default with each request.","String DEFAULT_HOST Defines the default host.","String HANDLE_AUTHENTICATION Defines whether authentication should be handled automatically.","String HANDLE_REDIRECTS Defines whether redirects should be handled automatically This parameter expects a value of type Boolean.","String MAX_REDIRECTS Defines the maximum number of redirects to be followed.","String REJECT_RELATIVE_REDIRECT Defines whether relative redirects should be rejected.","String VIRTUAL_HOST Defines the virtual host name.","From interface org.apache.http.conn.params.ConnConnectionPNames String MAX_STATUS_LINE_GARBAGE Defines the maximum number of ignorable lines before we expect a HTTP response's status line.","String MAX_STATUS_LINE_GARBAGE Defines the maximum number of ignorable lines before we expect a HTTP response's status line.","From interface org.apache.http.conn.params.ConnManagerPNames String MAX_CONNECTIONS_PER_ROUTE Defines the maximum number of connections per route. String MAX_TOTAL_CONNECTIONS Defines the maximum number of connections in total. String TIMEOUT Defines the timeout in milliseconds used when retrieving an instance of ManagedClientConnection from the ClientConnectionManager.","String MAX_CONNECTIONS_PER_ROUTE Defines the maximum number of connections per route.","String MAX_TOTAL_CONNECTIONS Defines the maximum number of connections in total.","String TIMEOUT Defines the timeout in milliseconds used when retrieving an instance of ManagedClientConnection from the ClientConnectionManager.","From interface org.apache.http.conn.params.ConnRoutePNames String DEFAULT_PROXY Parameter for the default proxy. String FORCED_ROUTE Parameter for an forced route. String LOCAL_ADDRESS Parameter for the local address.","String DEFAULT_PROXY Parameter for the default proxy.","String FORCED_ROUTE Parameter for an forced route.","String LOCAL_ADDRESS Parameter for the local address.","From interface org.apache.http.cookie.params.CookieSpecPNames String DATE_PATTERNS Parameter for the date patterns used for parsing. String SINGLE_COOKIE_HEADER Parameter for Cookie header formatting.","String DATE_PATTERNS Parameter for the date patterns used for parsing.","String SINGLE_COOKIE_HEADER Parameter for Cookie header formatting.","From interface org.apache.http.params.CoreConnectionPNames String CONNECTION_TIMEOUT Determines the timeout until a connection is etablished. String MAX_HEADER_COUNT Determines the maximum HTTP header count allowed. String MAX_LINE_LENGTH Determines the maximum line length limit. String SOCKET_BUFFER_SIZE Determines the size of the internal socket buffer used to buffer data while receiving / transmitting HTTP messages. String SO_LINGER Sets SO_LINGER with the specified linger time in seconds. String SO_TIMEOUT Defines the default socket timeout (SO_TIMEOUT) in milliseconds which is the timeout for waiting for data. String STALE_CONNECTION_CHECK Determines whether stale connection check is to be used. String TCP_NODELAY Determines whether Nagle's algorithm is to be used.","String CONNECTION_TIMEOUT Determines the timeout until a connection is etablished.","String MAX_HEADER_COUNT Determines the maximum HTTP header count allowed.","String MAX_LINE_LENGTH Determines the maximum line length limit.","String SOCKET_BUFFER_SIZE Determines the size of the internal socket buffer used to buffer data while receiving / transmitting HTTP messages.","String SO_LINGER Sets SO_LINGER with the specified linger time in seconds.","String SO_TIMEOUT Defines the default socket timeout (SO_TIMEOUT) in milliseconds which is the timeout for waiting for data.","String STALE_CONNECTION_CHECK Determines whether stale connection check is to be used.","String TCP_NODELAY Determines whether Nagle's algorithm is to be used.","From interface org.apache.http.params.CoreProtocolPNames String HTTP_CONTENT_CHARSET Defines the charset to be used per default for encoding content body. String HTTP_ELEMENT_CHARSET Defines the charset to be used for encoding HTTP protocol elements. String ORIGIN_SERVER Defines the content of the Server header. String PROTOCOL_VERSION Defines the protocol version used per default. String STRICT_TRANSFER_ENCODING Defines whether responses with an invalid Transfer-Encoding header should be rejected. String USER_AGENT Defines the content of the User-Agent header. String USE_EXPECT_CONTINUE Activates 'Expect: 100-continue' handshake for the entity enclosing methods. String WAIT_FOR_CONTINUE Defines the maximum period of time in milliseconds the client should spend waiting for a 100-continue response.","String HTTP_CONTENT_CHARSET Defines the charset to be used per default for encoding content body.","String HTTP_ELEMENT_CHARSET Defines the charset to be used for encoding HTTP protocol elements.","String ORIGIN_SERVER Defines the content of the Server header.","String PROTOCOL_VERSION Defines the protocol version used per default.","String STRICT_TRANSFER_ENCODING Defines whether responses with an invalid Transfer-Encoding header should be rejected.","String USER_AGENT Defines the content of the User-Agent header.","String USE_EXPECT_CONTINUE Activates 'Expect: 100-continue' handshake for the entity enclosing methods.","String WAIT_FOR_CONTINUE Defines the maximum period of time in milliseconds the client should spend waiting for a 100-continue response."],"class":"AllClientPNames","constructors":[],"fields":[]}