{"methods":["int getPositionForSection(int sectionIndex) Performs a binary search or cache lookup to find the first row that matches a given section's starting letter.","int getSectionForPosition(int position) Returns the section index for a given position in the list by querying the item and comparing it with all items in the section array.","Object[] getSections() Returns the section array constructed from the alphabet provided in the constructor.","void onChanged() This method is called when the entire data set has changed, most likely through a call to requery() on a Cursor.","void onInvalidated() This method is called when the entire data becomes invalid, most likely through a call to deactivate() or close() on a Cursor.","void setCursor(Cursor cursor) Sets a new cursor as the data set and resets the cache of indices.","int compare(String word, String letter) Default implementation compares the first character of word with letter.","[Expand] Inherited Methods","From class android.database.DataSetObserver void onChanged() This method is called when the entire data set has changed, most likely through a call to requery() on a Cursor. void onInvalidated() This method is called when the entire data becomes invalid, most likely through a call to deactivate() or close() on a Cursor.","void onChanged() This method is called when the entire data set has changed, most likely through a call to requery() on a Cursor.","void onInvalidated() This method is called when the entire data becomes invalid, most likely through a call to deactivate() or close() on a Cursor.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.widget.SectionIndexer abstract int getPositionForSection(int sectionIndex) Given the index of a section within the array of section objects, returns the starting position of that section within the adapter. abstract int getSectionForPosition(int position) Given a position within the adapter, returns the index of the corresponding section within the array of section objects. abstract Object[] getSections() Returns an array of objects representing sections of the list.","abstract int getPositionForSection(int sectionIndex) Given the index of a section within the array of section objects, returns the starting position of that section within the adapter.","abstract int getSectionForPosition(int position) Given a position within the adapter, returns the index of the corresponding section within the array of section objects.","abstract Object[] getSections() Returns an array of objects representing sections of the list."],"package":"android.widget","constants":[],"class":"AlphabetIndexer","constructors":[],"fields":["protected CharSequence mAlphabet The string of characters that make up the indexing sections.","protected int mColumnIndex The index of the cursor column that this list is sorted on.","protected Cursor mDataCursor Cursor that is used by the adapter of the list view."]}