{"methods":["void close() Release resources associated with this client.","void disableCurlLogging() Disables cURL logging for this client.","void enableCurlLogging(String name, int level) Enables cURL request logging for this client.","HttpResponse execute(HttpUriRequest request) Executes a request using the default context.","<T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request to the target using the given context and processes the response using the given response handler.","HttpResponse execute(HttpUriRequest request, HttpContext context) Executes a request using the given context.","<T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request using the default context and processes the response using the given response handler.","<T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request to the target using the default context and processes the response using the given response handler.","<T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request using the given context and processes the response using the given response handler.","HttpResponse execute(HttpHost target, HttpRequest request) Executes a request to the target using the default context.","HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request to the target using the given context.","static AbstractHttpEntity getCompressedEntity(byte[] data, ContentResolver resolver) Compress data to send to server.","ClientConnectionManager getConnectionManager() Obtains the connection manager used by this client.","static long getMinGzipSize(ContentResolver resolver) Retrieves the minimum size for compressing data.","HttpParams getParams() Obtains the parameters for this client.","static InputStream getUngzippedContent(HttpEntity entity) Gets the input stream from a response entity.","static void modifyRequestToAcceptGzipResponse(HttpRequest request) Modifies a request to indicate to the server that we would like a gzipped response.","static AndroidHttpClient newInstance(String userAgent, Context context) Create a new HttpClient with reasonable defaults (which you can update).","static AndroidHttpClient newInstance(String userAgent) Create a new HttpClient with reasonable defaults (which you can update).","static long parseDate(String dateString) Returns the date of the given HTTP date string.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.client.HttpClient abstract <T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request using the given context and processes the response using the given response handler. abstract HttpResponse execute(HttpUriRequest request) Executes a request using the default context. abstract <T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request to the target using the given context and processes the response using the given response handler. abstract HttpResponse execute(HttpUriRequest request, HttpContext context) Executes a request using the given context. abstract <T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request using the default context and processes the response using the given response handler. abstract <T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request to the target using the default context and processes the response using the given response handler. abstract HttpResponse execute(HttpHost target, HttpRequest request) Executes a request to the target using the default context. abstract HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request to the target using the given context. abstract ClientConnectionManager getConnectionManager() Obtains the connection manager used by this client. abstract HttpParams getParams() Obtains the parameters for this client.","abstract <T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request using the given context and processes the response using the given response handler.","abstract HttpResponse execute(HttpUriRequest request) Executes a request using the default context.","abstract <T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler, HttpContext context) Executes a request to the target using the given context and processes the response using the given response handler.","abstract HttpResponse execute(HttpUriRequest request, HttpContext context) Executes a request using the given context.","abstract <T> T execute(HttpUriRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request using the default context and processes the response using the given response handler.","abstract <T> T execute(HttpHost target, HttpRequest request, ResponseHandler<?만xtendsT> responseHandler) Executes a request to the target using the default context and processes the response using the given response handler.","abstract HttpResponse execute(HttpHost target, HttpRequest request) Executes a request to the target using the default context.","abstract HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request to the target using the given context.","abstract ClientConnectionManager getConnectionManager() Obtains the connection manager used by this client.","abstract HttpParams getParams() Obtains the parameters for this client."],"package":"android.net.http","constants":[],"class":"AndroidHttpClient","constructors":[],"fields":["public static long DEFAULT_SYNC_MIN_GZIP_BYTES"]}