{"methods":["void addListener(Animator.AnimatorListener listener) Adds a listener to the set of listeners that are sent events through the life of an animation, such as start, repeat, and end.","void addPauseListener(Animator.AnimatorPauseListener listener) Adds a pause listener to this animator.","void cancel() Cancels the animation.","Animator clone() Creates and returns a copy of this Object.","void end() Ends the animation.","abstract long getDuration() Gets the duration of the animation.","TimeInterpolator getInterpolator() Returns the timing interpolator that this animation uses.","ArrayList<Animator.AnimatorListener> getListeners() Gets the set of Animator.AnimatorListener objects that are currently listening for events on this Animator object.","abstract long getStartDelay() The amount of time, in milliseconds, to delay processing the animation after start() is called.","boolean isPaused() Returns whether this animator is currently in a paused state.","abstract boolean isRunning() Returns whether this Animator is currently running (having been started and gone past any initial startDelay period and not yet ended).","boolean isStarted() Returns whether this Animator has been started and not yet ended.","void pause() Pauses a running animation.","void removeAllListeners() Removes all listeners and pauseListeners from this object.","void removeListener(Animator.AnimatorListener listener) Removes a listener from the set listening to this animation.","void removePauseListener(Animator.AnimatorPauseListener listener) Removes a pause listener from the set listening to this animation.","void resume() Resumes a paused animation, causing the animator to pick up where it left off when it was paused.","abstract Animator setDuration(long duration) Sets the duration of the animation.","abstract void setInterpolator(TimeInterpolator value) The time interpolator used in calculating the elapsed fraction of the animation.","abstract void setStartDelay(long startDelay) The amount of time, in milliseconds, to delay processing the animation after start() is called.","void setTarget(Object target) Sets the target object whose property will be animated by this animation.","void setupEndValues() This method tells the object to use appropriate information to extract ending values for the animation.","void setupStartValues() This method tells the object to use appropriate information to extract starting values for the animation.","void start() Starts this animation.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.animation","constants":[],"class":"Animator","constructors":[],"fields":[]}