{"methods":["int checkOp(String op, int uid, String packageName) Do a quick check for whether an application might be able to perform an operation.","int checkOpNoThrow(String op, int uid, String packageName) Like checkOp(String, int, String) but instead of throwing a SecurityException it returns MODE_ERRORED.","void checkPackage(int uid, String packageName) Do a quick check to validate if a package name belongs to a UID.","void finishOp(String op, int uid, String packageName) Report that an application is no longer performing an operation that had previously been started with startOp(String, int, String).","int noteOp(String op, int uid, String packageName) Make note of an application performing an operation.","int noteOpNoThrow(String op, int uid, String packageName) Like noteOp(String, int, String) but instead of throwing a SecurityException it returns MODE_ERRORED.","int startOp(String op, int uid, String packageName) Report that an application has started executing a long-running operation.","int startOpNoThrow(String op, int uid, String packageName) Like startOp(String, int, String) but instead of throwing a SecurityException it returns MODE_ERRORED.","void startWatchingMode(String op, String packageName, AppOpsManager.OnOpChangedListener callback) Monitor for changes to the operating mode for the given op in the given app package.","void stopWatchingMode(AppOpsManager.OnOpChangedListener callback) Stop monitoring that was previously started with startWatchingMode(String, String, AppOpsManager.OnOpChangedListener).","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["int MODE_ALLOWED Result from checkOp(String, int, String), noteOp(String, int, String), startOp(String, int, String): the given caller is allowed to perform the given operation.","int MODE_DEFAULT Result from checkOp(String, int, String), noteOp(String, int, String), startOp(String, int, String): the given caller should use its default security check.","int MODE_ERRORED Result from checkOpNoThrow(String, int, String), noteOpNoThrow(String, int, String), startOpNoThrow(String, int, String): the given caller is not allowed to perform the given operation, and this attempt should cause it to have a fatal error, typically a SecurityException.","int MODE_IGNORED Result from checkOp(String, int, String), noteOp(String, int, String), startOp(String, int, String): the given caller is not allowed to perform the given operation, and this attempt should silently fail (it should not cause the app to crash).","String OPSTR_COARSE_LOCATION Access to coarse location information.","String OPSTR_FINE_LOCATION Access to fine location information.","String OPSTR_GET_USAGE_STATS Access to UsageStatsManager.","String OPSTR_MONITOR_HIGH_POWER_LOCATION Continually monitoring location data with a relatively high power request.","String OPSTR_MONITOR_LOCATION Continually monitoring location data."],"class":"AppOpsManager","constructors":[],"fields":[]}