{"methods":["int allocateAppWidgetId() Get a appWidgetId for a host in the calling process.","final AppWidgetHostView createView(Context context, int appWidgetId, AppWidgetProviderInfo appWidget) Create the AppWidgetHostView for the given widget.","static void deleteAllHosts() Remove all records about all hosts for your package.","void deleteAppWidgetId(int appWidgetId) Stop listening to changes for this AppWidget.","void deleteHost() Remove all records about this host from the AppWidget manager.","final void startAppWidgetConfigureActivityForResult(Activity activity, int appWidgetId, int intentFlags, int requestCode, Bundle options) Starts an app widget provider configure activity for result on behalf of the caller.","void startListening() Start receiving onAppWidgetChanged calls for your AppWidgets.","void stopListening() Stop receiving onAppWidgetChanged calls for your AppWidgets.","void clearViews() Clear the list of Views that have been created by this AppWidgetHost.","AppWidgetHostView onCreateView(Context context, int appWidgetId, AppWidgetProviderInfo appWidget) Called to create the AppWidgetHostView. Override to return a custom subclass if you need it.","void onProviderChanged(int appWidgetId, AppWidgetProviderInfo appWidget) Called when the AppWidget provider for a AppWidget has been upgraded to a new apk.","void onProvidersChanged() Called when the set of available widgets changes (ie.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.appwidget","constants":[],"class":"AppWidgetHost","constructors":[],"fields":[]}