{"methods":["void close() Close this asset manager.","final String[] getLocales() Get the locales that this asset manager contains data for.","final String[] list(String path) Return a String array of all the assets at the given path.","final InputStream open(String fileName) Open an asset using ACCESS_STREAMING mode.","final InputStream open(String fileName, int accessMode) Open an asset using an explicit access mode, returning an InputStream to read its contents.","final AssetFileDescriptor openFd(String fileName)","final AssetFileDescriptor openNonAssetFd(String fileName)","final AssetFileDescriptor openNonAssetFd(int cookie, String fileName)","final XmlResourceParser openXmlResourceParser(String fileName) Retrieve a parser for a compiled XML file.","final XmlResourceParser openXmlResourceParser(int cookie, String fileName) Retrieve a parser for a compiled XML file.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"android.content.res","constants":["int ACCESS_BUFFER Mode for open(String, int): Attempt to load contents into memory, for fast small reads.","int ACCESS_RANDOM Mode for open(String, int): Read chunks, and seek forward and backward.","int ACCESS_STREAMING Mode for open(String, int): Read sequentially, with an occasional forward seek.","int ACCESS_UNKNOWN Mode for open(String, int): no specific information about how data will be accessed."],"class":"AssetManager","constructors":[],"fields":[]}