{"methods":["final boolean cancel(boolean mayInterruptIfRunning) Attempts to cancel execution of this task.","static void execute(Runnable runnable) Convenience version of execute(Object) for use with a simple Runnable object.","final AsyncTask<Params, Progress, Result> execute(Params... params) Executes the task with the specified parameters.","final AsyncTask<Params, Progress, Result> executeOnExecutor(Executor exec, Params... params) Executes the task with the specified parameters.","final Result get(long timeout, TimeUnit unit) Waits if necessary for at most the given time for the computation to complete, and then retrieves its result.","final Result get() Waits if necessary for the computation to complete, and then retrieves its result.","final AsyncTask.Status getStatus() Returns the current status of this task.","final boolean isCancelled() Returns true if this task was cancelled before it completed normally.","abstract Result doInBackground(Params... params) Override this method to perform a computation on a background thread.","void onCancelled(Result result) Runs on the UI thread after cancel(boolean) is invoked and doInBackground(Object[]) has finished.","void onCancelled() Applications should preferably override onCancelled(Object).","void onPostExecute(Result result) Runs on the UI thread after doInBackground(Params...).","void onPreExecute() Runs on the UI thread before doInBackground(Params...).","void onProgressUpdate(Progress... values) Runs on the UI thread after publishProgress(Progress...) is invoked.","final void publishProgress(Progress... values) This method can be invoked from doInBackground(Params...) to publish updates on the UI thread while the background computation is still running.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":[],"class":"AsyncTask","constructors":[],"fields":["public static final Executor SERIAL_EXECUTOR An Executor that executes tasks one at a time in serial order.","public static final Executor THREAD_POOL_EXECUTOR An Executor that can be used to execute tasks in parallel."]}