{"methods":["long addAndGet(T obj, long delta) Atomically adds the given value to the current value of the field of the given object managed by this updater.","abstract boolean compareAndSet(T obj, long expect, long update) Atomically sets the field of the given object managed by this updater to the given updated value if the current value == the expected value.","long decrementAndGet(T obj) Atomically decrements by one the current value of the field of the given object managed by this updater.","abstract long get(T obj) Gets the current value held in the field of the given object managed by this updater.","long getAndAdd(T obj, long delta) Atomically adds the given value to the current value of the field of the given object managed by this updater.","long getAndDecrement(T obj) Atomically decrements by one the current value of the field of the given object managed by this updater.","long getAndIncrement(T obj) Atomically increments by one the current value of the field of the given object managed by this updater.","long getAndSet(T obj, long newValue) Atomically sets the field of the given object managed by this updater to the given value and returns the old value.","long incrementAndGet(T obj) Atomically increments by one the current value of the field of the given object managed by this updater.","abstract void lazySet(T obj, long newValue) Eventually sets the field of the given object managed by this updater to the given updated value.","static <U> AtomicLongFieldUpdater<U> newUpdater(Class<U> tclass, String fieldName) Creates and returns an updater for objects with the given field.","abstract void set(T obj, long newValue) Sets the field of the given object managed by this updater to the given updated value.","abstract boolean weakCompareAndSet(T obj, long expect, long update) Atomically sets the field of the given object managed by this updater to the given updated value if the current value == the expected value.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.concurrent.atomic","constants":[],"class":"AtomicLongFieldUpdater","constructors":[],"fields":[]}