{"methods":["final long addAndGet(long delta) Atomically adds the given value to the current value.","final boolean compareAndSet(long expect, long update) Atomically sets the value to the given updated value if the current value == the expected value.","final long decrementAndGet() Atomically decrements by one the current value.","double doubleValue() Returns the value of this AtomicLong as a double after a widening primitive conversion.","float floatValue() Returns the value of this AtomicLong as a float after a widening primitive conversion.","final long get() Gets the current value.","final long getAndAdd(long delta) Atomically adds the given value to the current value.","final long getAndDecrement() Atomically decrements by one the current value.","final long getAndIncrement() Atomically increments by one the current value.","final long getAndSet(long newValue) Atomically sets to the given value and returns the old value.","final long incrementAndGet() Atomically increments by one the current value.","int intValue() Returns the value of this AtomicLong as an int after a narrowing primitive conversion.","final void lazySet(long newValue) Eventually sets to the given value.","long longValue() Returns the value of this AtomicLong as a long.","final void set(long newValue) Sets to the given value.","String toString() Returns the String representation of the current value.","final boolean weakCompareAndSet(long expect, long update) Atomically sets the value to the given updated value if the current value == the expected value.","[Expand] Inherited Methods","From class java.lang.Number byte byteValue() Returns this object's value as a byte. abstract double doubleValue() Returns this object's value as a double. abstract float floatValue() Returns this object's value as a float. abstract int intValue() Returns this object's value as an int. abstract long longValue() Returns this object's value as a long. short shortValue() Returns this object's value as a short.","byte byteValue() Returns this object's value as a byte.","abstract double doubleValue() Returns this object's value as a double.","abstract float floatValue() Returns this object's value as a float.","abstract int intValue() Returns this object's value as an int.","abstract long longValue() Returns this object's value as a long.","short shortValue() Returns this object's value as a short.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.concurrent.atomic","constants":[],"class":"AtomicLong","constructors":[],"fields":[]}