{"methods":["void addAttribute(String uri, String localName, String qName, String type, String value) Add an attribute to the end of the list.","void clear() Clear the attribute list for reuse.","int getIndex(String qName) Look up an attribute's index by qualified (prefixed) name.","int getIndex(String uri, String localName) Look up an attribute's index by Namespace name.","int getLength() Return the number of attributes in the list.","String getLocalName(int index) Return an attribute's local name.","String getQName(int index) Return an attribute's qualified (prefixed) name.","String getType(String qName) Look up an attribute's type by qualified (prefixed) name.","String getType(String uri, String localName) Look up an attribute's type by Namespace-qualified name.","String getType(int index) Return an attribute's type by index.","String getURI(int index) Return an attribute's Namespace URI.","String getValue(String qName) Look up an attribute's value by qualified (prefixed) name.","String getValue(int index) Return an attribute's value by index.","String getValue(String uri, String localName) Look up an attribute's value by Namespace-qualified name.","void removeAttribute(int index) Remove an attribute from the list.","void setAttribute(int index, String uri, String localName, String qName, String type, String value) Set an attribute in the list.","void setAttributes(Attributes atts) Copy an entire Attributes object.","void setLocalName(int index, String localName) Set the local name of a specific attribute.","void setQName(int index, String qName) Set the qualified name of a specific attribute.","void setType(int index, String type) Set the type of a specific attribute.","void setURI(int index, String uri) Set the Namespace URI of a specific attribute.","void setValue(int index, String value) Set the value of a specific attribute.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.Attributes abstract int getIndex(String uri, String localName) Look up the index of an attribute by Namespace name. abstract int getIndex(String qName) Look up the index of an attribute by XML qualified (prefixed) name. abstract int getLength() Return the number of attributes in the list. abstract String getLocalName(int index) Look up an attribute's local name by index. abstract String getQName(int index) Look up an attribute's XML qualified (prefixed) name by index. abstract String getType(String qName) Look up an attribute's type by XML qualified (prefixed) name. abstract String getType(String uri, String localName) Look up an attribute's type by Namespace name. abstract String getType(int index) Look up an attribute's type by index. abstract String getURI(int index) Look up an attribute's Namespace URI by index. abstract String getValue(String qName) Look up an attribute's value by XML qualified (prefixed) name. abstract String getValue(String uri, String localName) Look up an attribute's value by Namespace name. abstract String getValue(int index) Look up an attribute's value by index.","abstract int getIndex(String uri, String localName) Look up the index of an attribute by Namespace name.","abstract int getIndex(String qName) Look up the index of an attribute by XML qualified (prefixed) name.","abstract int getLength() Return the number of attributes in the list.","abstract String getLocalName(int index) Look up an attribute's local name by index.","abstract String getQName(int index) Look up an attribute's XML qualified (prefixed) name by index.","abstract String getType(String qName) Look up an attribute's type by XML qualified (prefixed) name.","abstract String getType(String uri, String localName) Look up an attribute's type by Namespace name.","abstract String getType(int index) Look up an attribute's type by index.","abstract String getURI(int index) Look up an attribute's Namespace URI by index.","abstract String getValue(String qName) Look up an attribute's value by XML qualified (prefixed) name.","abstract String getValue(String uri, String localName) Look up an attribute's value by Namespace name.","abstract String getValue(int index) Look up an attribute's value by index."],"package":"org.xml.sax.helpers","constants":[],"class":"AttributesImpl","constructors":[],"fields":[]}