{"methods":["boolean equals(Object object) Compares this instance with the specified object and indicates if they are equal.","int hashCode() Returns an integer hash code for this object.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.jar","constants":[],"class":"Attributes.Name","constructors":[],"fields":["public static final Attributes.Name CLASS_PATH The class path (a main attribute).","public static final Attributes.Name CONTENT_TYPE The Content-Type manifest attribute.","public static final Attributes.Name EXTENSION_INSTALLATION The Extension-Installation attribute.","public static final Attributes.Name EXTENSION_LIST The Extension-List attribute defining the extensions that are needed by the applet.","public static final Attributes.Name EXTENSION_NAME The Extension-Name attribute which defines the unique name of the extension.","public static final Attributes.Name IMPLEMENTATION_TITLE The Implementation-Title attribute whose value is a string that defines the title of the extension implementation.","public static final Attributes.Name IMPLEMENTATION_URL The Implementation-URL attribute specifying a URL that can be used to obtain the most recent version of the extension if the required version is not already installed.","public static final Attributes.Name IMPLEMENTATION_VENDOR The Implementation-Vendor attribute defining the organization that maintains the extension implementation.","public static final Attributes.Name IMPLEMENTATION_VENDOR_ID The Implementation-Vendor-Id attribute specifies the vendor of an extension implementation if the applet requires an implementation from a specific vendor.","public static final Attributes.Name IMPLEMENTATION_VERSION The Implementation-Version attribute defining the version of the extension implementation.","public static final Attributes.Name MAIN_CLASS The main class's name (for stand-alone applications).","public static final Attributes.Name MANIFEST_VERSION The version of the manifest file (a main attribute).","public static final Attributes.Name SEALED The Sealed manifest attribute which may have the value true for sealed archives.","public static final Attributes.Name SIGNATURE_VERSION Defines the signature version of the JAR file.","public static final Attributes.Name SPECIFICATION_TITLE The Specification-Title attribute defining the title of the extension specification.","public static final Attributes.Name SPECIFICATION_VENDOR The Specification-Vendor attribute defining the organization that maintains the extension specification.","public static final Attributes.Name SPECIFICATION_VERSION The Specification-Version attribute defining the version of the extension specification."]}