{"methods":["abstract Set<AttributedCharacterIterator.Attribute> getAllAttributeKeys() Returns a set of attributes present in the AttributedCharacterIterator.","abstract Object getAttribute(AttributedCharacterIterator.Attribute attribute) Returns the value stored in the attribute for the current character.","abstract Map<AttributedCharacterIterator.Attribute, Object> getAttributes() Returns a map of all attributes of the current character.","abstract int getRunLimit(AttributedCharacterIterator.Attribute attribute) Returns the index of the last character in the run that has the same attribute value for the given attribute as the current character.","abstract int getRunLimit(Set<? extends AttributedCharacterIterator.Attribute> attributes) Returns the index of the last character in the run that has the same attribute values for the attributes in the set as the current character.","abstract int getRunLimit() Returns the index of the last character in the run having the same attributes as the current character.","abstract int getRunStart() Returns the index of the first character in the run that has the same attributes as the current character.","abstract int getRunStart(AttributedCharacterIterator.Attribute attribute) Returns the index of the first character in the run that has the same attribute value for the given attribute as the current character.","abstract int getRunStart(Set<? extends AttributedCharacterIterator.Attribute> attributes) Returns the index of the first character in the run that has the same attribute values for the attributes in the set as the current character.","[Expand] Inherited Methods","From interface java.text.CharacterIterator abstract Object clone() Returns a new CharacterIterator with the same properties. abstract char current() Returns the character at the current index. abstract char first() Sets the current position to the begin index and returns the character at the new position. abstract int getBeginIndex() Returns the begin index. abstract int getEndIndex() Returns the end index. abstract int getIndex() Returns the current index. abstract char last() Sets the current position to the end index - 1 and returns the character at the new position. abstract char next() Increments the current index and returns the character at the new index. abstract char previous() Decrements the current index and returns the character at the new index. abstract char setIndex(int location) Sets the current index to a new position and returns the character at the new index.","abstract Object clone() Returns a new CharacterIterator with the same properties.","abstract char current() Returns the character at the current index.","abstract char first() Sets the current position to the begin index and returns the character at the new position.","abstract int getBeginIndex() Returns the begin index.","abstract int getEndIndex() Returns the end index.","abstract int getIndex() Returns the current index.","abstract char last() Sets the current position to the end index - 1 and returns the character at the new position.","abstract char next() Increments the current index and returns the character at the new index.","abstract char previous() Decrements the current index and returns the character at the new index.","abstract char setIndex(int location) Sets the current index to a new position and returns the character at the new index."],"package":"java.text","constants":["[Expand] Inherited Constants","From interface java.text.CharacterIterator char DONE A constant which indicates that there is no character at the current index.","char DONE A constant which indicates that there is no character at the current index."],"class":"AttributedCharacterIterator","constructors":[],"fields":[]}