{"methods":["abstract boolean getAttributeBooleanValue(String namespace, String attribute, boolean defaultValue) Return the boolean value of 'attribute'.","abstract boolean getAttributeBooleanValue(int index, boolean defaultValue) Return the boolean value of attribute at 'index'.","abstract int getAttributeCount() Returns the number of attributes available in the set.","abstract float getAttributeFloatValue(int index, float defaultValue) Return the float value of attribute at 'index'.","abstract float getAttributeFloatValue(String namespace, String attribute, float defaultValue) Return the float value of 'attribute'.","abstract int getAttributeIntValue(String namespace, String attribute, int defaultValue) Return the integer value of 'attribute'.","abstract int getAttributeIntValue(int index, int defaultValue) Return the integer value of attribute at 'index'.","abstract int getAttributeListValue(String namespace, String attribute, String[] options, int defaultValue) Return the index of the value of 'attribute' in the list 'options'.","abstract int getAttributeListValue(int index, String[] options, int defaultValue) Return the index of the value of attribute at 'index' in the list 'options'.","abstract String getAttributeName(int index) Returns the name of the specified attribute.","abstract int getAttributeNameResource(int index) Return the resource ID associated with the given attribute name.","abstract int getAttributeResourceValue(String namespace, String attribute, int defaultValue) Return the value of 'attribute' as a resource identifier.","abstract int getAttributeResourceValue(int index, int defaultValue) Return the value of attribute at 'index' as a resource identifier.","abstract int getAttributeUnsignedIntValue(int index, int defaultValue) Return the integer value of attribute at 'index' that is formatted as an unsigned value.","abstract int getAttributeUnsignedIntValue(String namespace, String attribute, int defaultValue) Return the boolean value of 'attribute' that is formatted as an unsigned value.","abstract String getAttributeValue(int index) Returns the value of the specified attribute as a string representation.","abstract String getAttributeValue(String namespace, String name) Returns the value of the specified attribute as a string representation.","abstract String getClassAttribute() Return the value of the \"class\" attribute or null if there is not one.","abstract String getIdAttribute() Return the value of the \"id\" attribute or null if there is not one.","abstract int getIdAttributeResourceValue(int defaultValue) Return the integer value of the \"id\" attribute or defaultValue if there is none.","abstract String getPositionDescription() Returns a description of the current position of the attribute set.","abstract int getStyleAttribute() Return the value of the \"style\" attribute or 0 if there is not one."],"package":"android.util","constants":[],"class":"AttributeSet","constructors":[],"fields":[]}