{"methods":["void addAttribute(String name, String type, String value) Add an attribute to an attribute list.","void clear() Clear the attribute list.","int getLength() Return the number of attributes in the list.","String getName(int i) Get the name of an attribute (by position).","String getType(String name) Get the type of an attribute (by name).","String getType(int i) Get the type of an attribute (by position).","String getValue(String name) Get the value of an attribute (by name).","String getValue(int i) Get the value of an attribute (by position).","void removeAttribute(String name) Remove an attribute from the list.","void setAttributeList(AttributeList atts) Set the attribute list, discarding previous contents.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.AttributeList abstract int getLength() Return the number of attributes in this list. abstract String getName(int i) Return the name of an attribute in this list (by position). abstract String getType(String name) Return the type of an attribute in the list (by name). abstract String getType(int i) Return the type of an attribute in the list (by position). abstract String getValue(String name) Return the value of an attribute in the list (by name). abstract String getValue(int i) Return the value of an attribute in the list (by position).","abstract int getLength() Return the number of attributes in this list.","abstract String getName(int i) Return the name of an attribute in this list (by position).","abstract String getType(String name) Return the type of an attribute in the list (by name).","abstract String getType(int i) Return the type of an attribute in the list (by position).","abstract String getValue(String name) Return the value of an attribute in the list (by name).","abstract String getValue(int i) Return the value of an attribute in the list (by position)."],"package":"org.xml.sax.helpers","constants":[],"class":"AttributeListImpl","constructors":[],"fields":[]}