{"methods":["AudioCodec getCodec() Returns the AudioCodec, or null if it is not set.","int getDtmfType() Returns the RTP payload type for dual-tone multi-frequency (DTMF) digits, or -1 if it is not enabled.","AudioGroup getGroup() Returns the joined AudioGroup.","final boolean isBusy() Returns true if the stream has already joined an AudioGroup.","void join(AudioGroup group) Joins an AudioGroup.","void setCodec(AudioCodec codec) Sets the AudioCodec.","void setDtmfType(int type) Sets the RTP payload type for dual-tone multi-frequency (DTMF) digits.","[Expand] Inherited Methods","From class android.net.rtp.RtpStream void associate(InetAddress address, int port) Associates with a remote host. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. InetAddress getLocalAddress() Returns the network address of the local host. int getLocalPort() Returns the network port of the local host. int getMode() Returns the current mode. InetAddress getRemoteAddress() Returns the network address of the remote host or null if the stream is not associated. int getRemotePort() Returns the network port of the remote host or -1 if the stream is not associated. boolean isBusy() Returns true if the stream is busy. void release() Releases allocated resources. void setMode(int mode) Changes the current mode.","void associate(InetAddress address, int port) Associates with a remote host.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","InetAddress getLocalAddress() Returns the network address of the local host.","int getLocalPort() Returns the network port of the local host.","int getMode() Returns the current mode.","InetAddress getRemoteAddress() Returns the network address of the remote host or null if the stream is not associated.","int getRemotePort() Returns the network port of the remote host or -1 if the stream is not associated.","boolean isBusy() Returns true if the stream is busy.","void release() Releases allocated resources.","void setMode(int mode) Changes the current mode.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.rtp","constants":["[Expand] Inherited Constants","From class android.net.rtp.RtpStream int MODE_NORMAL This mode indicates that the stream sends and receives packets at the same time. int MODE_RECEIVE_ONLY This mode indicates that the stream only receives packets. int MODE_SEND_ONLY This mode indicates that the stream only sends packets.","int MODE_NORMAL This mode indicates that the stream sends and receives packets at the same time.","int MODE_RECEIVE_ONLY This mode indicates that the stream only receives packets.","int MODE_SEND_ONLY This mode indicates that the stream only sends packets."],"class":"AudioStream","constructors":[],"fields":[]}