{"methods":["synchronized static PasswordAuthentication requestPasswordAuthentication(String rHost, InetAddress rAddr, int rPort, String rProtocol, String rPrompt, String rScheme) Invokes the methods of the registered authenticator to get the authentication info.","static PasswordAuthentication requestPasswordAuthentication(String rHost, InetAddress rAddr, int rPort, String rProtocol, String rPrompt, String rScheme, URL rURL, Authenticator.RequestorType reqType) Invokes the methods of the registered authenticator to get the authentication info.","synchronized static PasswordAuthentication requestPasswordAuthentication(InetAddress rAddr, int rPort, String rProtocol, String rPrompt, String rScheme) Invokes the methods of the registered authenticator to get the authentication info.","static void setDefault(Authenticator a) Sets a as the default authenticator.","PasswordAuthentication getPasswordAuthentication() Returns the collected username and password for authorization.","final String getRequestingHost() Returns the host name of the connection that requests authentication or null if unknown.","final int getRequestingPort() Returns the port of the connection that requests authorization.","final String getRequestingPrompt() Returns the realm (prompt string) of the connection that requests authorization.","final String getRequestingProtocol() Returns the protocol of the connection that requests authorization.","final String getRequestingScheme() Returns the scheme of the connection that requests authorization, for example HTTP Basic Authentication.","final InetAddress getRequestingSite() Returns the address of the connection that requests authorization or null if unknown.","URL getRequestingURL() Returns the URL of the authentication request.","Authenticator.RequestorType getRequestorType() Returns the type of this request, it can be PROXY or SERVER.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"Authenticator","constructors":[],"fields":[]}