{"methods":["static byte[] decode(byte[] input, int offset, int len, int flags) Decode the Base64-encoded data in input and return the data in a new byte array.","static byte[] decode(byte[] input, int flags) Decode the Base64-encoded data in input and return the data in a new byte array.","static byte[] decode(String str, int flags) Decode the Base64-encoded data in input and return the data in a new byte array.","static byte[] encode(byte[] input, int flags) Base64-encode the given data and return a newly allocated byte[] with the result.","static byte[] encode(byte[] input, int offset, int len, int flags) Base64-encode the given data and return a newly allocated byte[] with the result.","static String encodeToString(byte[] input, int offset, int len, int flags) Base64-encode the given data and return a newly allocated String with the result.","static String encodeToString(byte[] input, int flags) Base64-encode the given data and return a newly allocated String with the result.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.util","constants":["int CRLF Encoder flag bit to indicate lines should be terminated with a CRLF pair instead of just an LF.","int DEFAULT Default values for encoder/decoder flags.","int NO_CLOSE Flag to pass to Base64OutputStream to indicate that it should not close the output stream it is wrapping when it itself is closed.","int NO_PADDING Encoder flag bit to omit the padding '=' characters at the end of the output (if any).","int NO_WRAP Encoder flag bit to omit all line terminators (i.e., the output will be on one long line).","int URL_SAFE Encoder/decoder flag bit to indicate using the \"URL and filename safe\" variant of Base64 (see RFC 3548 section 4) where - and _ are used in place of + and /."],"class":"Base64","constructors":[],"fields":[]}