{"methods":["boolean beginBatchEdit() Default implementation does nothing.","boolean clearMetaKeyStates(int states) Default implementation uses MetaKeyKeyListener.clearMetaKeyState(long, int) to clear the state.","boolean commitCompletion(CompletionInfo text) Default implementation does nothing and returns false.","boolean commitCorrection(CorrectionInfo correctionInfo) Default implementation does nothing and returns false.","boolean commitText(CharSequence text, int newCursorPosition) Default implementation replaces any existing composing text with the given text.","boolean deleteSurroundingText(int beforeLength, int afterLength) The default implementation performs the deletion around the current selection position of the editable text.","boolean endBatchEdit() Default implementation does nothing.","boolean finishComposingText() The default implementation removes the composing state from the current editable text.","static int getComposingSpanEnd(Spannable text)","static int getComposingSpanStart(Spannable text)","int getCursorCapsMode(int reqModes) The default implementation uses TextUtils.getCapsMode to get the cursor caps mode for the current selection position in the editable text, unless in dummy mode in which case 0 is always returned.","Editable getEditable() Return the target of edit operations.","ExtractedText getExtractedText(ExtractedTextRequest request, int flags) The default implementation always returns null.","CharSequence getSelectedText(int flags) The default implementation returns the text currently selected, or null if none is selected.","CharSequence getTextAfterCursor(int length, int flags) The default implementation returns the given amount of text from the current cursor position in the buffer.","CharSequence getTextBeforeCursor(int length, int flags) The default implementation returns the given amount of text from the current cursor position in the buffer.","boolean performContextMenuAction(int id) The default implementation does nothing.","boolean performEditorAction(int actionCode) The default implementation turns this into the enter key.","boolean performPrivateCommand(String action, Bundle data) The default implementation does nothing.","final static void removeComposingSpans(Spannable text)","boolean reportFullscreenMode(boolean enabled) Updates InputMethodManager with the current fullscreen mode.","boolean requestCursorUpdates(int cursorUpdateMode) The default implementation does nothing.","boolean sendKeyEvent(KeyEvent event) Provides standard implementation for sending a key event to the window attached to the input connection's view.","boolean setComposingRegion(int start, int end) Mark a certain region of text as composing text.","static void setComposingSpans(Spannable text)","boolean setComposingText(CharSequence text, int newCursorPosition) The default implementation places the given text into the editable, replacing any existing composing text.","boolean setSelection(int start, int end) The default implementation changes the selection position in the current editable text.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.view.inputmethod.InputConnection abstract boolean beginBatchEdit() Tell the editor that you are starting a batch of editor operations. abstract boolean clearMetaKeyStates(int states) Clear the given meta key pressed states in the given input connection. abstract boolean commitCompletion(CompletionInfo text) Commit a completion the user has selected from the possible ones previously reported to InputMethodSession#displayCompletions(CompletionInfo[]) or InputMethodManager#displayCompletions(View, CompletionInfo[]). abstract boolean commitCorrection(CorrectionInfo correctionInfo) Commit a correction automatically performed on the raw user's input. abstract boolean commitText(CharSequence text, int newCursorPosition) Commit text to the text box and set the new cursor position. abstract boolean deleteSurroundingText(int beforeLength, int afterLength) Delete beforeLength characters of text before the current cursor position, and delete afterLength characters of text after the current cursor position, excluding the selection. abstract boolean endBatchEdit() Tell the editor that you are done with a batch edit previously initiated with beginBatchEdit(). abstract boolean finishComposingText() Have the text editor finish whatever composing text is currently active. abstract int getCursorCapsMode(int reqModes) Retrieve the current capitalization mode in effect at the current cursor position in the text. abstract ExtractedText getExtractedText(ExtractedTextRequest request, int flags) Retrieve the current text in the input connection's editor, and monitor for any changes to it. abstract CharSequence getSelectedText(int flags) Gets the selected text, if any. abstract CharSequence getTextAfterCursor(int n, int flags) Get n characters of text after the current cursor position. abstract CharSequence getTextBeforeCursor(int n, int flags) Get n characters of text before the current cursor position. abstract boolean performContextMenuAction(int id) Perform a context menu action on the field. abstract boolean performEditorAction(int editorAction) Have the editor perform an action it has said it can do. abstract boolean performPrivateCommand(String action, Bundle data) API to send private commands from an input method to its connected editor. abstract boolean reportFullscreenMode(boolean enabled) Called by the IME to tell the client when it switches between fullscreen and normal modes. abstract boolean requestCursorUpdates(int cursorUpdateMode) Called by the input method to ask the editor for calling back updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) to notify cursor/anchor locations. abstract boolean sendKeyEvent(KeyEvent event) Send a key event to the process that is currently attached through this input connection. abstract boolean setComposingRegion(int start, int end) Mark a certain region of text as composing text. abstract boolean setComposingText(CharSequence text, int newCursorPosition) Replace the currently composing text with the given text, and set the new cursor position. abstract boolean setSelection(int start, int end) Set the selection of the text editor.","abstract boolean beginBatchEdit() Tell the editor that you are starting a batch of editor operations.","abstract boolean clearMetaKeyStates(int states) Clear the given meta key pressed states in the given input connection.","abstract boolean commitCompletion(CompletionInfo text) Commit a completion the user has selected from the possible ones previously reported to InputMethodSession#displayCompletions(CompletionInfo[]) or InputMethodManager#displayCompletions(View, CompletionInfo[]).","abstract boolean commitCorrection(CorrectionInfo correctionInfo) Commit a correction automatically performed on the raw user's input.","abstract boolean commitText(CharSequence text, int newCursorPosition) Commit text to the text box and set the new cursor position.","abstract boolean deleteSurroundingText(int beforeLength, int afterLength) Delete beforeLength characters of text before the current cursor position, and delete afterLength characters of text after the current cursor position, excluding the selection.","abstract boolean endBatchEdit() Tell the editor that you are done with a batch edit previously initiated with beginBatchEdit().","abstract boolean finishComposingText() Have the text editor finish whatever composing text is currently active.","abstract int getCursorCapsMode(int reqModes) Retrieve the current capitalization mode in effect at the current cursor position in the text.","abstract ExtractedText getExtractedText(ExtractedTextRequest request, int flags) Retrieve the current text in the input connection's editor, and monitor for any changes to it.","abstract CharSequence getSelectedText(int flags) Gets the selected text, if any.","abstract CharSequence getTextAfterCursor(int n, int flags) Get n characters of text after the current cursor position.","abstract CharSequence getTextBeforeCursor(int n, int flags) Get n characters of text before the current cursor position.","abstract boolean performContextMenuAction(int id) Perform a context menu action on the field.","abstract boolean performEditorAction(int editorAction) Have the editor perform an action it has said it can do.","abstract boolean performPrivateCommand(String action, Bundle data) API to send private commands from an input method to its connected editor.","abstract boolean reportFullscreenMode(boolean enabled) Called by the IME to tell the client when it switches between fullscreen and normal modes.","abstract boolean requestCursorUpdates(int cursorUpdateMode) Called by the input method to ask the editor for calling back updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) to notify cursor/anchor locations.","abstract boolean sendKeyEvent(KeyEvent event) Send a key event to the process that is currently attached through this input connection.","abstract boolean setComposingRegion(int start, int end) Mark a certain region of text as composing text.","abstract boolean setComposingText(CharSequence text, int newCursorPosition) Replace the currently composing text with the given text, and set the new cursor position.","abstract boolean setSelection(int start, int end) Set the selection of the text editor."],"package":"android.view.inputmethod","constants":["[Expand] Inherited Constants","From interface android.view.inputmethod.InputConnection int CURSOR_UPDATE_IMMEDIATE The editor is requested to call updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) at once, as soon as possible, regardless of cursor/anchor position changes. int CURSOR_UPDATE_MONITOR The editor is requested to call updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) whenever cursor/anchor position is changed. int GET_EXTRACTED_TEXT_MONITOR Flag for use with getExtractedText(ExtractedTextRequest, int) to indicate you would like to receive updates when the extracted text changes. int GET_TEXT_WITH_STYLES Flag for use with getTextAfterCursor(int, int) and getTextBeforeCursor(int, int) to have style information returned along with the text.","int CURSOR_UPDATE_IMMEDIATE The editor is requested to call updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) at once, as soon as possible, regardless of cursor/anchor position changes.","int CURSOR_UPDATE_MONITOR The editor is requested to call updateCursorAnchorInfo(android.view.View, CursorAnchorInfo) whenever cursor/anchor position is changed.","int GET_EXTRACTED_TEXT_MONITOR Flag for use with getExtractedText(ExtractedTextRequest, int) to indicate you would like to receive updates when the extracted text changes.","int GET_TEXT_WITH_STYLES Flag for use with getTextAfterCursor(int, int) and getTextBeforeCursor(int, int) to have style information returned along with the text."],"class":"BaseInputConnection","constructors":[],"fields":[]}