{"methods":["synchronized void addCookie(Cookie cookie) Adds an HTTP cookie, replacing any existing equivalent cookies.","synchronized void addCookies(Cookie[] cookies) Adds an array of HTTP cookies.","synchronized void clear() Clears all cookies.","synchronized boolean clearExpired(Date date) Removes all of cookies in this HTTP state that have expired by the specified date.","synchronized List<Cookie> getCookies() Returns an immutable array of cookies that this HTTP state currently contains.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.client.CookieStore abstract void addCookie(Cookie cookie) Adds an HTTP cookie, replacing any existing equivalent cookies. abstract void clear() Clears all cookies. abstract boolean clearExpired(Date date) Removes all of cookies in this store that have expired by the specified date. abstract List<Cookie> getCookies() Returns all cookies contained in this store.","abstract void addCookie(Cookie cookie) Adds an HTTP cookie, replacing any existing equivalent cookies.","abstract void clear() Clears all cookies.","abstract boolean clearExpired(Date date) Removes all of cookies in this store that have expired by the specified date.","abstract List<Cookie> getCookies() Returns all cookies contained in this store."],"package":"org.apache.http.impl.client","constants":[],"class":"BasicCookieStore","constructors":[],"fields":[]}