{"methods":["boolean hasProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Checks whether there likely is a protocol version in a line.","final static Header parseHeader(String value, LineParser parser)","Header parseHeader(CharArrayBuffer buffer) Creates a header from a line.","ProtocolVersion parseProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Parses the textual representation of a protocol version.","final static ProtocolVersion parseProtocolVersion(String value, LineParser parser)","final static RequestLine parseRequestLine(String value, LineParser parser)","RequestLine parseRequestLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a request line.","StatusLine parseStatusLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a status line.","final static StatusLine parseStatusLine(String value, LineParser parser)","ProtocolVersion createProtocolVersion(int major, int minor) Creates a protocol version.","RequestLine createRequestLine(String method, String uri, ProtocolVersion ver) Instantiates a new request line.","StatusLine createStatusLine(ProtocolVersion ver, int status, String reason) Instantiates a new status line.","void skipWhitespace(CharArrayBuffer buffer, ParserCursor cursor) Helper to skip whitespace.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.message.LineParser abstract boolean hasProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Checks whether there likely is a protocol version in a line. abstract Header parseHeader(CharArrayBuffer buffer) Creates a header from a line. abstract ProtocolVersion parseProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Parses the textual representation of a protocol version. abstract RequestLine parseRequestLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a request line. abstract StatusLine parseStatusLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a status line.","abstract boolean hasProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Checks whether there likely is a protocol version in a line.","abstract Header parseHeader(CharArrayBuffer buffer) Creates a header from a line.","abstract ProtocolVersion parseProtocolVersion(CharArrayBuffer buffer, ParserCursor cursor) Parses the textual representation of a protocol version.","abstract RequestLine parseRequestLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a request line.","abstract StatusLine parseStatusLine(CharArrayBuffer buffer, ParserCursor cursor) Parses a status line."],"package":"org.apache.http.message","constants":[],"class":"BasicLineParser","constructors":[],"fields":["public static final BasicLineParser DEFAULT A default instance of this class, for use as default or fallback.","protected final ProtocolVersion protocol A version of the protocol to parse."]}