{"methods":["void clear() Removes all parameters from this collection.","Object clone() Creates and returns a copy of this Object.","HttpParams copy() Creates a copy of these parameters.","Object getParameter(String name)","boolean isParameterSet(String name)","boolean isParameterSetLocally(String name)","boolean removeParameter(String name)","HttpParams setParameter(String name, Object value)","void setParameters(String[] names, Object value) Assigns the value to all the parameter with the given names","void copyParams(HttpParams target) Copies the locally defined parameters to the argument parameters.","[Expand] Inherited Methods","From class org.apache.http.params.AbstractHttpParams boolean getBooleanParameter(String name, boolean defaultValue) Returns a Boolean parameter value with the given name. double getDoubleParameter(String name, double defaultValue) Returns a Double parameter value with the given name. int getIntParameter(String name, int defaultValue) Returns an Integer parameter value with the given name. long getLongParameter(String name, long defaultValue) Returns a Long parameter value with the given name. boolean isParameterFalse(String name) Checks if a boolean parameter is not set or false. boolean isParameterTrue(String name) Checks if a boolean parameter is set to true. HttpParams setBooleanParameter(String name, boolean value) Assigns a Boolean to the parameter with the given name HttpParams setDoubleParameter(String name, double value) Assigns a Double to the parameter with the given name HttpParams setIntParameter(String name, int value) Assigns an Integer to the parameter with the given name HttpParams setLongParameter(String name, long value) Assigns a Long to the parameter with the given name","boolean getBooleanParameter(String name, boolean defaultValue) Returns a Boolean parameter value with the given name.","double getDoubleParameter(String name, double defaultValue) Returns a Double parameter value with the given name.","int getIntParameter(String name, int defaultValue) Returns an Integer parameter value with the given name.","long getLongParameter(String name, long defaultValue) Returns a Long parameter value with the given name.","boolean isParameterFalse(String name) Checks if a boolean parameter is not set or false.","boolean isParameterTrue(String name) Checks if a boolean parameter is set to true.","HttpParams setBooleanParameter(String name, boolean value) Assigns a Boolean to the parameter with the given name","HttpParams setDoubleParameter(String name, double value) Assigns a Double to the parameter with the given name","HttpParams setIntParameter(String name, int value) Assigns an Integer to the parameter with the given name","HttpParams setLongParameter(String name, long value) Assigns a Long to the parameter with the given name","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.params.HttpParams abstract HttpParams copy() Creates a copy of these parameters. abstract boolean getBooleanParameter(String name, boolean defaultValue) Returns a Boolean parameter value with the given name. abstract double getDoubleParameter(String name, double defaultValue) Returns a Double parameter value with the given name. abstract int getIntParameter(String name, int defaultValue) Returns an Integer parameter value with the given name. abstract long getLongParameter(String name, long defaultValue) Returns a Long parameter value with the given name. abstract Object getParameter(String name) Obtains the value of the given parameter. abstract boolean isParameterFalse(String name) Checks if a boolean parameter is not set or false. abstract boolean isParameterTrue(String name) Checks if a boolean parameter is set to true. abstract boolean removeParameter(String name) Removes the parameter with the specified name. abstract HttpParams setBooleanParameter(String name, boolean value) Assigns a Boolean to the parameter with the given name abstract HttpParams setDoubleParameter(String name, double value) Assigns a Double to the parameter with the given name abstract HttpParams setIntParameter(String name, int value) Assigns an Integer to the parameter with the given name abstract HttpParams setLongParameter(String name, long value) Assigns a Long to the parameter with the given name abstract HttpParams setParameter(String name, Object value) Assigns the value to the parameter with the given name.","abstract HttpParams copy() Creates a copy of these parameters.","abstract boolean getBooleanParameter(String name, boolean defaultValue) Returns a Boolean parameter value with the given name.","abstract double getDoubleParameter(String name, double defaultValue) Returns a Double parameter value with the given name.","abstract int getIntParameter(String name, int defaultValue) Returns an Integer parameter value with the given name.","abstract long getLongParameter(String name, long defaultValue) Returns a Long parameter value with the given name.","abstract Object getParameter(String name) Obtains the value of the given parameter.","abstract boolean isParameterFalse(String name) Checks if a boolean parameter is not set or false.","abstract boolean isParameterTrue(String name) Checks if a boolean parameter is set to true.","abstract boolean removeParameter(String name) Removes the parameter with the specified name.","abstract HttpParams setBooleanParameter(String name, boolean value) Assigns a Boolean to the parameter with the given name","abstract HttpParams setDoubleParameter(String name, double value) Assigns a Double to the parameter with the given name","abstract HttpParams setIntParameter(String name, int value) Assigns an Integer to the parameter with the given name","abstract HttpParams setLongParameter(String name, long value) Assigns a Long to the parameter with the given name","abstract HttpParams setParameter(String name, Object value) Assigns the value to the parameter with the given name."],"package":"org.apache.http.params","constants":[],"class":"BasicHttpParams","constructors":[],"fields":[]}