{"methods":["CharArrayBuffer appendProtocolVersion(CharArrayBuffer buffer, ProtocolVersion version) Formats a protocol version.","final static String formatHeader(Header header, LineFormatter formatter) Formats a header.","CharArrayBuffer formatHeader(CharArrayBuffer buffer, Header header) Formats a header.","final static String formatProtocolVersion(ProtocolVersion version, LineFormatter formatter) Formats a protocol version.","CharArrayBuffer formatRequestLine(CharArrayBuffer buffer, RequestLine reqline) Formats a request line.","final static String formatRequestLine(RequestLine reqline, LineFormatter formatter) Formats a request line.","final static String formatStatusLine(StatusLine statline, LineFormatter formatter) Formats a status line.","CharArrayBuffer formatStatusLine(CharArrayBuffer buffer, StatusLine statline) Formats a status line.","void doFormatHeader(CharArrayBuffer buffer, Header header) Actually formats a header.","void doFormatRequestLine(CharArrayBuffer buffer, RequestLine reqline) Actually formats a request line.","void doFormatStatusLine(CharArrayBuffer buffer, StatusLine statline) Actually formats a status line.","int estimateProtocolVersionLen(ProtocolVersion version) Guesses the length of a formatted protocol version.","CharArrayBuffer initBuffer(CharArrayBuffer buffer) Obtains a buffer for formatting.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.message.LineFormatter abstract CharArrayBuffer appendProtocolVersion(CharArrayBuffer buffer, ProtocolVersion version) Formats a protocol version. abstract CharArrayBuffer formatHeader(CharArrayBuffer buffer, Header header) Formats a header. abstract CharArrayBuffer formatRequestLine(CharArrayBuffer buffer, RequestLine reqline) Formats a request line. abstract CharArrayBuffer formatStatusLine(CharArrayBuffer buffer, StatusLine statline) Formats a status line.","abstract CharArrayBuffer appendProtocolVersion(CharArrayBuffer buffer, ProtocolVersion version) Formats a protocol version.","abstract CharArrayBuffer formatHeader(CharArrayBuffer buffer, Header header) Formats a header.","abstract CharArrayBuffer formatRequestLine(CharArrayBuffer buffer, RequestLine reqline) Formats a request line.","abstract CharArrayBuffer formatStatusLine(CharArrayBuffer buffer, StatusLine statline) Formats a status line."],"package":"org.apache.http.message","constants":[],"class":"BasicLineFormatter","constructors":[],"fields":["public static final BasicLineFormatter DEFAULT A default instance of this class, for use as default or fallback."]}