{"methods":["int nextStep(RouteInfo plan, RouteInfo fact) Provides the next step.","int directStep(RouteInfo plan, RouteInfo fact) Determines the next step to establish a direct connection.","int firstStep(RouteInfo plan) Determines the first step to establish a route.","int proxiedStep(RouteInfo plan, RouteInfo fact) Determines the next step to establish a connection via proxy.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.conn.routing.HttpRouteDirector abstract int nextStep(RouteInfo plan, RouteInfo fact) Provides the next step.","abstract int nextStep(RouteInfo plan, RouteInfo fact) Provides the next step."],"package":"org.apache.http.conn.routing","constants":["[Expand] Inherited Constants","From interface org.apache.http.conn.routing.HttpRouteDirector int COMPLETE Indicates that the route is complete. int CONNECT_PROXY Step: open connection to proxy. int CONNECT_TARGET Step: open connection to target. int LAYER_PROTOCOL Step: layer protocol (over tunnel). int TUNNEL_PROXY Step: tunnel through proxy to other proxy. int TUNNEL_TARGET Step: tunnel through proxy to target. int UNREACHABLE Indicates that the route can not be established at all.","int COMPLETE Indicates that the route is complete.","int CONNECT_PROXY Step: open connection to proxy.","int CONNECT_TARGET Step: open connection to target.","int LAYER_PROTOCOL Step: layer protocol (over tunnel).","int TUNNEL_PROXY Step: tunnel through proxy to other proxy.","int TUNNEL_TARGET Step: tunnel through proxy to target.","int UNREACHABLE Indicates that the route can not be established at all."],"class":"BasicRouteDirector","constructors":[],"fields":[]}