{"methods":["boolean hasNext() Indicates whether there is another header in this iteration.","final Object next() Returns the next header.","Header nextHeader() Obtains the next header from this iteration.","void remove() Removes the header that was returned last.","boolean filterHeader(int index) Checks whether a header is part of the iteration.","int findNext(int from) Determines the index of the next header.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.Iterator abstract boolean hasNext() Returns true if there is at least one more element, false otherwise. abstract E next() Returns the next object and advances the iterator. abstract void remove() Removes the last object returned by next from the collection.","abstract boolean hasNext() Returns true if there is at least one more element, false otherwise.","abstract E next() Returns the next object and advances the iterator.","abstract void remove() Removes the last object returned by next from the collection.","From interface org.apache.http.HeaderIterator abstract boolean hasNext() Indicates whether there is another header in this iteration. abstract Header nextHeader() Obtains the next header from this iteration.","abstract boolean hasNext() Indicates whether there is another header in this iteration.","abstract Header nextHeader() Obtains the next header from this iteration."],"package":"org.apache.http.message","constants":[],"class":"BasicListHeaderIterator","constructors":[],"fields":["protected final List allHeaders A list of headers to iterate over.","protected int currentIndex The position of the next header in allHeaders.","protected String headerName The header name to filter by.","protected int lastIndex The position of the last returned header."]}