{"methods":["int getIntProperty(int id) Return the value of a battery property of integer type.","long getLongProperty(int id) Return the value of a battery property of long type If the platform does not provide the property queried, this value will be Long.MIN_VALUE.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":["int BATTERY_HEALTH_COLD","int BATTERY_HEALTH_DEAD","int BATTERY_HEALTH_GOOD","int BATTERY_HEALTH_OVERHEAT","int BATTERY_HEALTH_OVER_VOLTAGE","int BATTERY_HEALTH_UNKNOWN","int BATTERY_HEALTH_UNSPECIFIED_FAILURE","int BATTERY_PLUGGED_AC Power source is an AC charger.","int BATTERY_PLUGGED_USB Power source is a USB port.","int BATTERY_PLUGGED_WIRELESS Power source is wireless.","int BATTERY_PROPERTY_CAPACITY Remaining battery capacity as an integer percentage of total capacity (with no fractional part).","int BATTERY_PROPERTY_CHARGE_COUNTER Battery capacity in microampere-hours, as an integer.","int BATTERY_PROPERTY_CURRENT_AVERAGE Average battery current in microamperes, as an integer.","int BATTERY_PROPERTY_CURRENT_NOW Instantaneous battery current in microamperes, as an integer.","int BATTERY_PROPERTY_ENERGY_COUNTER Battery remaining energy in nanowatt-hours, as a long integer.","int BATTERY_STATUS_CHARGING","int BATTERY_STATUS_DISCHARGING","int BATTERY_STATUS_FULL","int BATTERY_STATUS_NOT_CHARGING","int BATTERY_STATUS_UNKNOWN","String EXTRA_HEALTH Extra for ACTION_BATTERY_CHANGED: integer containing the current health constant.","String EXTRA_ICON_SMALL Extra for ACTION_BATTERY_CHANGED: integer containing the resource ID of a small status bar icon indicating the current battery state.","String EXTRA_LEVEL Extra for ACTION_BATTERY_CHANGED: integer field containing the current battery level, from 0 to EXTRA_SCALE.","String EXTRA_PLUGGED Extra for ACTION_BATTERY_CHANGED: integer indicating whether the device is plugged in to a power source; 0 means it is on battery, other constants are different types of power sources.","String EXTRA_PRESENT Extra for ACTION_BATTERY_CHANGED: boolean indicating whether a battery is present.","String EXTRA_SCALE Extra for ACTION_BATTERY_CHANGED: integer containing the maximum battery level.","String EXTRA_STATUS Extra for ACTION_BATTERY_CHANGED: integer containing the current status constant.","String EXTRA_TECHNOLOGY Extra for ACTION_BATTERY_CHANGED: String describing the technology of the current battery.","String EXTRA_TEMPERATURE Extra for ACTION_BATTERY_CHANGED: integer containing the current battery temperature.","String EXTRA_VOLTAGE Extra for ACTION_BATTERY_CHANGED: integer containing the current battery voltage level."],"class":"BatteryManager","constructors":[],"fields":[]}