{"methods":["static BidiFormatter getInstance(Locale locale) Factory for creating an instance of BidiFormatter given the context locale.","static BidiFormatter getInstance() Factory for creating an instance of BidiFormatter for the default locale directionality.","static BidiFormatter getInstance(boolean rtlContext) Factory for creating an instance of BidiFormatter given the context directionality.","boolean getStereoReset()","boolean isRtl(String str) Estimates the directionality of a string using the default text direction heuristic.","boolean isRtlContext()","String unicodeWrap(String str, TextDirectionHeuristic heuristic, boolean isolate) Formats a string of given directionality for use in plain-text output of the context directionality, so an opposite-directionality string is neither garbled nor garbles its surroundings.","String unicodeWrap(String str, boolean isolate) Operates like unicodeWrap(String, TextDirectionHeuristic, boolean), but uses the formatter's default direction estimation algorithm.","String unicodeWrap(String str) Operates like unicodeWrap(String, TextDirectionHeuristic, boolean), but uses the formatter's default direction estimation algorithm and assumes isolate is true.","String unicodeWrap(String str, TextDirectionHeuristic heuristic) Operates like unicodeWrap(String, TextDirectionHeuristic, boolean), but assumes isolate is true.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.text","constants":[],"class":"BidiFormatter","constructors":[],"fields":[]}