{"methods":["boolean baseIsLeftToRight() Returns whether the base level is from left to right.","Bidi createLineBidi(int lineStart, int lineLimit) Creates a new Bidi object containing the information of one line from this object.","int getBaseLevel() Returns the base level.","int getLength() Returns the length of the text.","int getLevelAt(int offset) Returns the level of the given character.","int getRunCount() Returns the number of runs in the text, at least 1.","int getRunLevel(int run) Returns the level of the given run.","int getRunLimit(int run) Returns the limit offset of the given run.","int getRunStart(int run) Returns the start offset of the given run.","boolean isLeftToRight() Returns true if the text is from left to right, that is, both the base direction and the text direction is from left to right.","boolean isMixed() Returns true if the text direction is mixed.","boolean isRightToLeft() Returns true if the text is from right to left, that is, both the base direction and the text direction is from right to left.","static void reorderVisually(byte[] levels, int levelStart, Object[] objects, int objectStart, int count) Reorders a range of objects according to their specified levels.","static boolean requiresBidi(char[] text, int start, int limit) Indicates whether a range of characters of a text requires a Bidi object to display properly.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.text","constants":["int DIRECTION_DEFAULT_LEFT_TO_RIGHT Constant that indicates the default base level.","int DIRECTION_DEFAULT_RIGHT_TO_LEFT Constant that indicates the default base level.","int DIRECTION_LEFT_TO_RIGHT Constant that specifies the default base level as 0 (left-to-right).","int DIRECTION_RIGHT_TO_LEFT Constant that specifies the default base level as 1 (right-to-left)."],"class":"Bidi","constructors":[],"fields":[]}