{"methods":["BigInteger abs() Returns a BigInteger whose value is the absolute value of this.","BigInteger add(BigInteger value) Returns a BigInteger whose value is this + value.","BigInteger and(BigInteger value) Returns a BigInteger whose value is this & value.","BigInteger andNot(BigInteger value) Returns a BigInteger whose value is this & ~value.","int bitCount() Returns the number of bits in the two's complement representation of this which differ from the sign bit.","int bitLength() Returns the length of the value's two's complement representation without leading zeros for positive numbers / without leading ones for negative values.","BigInteger clearBit(int n) Returns a BigInteger which has the same binary representation as this but with the bit at position n cleared.","int compareTo(BigInteger value) Compares this BigInteger with value.","BigInteger divide(BigInteger divisor) Returns a BigInteger whose value is this / divisor.","BigInteger[] divideAndRemainder(BigInteger divisor) Returns a two element BigInteger array containing this / divisor at index 0 and this % divisor at index 1.","double doubleValue() Returns this BigInteger as a double.","boolean equals(Object x) Compares this instance with the specified object and indicates if they are equal.","BigInteger flipBit(int n) Returns a BigInteger which has the same binary representation as this but with the bit at position n flipped.","float floatValue() Returns this BigInteger as a float.","BigInteger gcd(BigInteger value) Returns a BigInteger whose value is greatest common divisor of this and value.","int getLowestSetBit() Returns the position of the lowest set bit in the two's complement representation of this BigInteger.","int hashCode() Returns an integer hash code for this object.","int intValue() Returns this BigInteger as an int value.","boolean isProbablePrime(int certainty) Tests whether this BigInteger is probably prime.","long longValue() Returns this BigInteger as a long value.","BigInteger max(BigInteger value) Returns the maximum of this BigInteger and value.","BigInteger min(BigInteger value) Returns the minimum of this BigInteger and value.","BigInteger mod(BigInteger m) Returns a BigInteger whose value is this mod m.","BigInteger modInverse(BigInteger m) Returns a BigInteger whose value is 1/this mod m.","BigInteger modPow(BigInteger exponent, BigInteger modulus) Returns a BigInteger whose value is pow(this, exponent) mod modulus.","BigInteger multiply(BigInteger value) Returns a BigInteger whose value is this * value.","BigInteger negate() Returns a BigInteger whose value is the -this.","BigInteger nextProbablePrime() Returns the smallest integer x > this which is probably prime as a BigInteger instance.","BigInteger not() Returns a BigInteger whose value is ~this.","BigInteger or(BigInteger value) Returns a BigInteger whose value is this | value.","BigInteger pow(int exp) Returns a BigInteger whose value is pow(this, exp).","static BigInteger probablePrime(int bitLength, Random random) Returns a random positive BigInteger instance in the range [0, pow(2, bitLength)-1] which is probably prime.","BigInteger remainder(BigInteger divisor) Returns a BigInteger whose value is this % divisor.","BigInteger setBit(int n) Returns a BigInteger which has the same binary representation as this but with the bit at position n set.","BigInteger shiftLeft(int n) Returns a BigInteger whose value is this << n.","BigInteger shiftRight(int n) Returns a BigInteger whose value is this >> n.","int signum() Returns the sign of this BigInteger.","BigInteger subtract(BigInteger value) Returns a BigInteger whose value is this - value.","boolean testBit(int n) Tests whether the bit at position n in this is set.","byte[] toByteArray() Returns the two's complement representation of this BigInteger in a byte array.","String toString() Returns a string representation of this BigInteger in decimal form.","String toString(int radix) Returns a string containing a string representation of this BigInteger with base radix.","static BigInteger valueOf(long value) Returns a BigInteger whose value is equal to value.","BigInteger xor(BigInteger value) Returns a BigInteger whose value is this ^ value.","[Expand] Inherited Methods","From class java.lang.Number byte byteValue() Returns this object's value as a byte. abstract double doubleValue() Returns this object's value as a double. abstract float floatValue() Returns this object's value as a float. abstract int intValue() Returns this object's value as an int. abstract long longValue() Returns this object's value as a long. short shortValue() Returns this object's value as a short.","byte byteValue() Returns this object's value as a byte.","abstract double doubleValue() Returns this object's value as a double.","abstract float floatValue() Returns this object's value as a float.","abstract int intValue() Returns this object's value as an int.","abstract long longValue() Returns this object's value as a long.","short shortValue() Returns this object's value as a short.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.math","constants":[],"class":"BigInteger","constructors":[],"fields":["public static final BigInteger ONE The BigInteger constant 1.","public static final BigInteger TEN The BigInteger constant 10.","public static final BigInteger ZERO The BigInteger constant 0."]}