{"methods":["void and(BitSet bs) Logically ands the bits of this BitSet with bs.","void andNot(BitSet bs) Clears all bits in this BitSet which are also set in bs.","int cardinality() Returns the number of bits that are true in this BitSet.","void clear(int index) Clears the bit at index index.","void clear() Clears all the bits in this BitSet.","void clear(int fromIndex, int toIndex) Clears the range of bits [fromIndex, toIndex).","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void flip(int index) Flips the bit at index index.","void flip(int fromIndex, int toIndex) Flips the range of bits [fromIndex, toIndex).","boolean get(int index) Returns the bit at index index.","BitSet get(int fromIndex, int toIndex) Returns a new BitSet containing the range of bits [fromIndex, toIndex), shifted down so that the bit at fromIndex is at bit 0 in the new BitSet.","int hashCode() Returns an integer hash code for this object.","boolean intersects(BitSet bs) Returns true if this.and(bs) is non-empty, but may be faster than computing that.","boolean isEmpty() Returns true if all the bits in this BitSet are set to false, false otherwise.","int length() Returns the number of bits up to and including the highest bit set.","int nextClearBit(int index) Returns the index of the first bit that is clear on or after index.","int nextSetBit(int index) Returns the index of the first bit that is set on or after index, or -1 if no higher bits are set.","void or(BitSet bs) Logically ors the bits of this BitSet with bs.","int previousClearBit(int index) Returns the index of the first bit that is clear on or before index, or -1 if no lower bits are clear or index == -1.","int previousSetBit(int index) Returns the index of the first bit that is set on or before index, or -1 if no lower bits are set or index == -1.","void set(int index, boolean state) Sets the bit at index index to state.","void set(int fromIndex, int toIndex, boolean state) Sets the range of bits [fromIndex, toIndex) to state.","void set(int fromIndex, int toIndex) Sets the range of bits [fromIndex, toIndex).","void set(int index) Sets the bit at index index to true.","int size() Returns the capacity in bits of the array implementing this BitSet.","byte[] toByteArray() Returns a new byte[] containing a little-endian representation the bits of this BitSet, suitable for passing to valueOf to reconstruct this BitSet.","long[] toLongArray() Returns a new long[] containing a little-endian representation of the bits of this BitSet, suitable for passing to valueOf to reconstruct this BitSet.","String toString() Returns a string containing a concise, human-readable description of the receiver: a comma-delimited list of the indexes of all set bits.","static BitSet valueOf(byte[] bytes) Equivalent to BitSet.valueOf(ByteBuffer.wrap(bytes)).","static BitSet valueOf(ByteBuffer byteBuffer) Returns a BitSet corresponding to byteBuffer, interpreted as a little-endian sequence of bits.","static BitSet valueOf(LongBuffer longBuffer) Returns a BitSet corresponding to longBuffer, interpreted as a little-endian sequence of bits.","static BitSet valueOf(long[] longs) Equivalent to BitSet.valueOf(LongBuffer.wrap(longs)), but likely to be faster.","void xor(BitSet bs) Logically xors the bits of this BitSet with bs.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util","constants":[],"class":"BitSet","constructors":[],"fields":[]}