{"methods":["BluetoothGattCharacteristic getCharacteristic() Returns the characteristic this descriptor belongs to.","int getPermissions() Returns the permissions for this descriptor.","UUID getUuid() Returns the UUID of this descriptor.","byte[] getValue() Returns the stored value for this descriptor This function returns the stored value for this descriptor as retrieved by calling readDescriptor(BluetoothGattDescriptor).","boolean setValue(byte[] value) Updates the locally stored value of this descriptor.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.bluetooth","constants":["int PERMISSION_READ Descriptor read permission","int PERMISSION_READ_ENCRYPTED Descriptor permission: Allow encrypted read operations","int PERMISSION_READ_ENCRYPTED_MITM Descriptor permission: Allow reading with man-in-the-middle protection","int PERMISSION_WRITE Descriptor write permission","int PERMISSION_WRITE_ENCRYPTED Descriptor permission: Allow encrypted writes","int PERMISSION_WRITE_ENCRYPTED_MITM Descriptor permission: Allow encrypted writes with man-in-the-middle protection","int PERMISSION_WRITE_SIGNED Descriptor permission: Allow signed write operations","int PERMISSION_WRITE_SIGNED_MITM Descriptor permission: Allow signed write operations with man-in-the-middle protection"],"class":"BluetoothGattDescriptor","constructors":[],"fields":["public static final byte[] DISABLE_NOTIFICATION_VALUE Value used to disable notifications or indicatinos","public static final byte[] ENABLE_INDICATION_VALUE Value used to enable indication for a client configuration descriptor","public static final byte[] ENABLE_NOTIFICATION_VALUE Value used to enable notification for a client configuration descriptor"]}