{"methods":["boolean booleanValue() Gets the primitive value of this boolean, either true or false.","static int compare(boolean lhs, boolean rhs) Compares two boolean values.","int compareTo(Boolean that) Compares this object to the specified boolean object to determine their relative order.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","static boolean getBoolean(String string) Returns the boolean value of the system property identified by string.","int hashCode() Returns an integer hash code for this boolean.","static boolean parseBoolean(String s) Parses the specified string as a boolean.","static String toString(boolean value) Converts the specified boolean to its string representation.","String toString() Returns a string containing a concise, human-readable description of this boolean.","static Boolean valueOf(String string) Parses the specified string as a boolean value.","static Boolean valueOf(boolean b) Returns a Boolean instance for the specified boolean value.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.lang","constants":[],"class":"Boolean","constructors":[],"fields":["public static final Boolean FALSE The Boolean object that represents the primitive value false.","public static final Boolean TRUE The Boolean object that represents the primitive value true.","public static final Class<Boolean> TYPE The Class object that represents the primitive type boolean."]}