{"methods":["final static void addSearchUrl(ContentResolver cr, String search) Add a search string to the searches database.","final static boolean canClearHistory(ContentResolver cr) Returns whether there is any history to clear.","final static void clearHistory(ContentResolver cr) Delete all entries from the bookmarks/history table which are not bookmarks.","final static void clearSearches(ContentResolver cr) Remove all searches from the search database.","final static void deleteFromHistory(ContentResolver cr, String url) Remove a specific url from the history database.","final static void deleteHistoryTimeFrame(ContentResolver cr, long begin, long end) Delete all history items from begin to end.","final static Cursor getAllBookmarks(ContentResolver cr) Return a cursor pointing to a list of all the bookmarks.","final static Cursor getAllVisitedUrls(ContentResolver cr) Return a cursor pointing to a list of all visited site urls.","final static void requestAllIcons(ContentResolver cr, String where, WebIconDatabase.IconListener listener) Request all icons from the database.","final static void saveBookmark(Context c, String title, String url) Open an activity to save a bookmark.","final static void sendString(Context context, String string) Sends the given string using an Intent with ACTION_SEND and a mime type of text/plain.","final static void truncateHistory(ContentResolver cr) If there are more than MAX_HISTORY_COUNT non-bookmark history items in the bookmark/history table, delete TRUNCATE_N_OLDEST of them.","final static void updateVisitedHistory(ContentResolver cr, String url, boolean real) Update the visited history to acknowledge that a site has been visited.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String EXTRA_APPLICATION_ID The name of the extra data when starting the Browser from another application.","String EXTRA_CREATE_NEW_TAB Boolean extra passed along with an Intent to a browser, specifying that a new tab be created.","String EXTRA_HEADERS The name of the extra data in the VIEW intent.","int HISTORY_PROJECTION_BOOKMARK_INDEX","int HISTORY_PROJECTION_DATE_INDEX","int HISTORY_PROJECTION_FAVICON_INDEX","int HISTORY_PROJECTION_ID_INDEX","int HISTORY_PROJECTION_TITLE_INDEX","int HISTORY_PROJECTION_URL_INDEX","int HISTORY_PROJECTION_VISITS_INDEX","String INITIAL_ZOOM_LEVEL The name of extra data when starting Browser with ACTION_VIEW or ACTION_SEARCH intent.","int SEARCHES_PROJECTION_DATE_INDEX","int SEARCHES_PROJECTION_SEARCH_INDEX","int TRUNCATE_HISTORY_PROJECTION_ID_INDEX","int TRUNCATE_N_OLDEST"],"class":"Browser","constructors":[],"fields":["public static final Uri BOOKMARKS_URI A table containing both bookmarks and history items.","public static final String[] HISTORY_PROJECTION","public static final String[] SEARCHES_PROJECTION A projection of SEARCHES_URI that contains _ID, SEARCH, and DATE.","public static final Uri SEARCHES_URI A table containing a log of browser searches.","public static final String[] TRUNCATE_HISTORY_PROJECTION"]}