{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":["int BASE October 2008: The original, first, version of Android.","int BASE_1_1 February 2009: First Android update, officially called 1.1.","int CUPCAKE May 2009: Android 1.5.","int CUR_DEVELOPMENT Magic version number for a current development build, which has not yet turned into an official release.","int DONUT September 2009: Android 1.6.","int ECLAIR November 2009: Android 2.0 Applications targeting this or a later release will get these new changes in behavior: The Service.onStartCommand function will return the new START_STICKY behavior instead of the old compatibility START_STICKY_COMPATIBILITY.","int ECLAIR_0_1 December 2009: Android 2.0.1","int ECLAIR_MR1 January 2010: Android 2.1","int FROYO June 2010: Android 2.2","int GINGERBREAD November 2010: Android 2.3 Applications targeting this or a later release will get these new changes in behavior: The application's notification icons will be shown on the new dark status bar background, so must be visible in this situation.","int GINGERBREAD_MR1 February 2011: Android 2.3.3.","int HONEYCOMB February 2011: Android 3.0.","int HONEYCOMB_MR1 May 2011: Android 3.1.","int HONEYCOMB_MR2 June 2011: Android 3.2.","int ICE_CREAM_SANDWICH October 2011: Android 4.0.","int ICE_CREAM_SANDWICH_MR1 December 2011: Android 4.0.3.","int JELLY_BEAN June 2012: Android 4.1.","int JELLY_BEAN_MR1 November 2012: Android 4.2, Moar jelly beans! Applications targeting this or a later release will get these new changes in behavior: Content Providers: The default value of android:exported is now false.","int JELLY_BEAN_MR2 July 2013: Android 4.3, the revenge of the beans.","int KITKAT October 2013: Android 4.4, KitKat, another tasty treat.","int KITKAT_WATCH Android 4.4W: KitKat for watches, snacks on the run.","int L Temporary until we completely switch to LOLLIPOP.","int LOLLIPOP Lollipop."],"class":"Build.VERSION_CODES","constructors":[],"fields":[]}