{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String KEY_TIMEZONE_INSTANCES The key for updating the time zone used by the provider when it generates the instances table.","String KEY_TIMEZONE_INSTANCES_PREVIOUS The key for reading the last time zone set by the user.","String KEY_TIMEZONE_TYPE They key for updating the use of auto/home time zones in Calendar.","String TIMEZONE_TYPE_AUTO The value to write to KEY_TIMEZONE_TYPE if the provider should stay in sync with the device's time zone.","String TIMEZONE_TYPE_HOME The value to write to KEY_TIMEZONE_TYPE if the provider should use a fixed time zone set by the user.","[Expand] Inherited Constants","From interface android.provider.CalendarContract.CalendarCacheColumns String KEY The key for the setting. String VALUE The value of the given setting.","String KEY The key for the setting.","String VALUE The value of the given setting."],"class":"CalendarContract.CalendarCache","constructors":[],"fields":["public static final Uri URI The URI to use for retrieving the properties from the Calendar db."]}