{"methods":["static EntityIterator newEntityIterator(Cursor cursor) Creates an entity iterator for the given cursor.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.CalendarContract.CalendarColumns String ALLOWED_ATTENDEE_TYPES A comma separated list of attendee types supported for this calendar in the format \"#,#,#\". String ALLOWED_AVAILABILITY A comma separated list of availability types supported for this calendar in the format \"#,#,#\". String ALLOWED_REMINDERS A comma separated list of reminder methods supported for this calendar in the format \"#,#,#\". String CALENDAR_ACCESS_LEVEL The level of access that the user has for the calendar Type: INTEGER (one of the values below) String CALENDAR_COLOR The color of the calendar. String CALENDAR_COLOR_KEY A key for looking up a color from the CalendarContract.Colors table. String CALENDAR_DISPLAY_NAME The display name of the calendar. String CALENDAR_TIME_ZONE The time zone the calendar is associated with. int CAL_ACCESS_CONTRIBUTOR Full access to modify the calendar, but not the access control settings int CAL_ACCESS_EDITOR Full access to modify the calendar, but not the access control settings int CAL_ACCESS_FREEBUSY Can only see free/busy information about the calendar int CAL_ACCESS_NONE Cannot access the calendar int CAL_ACCESS_OVERRIDE not used int CAL_ACCESS_OWNER Full access to the calendar int CAL_ACCESS_READ Can read all event details int CAL_ACCESS_RESPOND Can reply yes/no/maybe to an event int CAL_ACCESS_ROOT Domain admin String CAN_MODIFY_TIME_ZONE Can the organizer modify the time zone of the event? Column name. String CAN_ORGANIZER_RESPOND Can the organizer respond to the event? If no, the status of the organizer should not be shown by the UI. String IS_PRIMARY Is this the primary calendar for this account. String MAX_REMINDERS The maximum number of reminders allowed for an event. String OWNER_ACCOUNT The owner account for this calendar, based on the calendar feed. String SYNC_EVENTS Is this calendar synced and are its events stored on the device? 0 - Do not sync this calendar or store events for this calendar. String VISIBLE Is the calendar selected to be displayed? 0 - do not show events associated with this calendar.","String ALLOWED_ATTENDEE_TYPES A comma separated list of attendee types supported for this calendar in the format \"#,#,#\".","String ALLOWED_AVAILABILITY A comma separated list of availability types supported for this calendar in the format \"#,#,#\".","String ALLOWED_REMINDERS A comma separated list of reminder methods supported for this calendar in the format \"#,#,#\".","String CALENDAR_ACCESS_LEVEL The level of access that the user has for the calendar Type: INTEGER (one of the values below)","String CALENDAR_COLOR The color of the calendar.","String CALENDAR_COLOR_KEY A key for looking up a color from the CalendarContract.Colors table.","String CALENDAR_DISPLAY_NAME The display name of the calendar.","String CALENDAR_TIME_ZONE The time zone the calendar is associated with.","int CAL_ACCESS_CONTRIBUTOR Full access to modify the calendar, but not the access control settings","int CAL_ACCESS_EDITOR Full access to modify the calendar, but not the access control settings","int CAL_ACCESS_FREEBUSY Can only see free/busy information about the calendar","int CAL_ACCESS_NONE Cannot access the calendar","int CAL_ACCESS_OVERRIDE not used","int CAL_ACCESS_OWNER Full access to the calendar","int CAL_ACCESS_READ Can read all event details","int CAL_ACCESS_RESPOND Can reply yes/no/maybe to an event","int CAL_ACCESS_ROOT Domain admin","String CAN_MODIFY_TIME_ZONE Can the organizer modify the time zone of the event? Column name.","String CAN_ORGANIZER_RESPOND Can the organizer respond to the event? If no, the status of the organizer should not be shown by the UI.","String IS_PRIMARY Is this the primary calendar for this account.","String MAX_REMINDERS The maximum number of reminders allowed for an event.","String OWNER_ACCOUNT The owner account for this calendar, based on the calendar feed.","String SYNC_EVENTS Is this calendar synced and are its events stored on the device? 0 - Do not sync this calendar or store events for this calendar.","String VISIBLE Is the calendar selected to be displayed? 0 - do not show events associated with this calendar.","From interface android.provider.CalendarContract.CalendarSyncColumns String CAL_SYNC1 Generic column for use by sync adapters. String CAL_SYNC10 Generic column for use by sync adapters. String CAL_SYNC2 Generic column for use by sync adapters. String CAL_SYNC3 Generic column for use by sync adapters. String CAL_SYNC4 Generic column for use by sync adapters. String CAL_SYNC5 Generic column for use by sync adapters. String CAL_SYNC6 Generic column for use by sync adapters. String CAL_SYNC7 Generic column for use by sync adapters. String CAL_SYNC8 Generic column for use by sync adapters. String CAL_SYNC9 Generic column for use by sync adapters.","String CAL_SYNC1 Generic column for use by sync adapters.","String CAL_SYNC10 Generic column for use by sync adapters.","String CAL_SYNC2 Generic column for use by sync adapters.","String CAL_SYNC3 Generic column for use by sync adapters.","String CAL_SYNC4 Generic column for use by sync adapters.","String CAL_SYNC5 Generic column for use by sync adapters.","String CAL_SYNC6 Generic column for use by sync adapters.","String CAL_SYNC7 Generic column for use by sync adapters.","String CAL_SYNC8 Generic column for use by sync adapters.","String CAL_SYNC9 Generic column for use by sync adapters.","From interface android.provider.CalendarContract.SyncColumns String ACCOUNT_NAME The account that was used to sync the entry to the device. String ACCOUNT_TYPE The type of the account that was used to sync the entry to the device. String CAN_PARTIALLY_UPDATE If set to 1 this causes events on this calendar to be duplicated with LAST_SYNCED set to 1 whenever the event transitions from non-dirty to dirty. String DELETED Whether the row has been deleted but not synced to the server. String DIRTY Used to indicate that local, unsynced, changes are present. String MUTATORS Used in conjunction with DIRTY to indicate what packages wrote local changes. String _SYNC_ID The unique ID for a row assigned by the sync source.","String ACCOUNT_NAME The account that was used to sync the entry to the device.","String ACCOUNT_TYPE The type of the account that was used to sync the entry to the device.","String CAN_PARTIALLY_UPDATE If set to 1 this causes events on this calendar to be duplicated with LAST_SYNCED set to 1 whenever the event transitions from non-dirty to dirty.","String DELETED Whether the row has been deleted but not synced to the server.","String DIRTY Used to indicate that local, unsynced, changes are present.","String MUTATORS Used in conjunction with DIRTY to indicate what packages wrote local changes.","String _SYNC_ID The unique ID for a row assigned by the sync source."],"class":"CalendarContract.CalendarEntity","constructors":[],"fields":["public static final Uri CONTENT_URI The default Uri used when creating a new calendar EntityIterator."]}