{"methods":[],"package":"android.provider","constants":["String ALLOWED_ATTENDEE_TYPES A comma separated list of attendee types supported for this calendar in the format \"#,#,#\".","String ALLOWED_AVAILABILITY A comma separated list of availability types supported for this calendar in the format \"#,#,#\".","String ALLOWED_REMINDERS A comma separated list of reminder methods supported for this calendar in the format \"#,#,#\".","String CALENDAR_ACCESS_LEVEL The level of access that the user has for the calendar Type: INTEGER (one of the values below)","String CALENDAR_COLOR The color of the calendar.","String CALENDAR_COLOR_KEY A key for looking up a color from the CalendarContract.Colors table.","String CALENDAR_DISPLAY_NAME The display name of the calendar.","String CALENDAR_TIME_ZONE The time zone the calendar is associated with.","int CAL_ACCESS_CONTRIBUTOR Full access to modify the calendar, but not the access control settings","int CAL_ACCESS_EDITOR Full access to modify the calendar, but not the access control settings","int CAL_ACCESS_FREEBUSY Can only see free/busy information about the calendar","int CAL_ACCESS_NONE Cannot access the calendar","int CAL_ACCESS_OVERRIDE not used","int CAL_ACCESS_OWNER Full access to the calendar","int CAL_ACCESS_READ Can read all event details","int CAL_ACCESS_RESPOND Can reply yes/no/maybe to an event","int CAL_ACCESS_ROOT Domain admin","String CAN_MODIFY_TIME_ZONE Can the organizer modify the time zone of the event? Column name.","String CAN_ORGANIZER_RESPOND Can the organizer respond to the event? If no, the status of the organizer should not be shown by the UI.","String IS_PRIMARY Is this the primary calendar for this account.","String MAX_REMINDERS The maximum number of reminders allowed for an event.","String OWNER_ACCOUNT The owner account for this calendar, based on the calendar feed.","String SYNC_EVENTS Is this calendar synced and are its events stored on the device? 0 - Do not sync this calendar or store events for this calendar.","String VISIBLE Is the calendar selected to be displayed? 0 - do not show events associated with this calendar."],"class":"CalendarContract.CalendarColumns","constructors":[],"fields":[]}