{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ACCOUNT_TYPE_LOCAL A special account type for calendars not associated with any account.","String ACTION_EVENT_REMINDER Broadcast Action: This is the intent that gets fired when an alarm notification needs to be posted for a reminder.","String ACTION_HANDLE_CUSTOM_EVENT Activity Action: Display the event to the user in the custom app as specified in CUSTOM_APP_PACKAGE.","String AUTHORITY This authority is used for writing to or querying from the calendar provider.","String CALLER_IS_SYNCADAPTER An optional insert, update or delete URI parameter that allows the caller to specify that it is a sync adapter.","String EXTRA_CUSTOM_APP_URI Intent Extras key: CUSTOM_APP_URI for the event in the ACTION_HANDLE_CUSTOM_EVENT intent","String EXTRA_EVENT_ALL_DAY Intent Extras key: When creating an event, set this to true to create an all-day event by default","String EXTRA_EVENT_BEGIN_TIME Intent Extras key: The start time of an event or an instance of a recurring event.","String EXTRA_EVENT_END_TIME Intent Extras key: The end time of an event or an instance of a recurring event."],"class":"CalendarContract","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for the top-level calendar authority"]}