{"methods":["static String getLastOutgoingCall(Context context) Query the call log database for the last dialed number.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CACHED_FORMATTED_NUMBER The cached phone number, formatted with formatting rules based on the country the user was in when the call was made or received.","String CACHED_LOOKUP_URI The cached URI to look up the contact associated with the phone number, if it exists.","String CACHED_MATCHED_NUMBER The cached phone number of the contact which matches this entry, if it exists.","String CACHED_NAME The cached name associated with the phone number, if it exists.","String CACHED_NORMALIZED_NUMBER The cached normalized(E164) version of the phone number, if it exists.","String CACHED_NUMBER_LABEL The cached number label, for a custom number type, associated with the phone number, if it exists.","String CACHED_NUMBER_TYPE The cached number type (Home, Work, etc) associated with the phone number, if it exists.","String CACHED_PHOTO_ID The cached photo id of the picture associated with the phone number, if it exists.","String CONTENT_ITEM_TYPE The MIME type of a CONTENT_URI sub-directory of a single call.","String CONTENT_TYPE The MIME type of CONTENT_URI and CONTENT_FILTER_URI providing a directory of calls.","String COUNTRY_ISO The ISO 3166-1 two letters country code of the country where the user received or made the call.","String DATA_USAGE The data usage of the call in bytes.","String DATE The date the call occured, in milliseconds since the epoch Type: INTEGER (long)","String DEFAULT_SORT_ORDER The default sort order for this table","String DURATION The duration of the call in seconds Type: INTEGER (long)","String EXTRA_CALL_TYPE_FILTER An optional extra used with Calls.CONTENT_TYPE and ACTION_VIEW to specify that the presented list of calls should be filtered for a particular call type.","String FEATURES Bit-mask describing features of the call (e.g.","int FEATURES_VIDEO Call had video.","String GEOCODED_LOCATION A geocoded location for the number associated with this call.","int INCOMING_TYPE Call log type for incoming calls.","String IS_READ Whether this item has been read or otherwise consumed by the user.","String LIMIT_PARAM_KEY Query parameter used to limit the number of call logs returned.","int MISSED_TYPE Call log type for missed calls.","String NEW Whether or not the call has been acknowledged Type: INTEGER (boolean)","String NUMBER The phone number as the user entered it.","String NUMBER_PRESENTATION The number presenting rules set by the network.","String OFFSET_PARAM_KEY Query parameter used to specify the starting record to return.","int OUTGOING_TYPE Call log type for outgoing calls.","String PHONE_ACCOUNT_COMPONENT_NAME The component name of the account in string form.","String PHONE_ACCOUNT_ID The identifier of a account that is unique to a specified component.","int PRESENTATION_ALLOWED Number is allowed to display for caller id.","int PRESENTATION_PAYPHONE Number is a pay phone.","int PRESENTATION_RESTRICTED Number is blocked by user.","int PRESENTATION_UNKNOWN Number is not specified or unknown by network.","String TRANSCRIPTION Transcription of the call or voicemail entry.","String TYPE The type of the call (incoming, outgoing or missed).","int VOICEMAIL_TYPE Call log type for voicemails.","String VOICEMAIL_URI URI of the voicemail entry.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"CallLog.Calls","constructors":[],"fields":["public static final Uri CONTENT_FILTER_URI The content:// style URL for filtering this table on phone numbers","public static final Uri CONTENT_URI The content:// style URL for this table","public static final Uri CONTENT_URI_WITH_VOICEMAIL Content uri used to access call log entries, including voicemail records."]}