{"methods":["final void addCallbackBuffer(byte[] callbackBuffer) Adds a pre-allocated buffer to the preview callback buffer queue.","final void autoFocus(Camera.AutoFocusCallback cb) Starts camera auto-focus and registers a callback function to run when the camera is focused.","final void cancelAutoFocus() Cancels any auto-focus function in progress.","final boolean enableShutterSound(boolean enabled) Enable or disable the default shutter sound when taking a picture.","static void getCameraInfo(int cameraId, Camera.CameraInfo cameraInfo) Returns the information about a particular camera.","static int getNumberOfCameras() Returns the number of physical cameras available on this device.","Camera.Parameters getParameters() Returns the current settings for this Camera service.","final void lock() Re-locks the camera to prevent other processes from accessing it.","static Camera open(int cameraId) Creates a new Camera object to access a particular hardware camera.","static Camera open() Creates a new Camera object to access the first back-facing camera on the device.","final void reconnect() Reconnects to the camera service after another process used it.","final void release() Disconnects and releases the Camera object resources.","void setAutoFocusMoveCallback(Camera.AutoFocusMoveCallback cb) Sets camera auto-focus move callback.","final void setDisplayOrientation(int degrees) Set the clockwise rotation of preview display in degrees.","final void setErrorCallback(Camera.ErrorCallback cb) Registers a callback to be invoked when an error occurs.","final void setFaceDetectionListener(Camera.FaceDetectionListener listener) Registers a listener to be notified about the faces detected in the preview frame.","final void setOneShotPreviewCallback(Camera.PreviewCallback cb) Installs a callback to be invoked for the next preview frame in addition to displaying it on the screen.","void setParameters(Camera.Parameters params) Changes the settings for this Camera service.","final void setPreviewCallback(Camera.PreviewCallback cb) Installs a callback to be invoked for every preview frame in addition to displaying them on the screen.","final void setPreviewCallbackWithBuffer(Camera.PreviewCallback cb) Installs a callback to be invoked for every preview frame, using buffers supplied with addCallbackBuffer(byte[]), in addition to displaying them on the screen.","final void setPreviewDisplay(SurfaceHolder holder) Sets the Surface to be used for live preview.","final void setPreviewTexture(SurfaceTexture surfaceTexture) Sets the SurfaceTexture to be used for live preview.","final void setZoomChangeListener(Camera.OnZoomChangeListener listener) Registers a listener to be notified when the zoom value is updated by the camera driver during smooth zoom.","final void startFaceDetection() Starts the face detection.","final void startPreview() Starts capturing and drawing preview frames to the screen.","final void startSmoothZoom(int value) Zooms to the requested value smoothly.","final void stopFaceDetection() Stops the face detection.","final void stopPreview() Stops capturing and drawing preview frames to the surface, and resets the camera for a future call to startPreview().","final void stopSmoothZoom() Stops the smooth zoom.","final void takePicture(Camera.ShutterCallback shutter, Camera.PictureCallback raw, Camera.PictureCallback jpeg) Equivalent to takePicture(shutter, raw, null, jpeg).","final void takePicture(Camera.ShutterCallback shutter, Camera.PictureCallback raw, Camera.PictureCallback postview, Camera.PictureCallback jpeg) Triggers an asynchronous image capture.","final void unlock() Unlocks the camera to allow another process to access it.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware","constants":["String ACTION_NEW_PICTURE Broadcast Action: A new picture is taken by the camera, and the entry of the picture has been added to the media store.","String ACTION_NEW_VIDEO Broadcast Action: A new video is recorded by the camera, and the entry of the video has been added to the media store.","int CAMERA_ERROR_SERVER_DIED Media server died.","int CAMERA_ERROR_UNKNOWN Unspecified camera error."],"class":"Camera","constructors":[],"fields":[]}