{"methods":["static CameraUpdate newCameraPosition(CameraPosition cameraPosition) Returns a CameraUpdate that moves the camera to a specified CameraPosition.","static CameraUpdate newLatLng(LatLng latLng) Returns a CameraUpdate that moves the center of the screen to a latitude and longitude specified by a LatLng object.","static CameraUpdate newLatLngBounds(LatLngBounds bounds, int padding) Returns a CameraUpdate that transforms the camera such that the specified latitude/longitude bounds are centered on screen at the greatest possible zoom level.","static CameraUpdate newLatLngBounds(LatLngBounds bounds, int width, int height, int padding) Returns a CameraUpdate that transforms the camera such that the specified latitude/longitude bounds are centered on screen within a bounding box of specified dimensions at the greatest possible zoom level.","static CameraUpdate newLatLngZoom(LatLng latLng, float zoom) Returns a CameraUpdate that moves the center of the screen to a latitude and longitude specified by a LatLng object, and moves to the given zoom level.","static CameraUpdate scrollBy(float xPixel, float yPixel) Returns a CameraUpdate that scrolls the camera over the map, shifting the center of view by the specified number of pixels in the x and y directions.","static CameraUpdate zoomBy(float amount, Point focus) Returns a CameraUpdate that shifts the zoom level of the current camera viewpoint.","static CameraUpdate zoomBy(float amount) Returns a CameraUpdate that shifts the zoom level of the current camera viewpoint.","static CameraUpdate zoomIn() Returns a CameraUpdate that zooms in on the map by moving the viewpoint's height closer to the Earth's surface.","static CameraUpdate zoomOut() Returns a CameraUpdate that zooms out on the map by moving the viewpoint's height farther away from the Earth's surface.","static CameraUpdate zoomTo(float zoom) Returns a CameraUpdate that moves the camera viewpoint to a particular zoom level.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.maps","constants":[],"class":"CameraUpdateFactory","constructors":[],"fields":[]}