{"methods":["void onCaptureCompleted(CameraCaptureSession session, CaptureRequest request, TotalCaptureResult result) This method is called when an image capture has fully completed and all the result metadata is available.","void onCaptureFailed(CameraCaptureSession session, CaptureRequest request, CaptureFailure failure) This method is called instead of onCaptureCompleted(CameraCaptureSession, CaptureRequest, TotalCaptureResult) when the camera device failed to produce a CaptureResult for the request.","void onCaptureProgressed(CameraCaptureSession session, CaptureRequest request, CaptureResult partialResult) This method is called when an image capture makes partial forward progress; some (but not all) results from an image capture are available.","void onCaptureSequenceAborted(CameraCaptureSession session, int sequenceId) This method is called independently of the others in CaptureCallback, when a capture sequence aborts before any CaptureResult or CaptureFailure for it have been returned via this listener.","void onCaptureSequenceCompleted(CameraCaptureSession session, int sequenceId, long frameNumber) This method is called independently of the others in CaptureCallback, when a capture sequence finishes and all CaptureResult or CaptureFailure for it have been returned via this listener.","void onCaptureStarted(CameraCaptureSession session, CaptureRequest request, long timestamp, long frameNumber) This method is called when the camera device has started capturing the output image for the request, at the beginning of image exposure.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware.camera2","constants":[],"class":"CameraCaptureSession.CaptureCallback","constructors":[],"fields":[]}