{"methods":["void onClosed(CameraDevice camera) The method called when a camera device has been closed with close().","abstract void onDisconnected(CameraDevice camera) The method called when a camera device is no longer available for use.","abstract void onError(CameraDevice camera, int error) The method called when a camera device has encountered a serious error.","abstract void onOpened(CameraDevice camera) The method called when a camera device has finished opening.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware.camera2","constants":["int ERROR_CAMERA_DEVICE An error code that can be reported by onError(CameraDevice, int) indicating that the camera device has encountered a fatal error.","int ERROR_CAMERA_DISABLED An error code that can be reported by onError(CameraDevice, int) indicating that the camera device could not be opened due to a device policy.","int ERROR_CAMERA_IN_USE An error code that can be reported by onError(CameraDevice, int) indicating that the camera device is in use already.","int ERROR_CAMERA_SERVICE An error code that can be reported by onError(CameraDevice, int) indicating that the camera service has encountered a fatal error.","int ERROR_MAX_CAMERAS_IN_USE An error code that can be reported by onError(CameraDevice, int) indicating that the camera device could not be opened because there are too many other open camera devices."],"class":"CameraDevice.StateCallback","constructors":[],"fields":[]}