{"methods":["Typeface getTypeface()","boolean hasBackgroundColor()","boolean hasEdgeColor()","boolean hasEdgeType()","boolean hasForegroundColor()","boolean hasWindowColor()","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view.accessibility","constants":["int EDGE_TYPE_DEPRESSED Edge type value specifying depressed bevel character edges.","int EDGE_TYPE_DROP_SHADOW Edge type value specifying drop-shadowed character edges.","int EDGE_TYPE_NONE Edge type value specifying no character edges.","int EDGE_TYPE_OUTLINE Edge type value specifying uniformly outlined character edges.","int EDGE_TYPE_RAISED Edge type value specifying raised bevel character edges.","int EDGE_TYPE_UNSPECIFIED Unspecified edge type value."],"class":"CaptioningManager.CaptionStyle","constructors":[],"fields":["public final int backgroundColor The preferred background color for video captions.","public final int edgeColor The preferred edge color for video captions, if using an edge type other than EDGE_TYPE_NONE.","public final int edgeType The preferred edge type for video captions, one of: EDGE_TYPE_UNSPECIFIED EDGE_TYPE_NONE EDGE_TYPE_OUTLINE EDGE_TYPE_DROP_SHADOW EDGE_TYPE_RAISED EDGE_TYPE_DEPRESSED","public final int foregroundColor The preferred foreground color for video captions.","public final int windowColor The preferred window color for video captions."]}