{"methods":["boolean categoryAllowsForegroundPreference(String category) Returns whether the user has allowed AIDs registered in the specified category to be handled by a service that is preferred by the foreground application, instead of by a pre-configured default.","List<String> getAidsForService(ComponentName service, String category) Retrieves the currently registered AIDs for the specified category for a service.","synchronized static CardEmulation getInstance(NfcAdapter adapter) Helper to get an instance of this class.","int getSelectionModeForCategory(String category) Returns the service selection mode for the passed in category.","boolean isDefaultServiceForAid(ComponentName service, String aid) Allows an application to query whether a service is currently the default handler for a specified ISO7816-4 Application ID.","boolean isDefaultServiceForCategory(ComponentName service, String category) Allows an application to query whether a service is currently the default service to handle a card emulation category.","boolean registerAidsForService(ComponentName service, String category, List<String> aids) Registers a list of AIDs for a specific category for the specified service.","boolean removeAidsForService(ComponentName service, String category) Removes a previously registered list of AIDs for the specified category for the service provided.","boolean setPreferredService(Activity activity, ComponentName service) Allows a foreground application to specify which card emulation service should be preferred while a specific Activity is in the foreground.","boolean supportsAidPrefixRegistration() Some devices may allow an application to register all AIDs that starts with a certain prefix, e.g.","boolean unsetPreferredService(Activity activity) Unsets the preferred service for the specified Activity.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.nfc.cardemulation","constants":["String ACTION_CHANGE_DEFAULT Activity action: ask the user to change the default card emulation service for a certain category.","String CATEGORY_OTHER Category that can be used for all other card emulation services.","String CATEGORY_PAYMENT Category used for NFC payment services.","String EXTRA_CATEGORY The category extra for ACTION_CHANGE_DEFAULT.","String EXTRA_SERVICE_COMPONENT The service ComponentName object passed in as an extra for ACTION_CHANGE_DEFAULT.","int SELECTION_MODE_ALWAYS_ASK Return value for getSelectionModeForCategory(String).","int SELECTION_MODE_ASK_IF_CONFLICT Return value for getSelectionModeForCategory(String).","int SELECTION_MODE_PREFER_DEFAULT Return value for getSelectionModeForCategory(String)."],"class":"CardEmulation","constructors":[],"fields":[]}