{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.cast","constants":["int APPLICATION_NOT_FOUND Status code indicating that a requested application could not be found.","int APPLICATION_NOT_RUNNING Status code indicating that a requested application is not currently running.","int AUTHENTICATION_FAILED Status code indicating an authentication failure.","int CANCELED Status code indicating that an in-progress request has been canceled, most likely because another action has preempted it.","int INTERNAL_ERROR Status code indicating that an internal error has occurred.","int INTERRUPTED Status code indicating a blocking call was interrupted while waiting and did not run to completion.","int INVALID_REQUEST Status code indicating that an invalid request was made.","int MESSAGE_SEND_BUFFER_TOO_FULL Status code indicating that a message could not be sent because there is not enough room in the send buffer at this time.","int MESSAGE_TOO_LARGE Status code indicating that a message could not be sent because it is too large.","int NETWORK_ERROR Status code indicating a network I/O error.","int NOT_ALLOWED Status code indicating that the request was disallowed and could not be completed.","int SUCCESS Status code indicating no error (success).","int TIMEOUT Status code indicating that an operation has timed out.","int UNKNOWN_ERROR Status code indicating that an unknown, unexpected error has occurred."],"class":"CastStatusCodes","constructors":[],"fields":[]}