{"methods":["abstract ApplicationMetadata getApplicationMetadata(GoogleApiClient client) Returns the metadata for the currently running receiver application, if any.","abstract String getApplicationStatus(GoogleApiClient client) Returns the current receiver application status, if any.","abstract double getVolume(GoogleApiClient client) Returns the device's volume, in the range [0.0, 1.0].","abstract boolean isMute(GoogleApiClient client) Returns the device's mute state.","abstract PendingResult<Cast.ApplicationConnectionResult> joinApplication(GoogleApiClient client) Joins (connects to) the currently running application on the receiver.","abstract PendingResult<Cast.ApplicationConnectionResult> joinApplication(GoogleApiClient client, String applicationId, String sessionId) Joins (connects to) an application on the receiver.","abstract PendingResult<Cast.ApplicationConnectionResult> joinApplication(GoogleApiClient client, String applicationId) Joins (connects to) the currently running application on the receiver.","abstract PendingResult<Cast.ApplicationConnectionResult> launchApplication(GoogleApiClient client, String applicationId, LaunchOptions launchOptions) Launches an application on the receiver.","abstract PendingResult<Cast.ApplicationConnectionResult> launchApplication(GoogleApiClient client, String applicationId) Launches an application on the receiver.","abstract PendingResult<Cast.ApplicationConnectionResult> launchApplication(GoogleApiClient client, String applicationId, boolean relaunchIfRunning) This method is deprecated. Use launchApplication(GoogleApiClient, String, LaunchOptions).","abstract PendingResult<Status> leaveApplication(GoogleApiClient client) Leaves (disconnects from) the receiver application.","abstract void removeMessageReceivedCallbacks(GoogleApiClient client, String namespace) Removes a Cast.MessageReceivedCallback from this controller for a given namespace.","abstract void requestStatus(GoogleApiClient client) Requests the receiver's current status.","abstract PendingResult<Status> sendMessage(GoogleApiClient client, String namespace, String message) Sends a message to the currently connected application.","abstract void setMessageReceivedCallbacks(GoogleApiClient client, String namespace, Cast.MessageReceivedCallback callbacks) Sets a new Cast.MessageReceivedCallback listener on this controller for a given namespace.","abstract void setMute(GoogleApiClient client, boolean mute) Mutes or unmutes the device's audio.","abstract void setVolume(GoogleApiClient client, double volume) Sets the device volume.","abstract PendingResult<Status> stopApplication(GoogleApiClient client) Stops any running receiver application(s).","abstract PendingResult<Status> stopApplication(GoogleApiClient client, String sessionId) Stops the currently running receiver application, optionally doing so only if its session ID matches the supplied one."],"package":"com.google.android.gms.cast","constants":[],"class":"Cast.CastApi","constructors":[],"fields":[]}