{"methods":["static String categoryForCast(String applicationId) Returns a custom control category for discovering Cast devices that support running the specified app, independent of whether the app is running or not.","static String categoryForCast(String applicationId, Collection<String> namespaces) Returns a custom control category for discovering Cast devices meeting both application ID and namespace restrictions.","static String categoryForCast(Collection<String> namespaces) Returns a custom control category for discovering Cast devices currently running an application which supports the specified namespaces.","static String categoryForRemotePlayback(String applicationId) Returns a custom control category for discovering Cast devices which support the default Android remote playback actions using the specified Cast player.","static String categoryForRemotePlayback() Returns a custom control category for discovering Cast devices which support the Default Media Receiver.","static String languageTagForLocale(Locale locale) Returns an RFC-5646 language tag string fo the given locale.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.cast","constants":["String ACTION_SYNC_STATUS A Cast extension action for requesting the current media status when the current item ID is not known to the client application.","String CATEGORY_CAST This constant is deprecated. use categoryForCast(String) instead.","String DEFAULT_MEDIA_RECEIVER_APPLICATION_ID The application ID for the Cast Default Media Receiver.","int ERROR_CODE_REQUEST_FAILED An error code indicating that a Cast request has failed.","int ERROR_CODE_SESSION_START_FAILED An error code indicating that the request could not be processed because the session could not be started.","int ERROR_CODE_TEMPORARILY_DISCONNECTED An error code indicating that the connection to the Cast device has been lost, but the system is actively trying to re-establish the connection.","String EXTRA_CAST_APPLICATION_ID The extra that contains the ID of the application to launch for an ACTION_START_SESSION request.","String EXTRA_CAST_LANGUAGE_CODE The extra that indicates the language to be used by the receiver application.","String EXTRA_CAST_RELAUNCH_APPLICATION The extra that indicates whether the application should be relaunched if it is already running (the default behavior) or whether an attempt should be made to join the application first.","String EXTRA_CAST_STOP_APPLICATION_WHEN_SESSION_ENDS The extra that indicates that the receiver application should be stopped when the session ends.","String EXTRA_CUSTOM_DATA The extra that contains a compact JSON string of custom data to pass with a media request.","String EXTRA_DEBUG_LOGGING_ENABLED The extra that indicates whether debug logging should be enabled for the Cast session.","String EXTRA_ERROR_CODE An error bundle extra for the error code."],"class":"CastMediaControlIntent","constructors":[],"fields":[]}