{"methods":["static double convertQuartSecToDecDegrees(int quartSec) Converts latitude or longitude from 0.25 seconds (as defined in the 3GPP2 C.S0005-A v6.0 standard) to decimal degrees","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void fillInNotifierBundle(Bundle bundleToFill) Fill the cell location data into the intent notifier Bundle based on service state","int getBaseStationId()","int getBaseStationLatitude() Latitude is a decimal number as specified in 3GPP2 C.S0005-A v6.0.","int getBaseStationLongitude() Longitude is a decimal number as specified in 3GPP2 C.S0005-A v6.0.","int getNetworkId()","int getSystemId()","int hashCode() Returns an integer hash code for this object.","void setCellLocationData(int baseStationId, int baseStationLatitude, int baseStationLongitude, int systemId, int networkId) Set the cell location data.","void setCellLocationData(int baseStationId, int baseStationLatitude, int baseStationLongitude) Set the cell location data.","void setStateInvalid() Invalidate this object.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class android.telephony.CellLocation static CellLocation getEmpty() Return a new CellLocation object representing an unknown location, or null for unknown/none phone radio types. static void requestLocationUpdate() Request an update of the current location.","static CellLocation getEmpty() Return a new CellLocation object representing an unknown location, or null for unknown/none phone radio types.","static void requestLocationUpdate() Request an update of the current location.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.telephony.cdma","constants":[],"class":"CdmaCellLocation","constructors":[],"fields":[]}