{"methods":["final CRL generateCRL(InputStream inStream) Generates and initializes a Certificate Revocation List (CRL) from the provided input stream.","final Collection<? extends CRL> generateCRLs(InputStream inStream) Generates and initializes a collection of Certificate Revocation List (CRL) from the provided input stream.","final CertPath generateCertPath(InputStream inputStream, String encoding) Generates a CertPath (a certificate chain) from the given inputStream, assuming the given encoding from getCertPathEncodings().","final CertPath generateCertPath(InputStream inStream) Generates a CertPath (a certificate chain) from the provided InputStream.","final CertPath generateCertPath(List<? extends Certificate> certificates) Generates a CertPath from the provided list of certificates.","final Certificate generateCertificate(InputStream inStream) Generates and initializes a Certificate from the provided input stream.","final Collection<? extends Certificate> generateCertificates(InputStream inStream) Generates and initializes a collection of (unrelated) certificates from the provided input stream.","final Iterator<String> getCertPathEncodings() Returns an Iterator over the supported CertPath encodings (as Strings).","final static CertificateFactory getInstance(String type, String provider) Creates a new CertificateFactory instance from the specified provider that provides the requested certificate type.","final static CertificateFactory getInstance(String type, Provider provider) Creates a new CertificateFactory instance from the specified provider that provides the requested certificate type.","final static CertificateFactory getInstance(String type) Creates a new CertificateFactory instance that provides the requested certificate type.","final Provider getProvider() Returns the Provider of the certificate factory represented by the certificate.","final String getType() Returns the Certificate type.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security.cert","constants":[],"class":"CertificateFactory","constructors":[],"fields":[]}