{"methods":["static WritableByteChannel newChannel(OutputStream outputStream) Returns a writable channel on the given output stream.","static ReadableByteChannel newChannel(InputStream inputStream) Returns a readable channel on the given input stream.","static InputStream newInputStream(ReadableByteChannel channel) Returns an input stream on the given channel.","static OutputStream newOutputStream(WritableByteChannel channel) Returns an output stream on the given channel.","static Reader newReader(ReadableByteChannel channel, CharsetDecoder decoder, int minBufferCapacity) Returns a reader that decodes bytes from a channel.","static Reader newReader(ReadableByteChannel channel, String charsetName) Returns a reader that decodes bytes from a channel.","static Writer newWriter(WritableByteChannel channel, String charsetName) Returns a writer that encodes characters with the specified encoder and sends the bytes to the specified channel.","static Writer newWriter(WritableByteChannel channel, CharsetEncoder encoder, int minBufferCapacity) Returns a writer that encodes characters with the specified encoder and sends the bytes to the specified channel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.nio.channels","constants":[],"class":"Channels","constructors":[],"fields":[]}