{"methods":["final float averageBytesPerChar() Returns the average number of bytes created by this encoder for a single input character.","boolean canEncode(CharSequence sequence) Tests whether the given CharSequence can be encoded by this encoder.","boolean canEncode(char c) Tests whether the given character can be encoded by this encoder.","final Charset charset() Returns the Charset which this encoder uses.","final ByteBuffer encode(CharBuffer in) This is a facade method for the encoding operation.","final CoderResult encode(CharBuffer in, ByteBuffer out, boolean endOfInput) Encodes characters starting at the current position of the given input buffer, and writes the equivalent byte sequence into the given output buffer from its current position.","final CoderResult flush(ByteBuffer out) Flushes this encoder.","boolean isLegalReplacement(byte[] replacement) Tests whether the given argument is legal as this encoder's replacement byte array.","CodingErrorAction malformedInputAction() Returns this encoder's CodingErrorAction when a malformed input error occurred during the encoding process.","final float maxBytesPerChar() Returns the maximum number of bytes which can be created by this encoder for one input character, must be positive.","final CharsetEncoder onMalformedInput(CodingErrorAction newAction) Sets this encoder's action on malformed input error.","final CharsetEncoder onUnmappableCharacter(CodingErrorAction newAction) Sets this encoder's action on unmappable character error.","final CharsetEncoder replaceWith(byte[] replacement) Sets the new replacement value.","final byte[] replacement() Returns the replacement byte array, which is never null or empty.","final CharsetEncoder reset() Resets this encoder.","CodingErrorAction unmappableCharacterAction() Returns this encoder's CodingErrorAction when unmappable character occurred during encoding process.","abstract CoderResult encodeLoop(CharBuffer in, ByteBuffer out) Encodes characters into bytes.","CoderResult implFlush(ByteBuffer out) Flushes this encoder.","void implOnMalformedInput(CodingErrorAction newAction) Notifies that this encoder's CodingErrorAction specified for malformed input error has been changed.","void implOnUnmappableCharacter(CodingErrorAction newAction) Notifies that this encoder's CodingErrorAction specified for unmappable character error has been changed.","void implReplaceWith(byte[] newReplacement) Notifies that this encoder's replacement has been changed.","void implReset() Resets this encoder's charset related state.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.nio.charset","constants":[],"class":"CharsetEncoder","constructors":[],"fields":[]}