{"methods":["final Set<String> aliases() Returns an unmodifiable set of this charset's aliases.","static SortedMap<String, Charset> availableCharsets() Returns an immutable case-insensitive map from canonical names to Charset instances.","boolean canEncode() Returns true if this charset supports encoding, false otherwise.","final int compareTo(Charset charset) Compares this charset with the given charset.","abstract boolean contains(Charset charset) Determines whether this charset is a superset of the given charset.","final CharBuffer decode(ByteBuffer buffer) Returns a new CharBuffer containing the characters decoded from buffer.","static Charset defaultCharset() Returns the system's default charset.","String displayName() Returns the name of this charset for the default locale.","String displayName(Locale l) Returns the name of this charset for the specified locale.","final ByteBuffer encode(CharBuffer buffer) Returns a new ByteBuffer containing the bytes encoding the characters from buffer.","final ByteBuffer encode(String s) Returns a new ByteBuffer containing the bytes encoding the characters from s.","final boolean equals(Object obj) Determines whether this charset equals to the given object.","static Charset forName(String charsetName) Returns a Charset instance for the named charset.","final int hashCode() Gets the hash code of this charset.","final boolean isRegistered() Returns true if this charset is known to be registered in the IANA Charset Registry.","static boolean isSupported(String charsetName) Determines whether the specified charset is supported by this runtime.","final String name() Returns the canonical name of this charset.","abstract CharsetDecoder newDecoder() Returns a new instance of a decoder for this charset.","abstract CharsetEncoder newEncoder() Returns a new instance of an encoder for this charset.","final String toString() Gets a string representation of this charset.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.nio.charset","constants":[],"class":"Charset","constructors":[],"fields":[]}