{"methods":["final float averageCharsPerByte() Returns the average number of characters created by this decoder for a single input byte.","final Charset charset() Returns the Charset which this decoder uses.","final CoderResult decode(ByteBuffer in, CharBuffer out, boolean endOfInput) Decodes bytes starting at the current position of the given input buffer, and writes the equivalent character sequence into the given output buffer from its current position.","final CharBuffer decode(ByteBuffer in) This is a facade method for the decoding operation.","Charset detectedCharset() Gets the charset detected by this decoder; this method is optional.","final CoderResult flush(CharBuffer out) Flushes this decoder.","boolean isAutoDetecting() Indicates whether this decoder implements an auto-detecting charset.","boolean isCharsetDetected() Indicates whether this decoder has detected a charset; this method is optional.","CodingErrorAction malformedInputAction() Returns this decoder's CodingErrorAction when malformed input occurred during the decoding process.","final float maxCharsPerByte() Returns the maximum number of characters which can be created by this decoder for one input byte, must be positive.","final CharsetDecoder onMalformedInput(CodingErrorAction newAction) Sets this decoder's action on malformed input errors.","final CharsetDecoder onUnmappableCharacter(CodingErrorAction newAction) Sets this decoder's action on unmappable character errors.","final CharsetDecoder replaceWith(String replacement) Sets the new replacement string.","final String replacement() Returns the replacement string, which is never null or empty.","final CharsetDecoder reset() Resets this decoder.","CodingErrorAction unmappableCharacterAction() Returns this decoder's CodingErrorAction when an unmappable character error occurred during the decoding process.","abstract CoderResult decodeLoop(ByteBuffer in, CharBuffer out) Decodes bytes into characters.","CoderResult implFlush(CharBuffer out) Flushes this decoder.","void implOnMalformedInput(CodingErrorAction newAction) Notifies that this decoder's CodingErrorAction specified for malformed input error has been changed.","void implOnUnmappableCharacter(CodingErrorAction newAction) Notifies that this decoder's CodingErrorAction specified for unmappable character error has been changed.","void implReplaceWith(String newReplacement) Notifies that this decoder's replacement has been changed.","void implReset() Reset this decoder's charset related state.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.nio.charset","constants":[],"class":"CharsetDecoder","constructors":[],"fields":[]}