{"methods":["boolean isError() Returns true if this result represents a malformed-input error or an unmappable-character error.","boolean isMalformed() Returns true if this result represents a malformed-input error.","boolean isOverflow() Returns true if this result is an overflow condition.","boolean isUnderflow() Returns true if this result is an underflow condition.","boolean isUnmappable() Returns true if this result represents an unmappable-character error.","int length() Returns the length of the erroneous input.","synchronized static CoderResult malformedForLength(int length) Gets a CoderResult object indicating a malformed-input error.","void throwException() Throws an exception corresponding to this coder result.","String toString() Returns a text description of this result.","synchronized static CoderResult unmappableForLength(int length) Gets a CoderResult object indicating an unmappable character error.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.nio.charset","constants":[],"class":"CoderResult","constructors":[],"fields":["public static final CoderResult OVERFLOW Result object used to indicate that the output buffer does not have enough space available to store the result of the encoding/decoding.","public static final CoderResult UNDERFLOW Result object indicating that there is insufficient data in the encoding/decoding buffer or that additional data is required."]}