{"methods":["final float[] getArray() Return the array of floats representing this colormatrix.","void postConcat(ColorMatrix postmatrix) Concat this colormatrix with the specified postmatrix.","void preConcat(ColorMatrix prematrix) Concat this colormatrix with the specified prematrix.","void reset() Set this colormatrix to identity: \n [ 1 0 0 0 0   - red vector\n   0 1 0 0 0   - green vector\n   0 0 1 0 0   - blue vector\n   0 0 0 1 0 ] - alpha vector","void set(float[] src) Assign the array of floats into this matrix, copying all of its values.","void set(ColorMatrix src) Assign the src colormatrix into this matrix, copying all of its values.","void setConcat(ColorMatrix matA, ColorMatrix matB) Set this colormatrix to the concatenation of the two specified colormatrices, such that the resulting colormatrix has the same effect as applying matB and then applying matA.","void setRGB2YUV() Set the matrix to convert RGB to YUV","void setRotate(int axis, float degrees) Set the rotation on a color axis by the specified values.","void setSaturation(float sat) Set the matrix to affect the saturation of colors.","void setScale(float rScale, float gScale, float bScale, float aScale) Set this colormatrix to scale by the specified values.","void setYUV2RGB() Set the matrix to convert from YUV to RGB","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics","constants":[],"class":"ColorMatrix","constructors":[],"fields":[]}