{"methods":["int getErrorCode() Indicates the type of error that interrupted connection.","PendingIntent getResolution() A pending intent to resolve the connection failure.","boolean hasResolution() Returns true if calling startResolutionForResult(Activity, int) will start any intents requiring user interaction.","boolean isSuccess() Returns true if the connection was successful.","void startResolutionForResult(Activity activity, int requestCode) Resolves an error by starting any intents requiring user interaction.","String toString()","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.common","constants":["int API_UNAVAILABLE One of the API components you attempted to connect to is not available.","int CANCELED The client canceled the connection by calling disconnect().","int DEVELOPER_ERROR The application is misconfigured.","int DRIVE_EXTERNAL_STORAGE_REQUIRED This constant is deprecated. External storage is no longer required.","int INTERNAL_ERROR An internal error occurred.","int INTERRUPTED An interrupt occurred while waiting for the connection complete.","int INVALID_ACCOUNT The client attempted to connect to the service with an invalid account name specified.","int LICENSE_CHECK_FAILED The application is not licensed to the user.","int NETWORK_ERROR A network error occurred.","int RESOLUTION_REQUIRED Completing the connection requires some form of resolution.","int SERVICE_DISABLED The installed version of Google Play services has been disabled on this device.","int SERVICE_INVALID The version of the Google Play services installed on this device is not authentic.","int SERVICE_MISSING Google Play services is missing on this device.","int SERVICE_VERSION_UPDATE_REQUIRED The installed version of Google Play services is out of date.","int SIGN_IN_REQUIRED The client attempted to connect to the service but the user is not signed in.","int SUCCESS The connection was successful.","int TIMEOUT The timeout was exceeded while waiting for the connection to complete."],"class":"ConnectionResult","constructors":[],"fields":[]}