{"methods":["static ConnPerRoute getMaxConnectionsPerRoute(HttpParams params) Returns lookup interface for maximum number of connections allowed per route.","static int getMaxTotalConnections(HttpParams params) Gets the maximum number of connections allowed.","static long getTimeout(HttpParams params) Returns the timeout in milliseconds used when retrieving a ManagedClientConnection from the ClientConnectionManager.","static void setMaxConnectionsPerRoute(HttpParams params, ConnPerRoute connPerRoute) Sets lookup interface for maximum number of connections allowed per route.","static void setMaxTotalConnections(HttpParams params, int maxTotalConnections) Sets the maximum number of connections allowed.","static void setTimeout(HttpParams params, long timeout) Sets the timeout in milliseconds used when retrieving a ManagedClientConnection from the ClientConnectionManager.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http.conn.params","constants":["int DEFAULT_MAX_TOTAL_CONNECTIONS The default maximum number of connections allowed overall","[Expand] Inherited Constants","From interface org.apache.http.conn.params.ConnManagerPNames String MAX_CONNECTIONS_PER_ROUTE Defines the maximum number of connections per route. String MAX_TOTAL_CONNECTIONS Defines the maximum number of connections in total. String TIMEOUT Defines the timeout in milliseconds used when retrieving an instance of ManagedClientConnection from the ClientConnectionManager.","String MAX_CONNECTIONS_PER_ROUTE Defines the maximum number of connections per route.","String MAX_TOTAL_CONNECTIONS Defines the maximum number of connections in total.","String TIMEOUT Defines the timeout in milliseconds used when retrieving an instance of ManagedClientConnection from the ClientConnectionManager."],"class":"ConnManagerParams","constructors":[],"fields":[]}