{"methods":["void deleteClosedConnections() Deletes all entries for closed connections.","void freeEntry(BasicPoolEntry entry, boolean reusable, long validDuration, TimeUnit timeUnit) Returns an entry into the pool.","int getConnectionsInPool(HttpRoute route)","PoolEntryRequest requestPoolEntry(HttpRoute route, Object state) Returns a new PoolEntryRequest, from which a BasicPoolEntry can be obtained, or the request can be aborted.","void shutdown() Shuts down this pool and all associated resources.","BasicPoolEntry createEntry(RouteSpecificPool rospl, ClientConnectionOperator op) Creates a new pool entry.","Queue<BasicPoolEntry> createFreeConnQueue() Creates the queue for freeConnections.","Map<HttpRoute, RouteSpecificPool> createRouteToPoolMap() Creates the map for routeToPool.","Queue<WaitingThread> createWaitingThreadQueue() Creates the queue for waitingThreads.","void deleteEntry(BasicPoolEntry entry) Deletes a given pool entry.","void deleteLeastUsedEntry() Delete an old, free pool entry to make room for a new one.","BasicPoolEntry getEntryBlocking(HttpRoute route, Object state, long timeout, TimeUnit tunit, WaitingThreadAborter aborter) Obtains a pool entry with a connection within the given timeout.","BasicPoolEntry getFreeEntry(RouteSpecificPool rospl, Object state) If available, get a free pool entry for a route.","RouteSpecificPool getRoutePool(HttpRoute route, boolean create) Get a route-specific pool of available connections.","void handleLostEntry(HttpRoute route) Handles cleaning up for a lost pool entry with the given route.","RouteSpecificPool newRouteSpecificPool(HttpRoute route) Creates a new route-specific pool.","WaitingThread newWaitingThread(Condition cond, RouteSpecificPool rospl) Creates a new waiting thread.","void notifyWaitingThread(RouteSpecificPool rospl) Notifies a waiting thread that a connection is available.","[Expand] Inherited Methods","From class org.apache.http.impl.conn.tsccm.AbstractConnPool void closeConnection(OperatedClientConnection conn) Closes a connection from this pool. void closeExpiredConnections() void closeIdleConnections(long idletime, TimeUnit tunit) Closes idle connections. abstract void deleteClosedConnections() Deletes all entries for closed connections. void enableConnectionGC() Enables connection garbage collection (GC). abstract void freeEntry(BasicPoolEntry entry, boolean reusable, long validDuration, TimeUnit timeUnit) Returns an entry into the pool. final BasicPoolEntry getEntry(HttpRoute route, Object state, long timeout, TimeUnit tunit) Obtains a pool entry with a connection within the given timeout. abstract void handleLostEntry(HttpRoute route) Handles cleaning up for a lost pool entry with the given route. void handleReference(Reference ref) abstract PoolEntryRequest requestPoolEntry(HttpRoute route, Object state) Returns a new PoolEntryRequest, from which a BasicPoolEntry can be obtained, or the request can be aborted. void shutdown() Shuts down this pool and all associated resources.","void closeConnection(OperatedClientConnection conn) Closes a connection from this pool.","void closeExpiredConnections()","void closeIdleConnections(long idletime, TimeUnit tunit) Closes idle connections.","abstract void deleteClosedConnections() Deletes all entries for closed connections.","void enableConnectionGC() Enables connection garbage collection (GC).","abstract void freeEntry(BasicPoolEntry entry, boolean reusable, long validDuration, TimeUnit timeUnit) Returns an entry into the pool.","final BasicPoolEntry getEntry(HttpRoute route, Object state, long timeout, TimeUnit tunit) Obtains a pool entry with a connection within the given timeout.","abstract void handleLostEntry(HttpRoute route) Handles cleaning up for a lost pool entry with the given route.","void handleReference(Reference ref)","abstract PoolEntryRequest requestPoolEntry(HttpRoute route, Object state) Returns a new PoolEntryRequest, from which a BasicPoolEntry can be obtained, or the request can be aborted.","void shutdown() Shuts down this pool and all associated resources.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.impl.conn.tsccm.RefQueueHandler abstract void handleReference(Reference<?> ref) Invoked when a reference is found on the queue.","abstract void handleReference(Reference<?> ref) Invoked when a reference is found on the queue."],"package":"org.apache.http.impl.conn.tsccm","constants":[],"class":"ConnPoolByRoute","constructors":[],"fields":["protected Queue<BasicPoolEntry> freeConnections The list of free connections","protected final int maxTotalConnections","protected final ClientConnectionOperator operator Connection operator for this pool","protected final Map<HttpRoute, RouteSpecificPool> routeToPool A map of route-specific pools.","protected Queue<WaitingThread> waitingThreads The list of WaitingThreads waiting for a connection"]}