{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gcm.server","constants":["String ERROR_DEVICE_QUOTA_EXCEEDED Too many messages sent by the sender to a specific device.","String ERROR_INTERNAL_SERVER_ERROR A particular message could not be sent because the GCM servers encountered an error.","String ERROR_INVALID_REGISTRATION Bad registration_id.","String ERROR_INVALID_TTL Time to Live value passed is less than zero or more than maximum.","String ERROR_MESSAGE_TOO_BIG The payload of the message is too big, see the limitations.","String ERROR_MISMATCH_SENDER_ID The sender_id contained in the registration_id does not match the sender_id used to register with the GCM servers.","String ERROR_MISSING_COLLAPSE_KEY Collapse key is required.","String ERROR_MISSING_REGISTRATION Missing registration_id.","String ERROR_NOT_REGISTERED The user has uninstalled the application or turned off notifications.","String ERROR_QUOTA_EXCEEDED Too many messages sent by the sender.","String ERROR_UNAVAILABLE A particular message could not be sent because the GCM servers were not available.","String GCM_SEND_ENDPOINT Endpoint for sending messages.","String JSON_CANONICAL_IDS JSON-only field representing the number of messages with a canonical registration id.","String JSON_ERROR JSON-only field representing the error field of an individual request.","String JSON_FAILURE JSON-only field representing the number of failed messages.","String JSON_MESSAGE_ID JSON-only field sent by GCM when a message was successfully sent.","String JSON_MULTICAST_ID JSON-only field representing the id of the multicast request.","String JSON_PAYLOAD JSON-only field representing the payload data.","String JSON_REGISTRATION_IDS JSON-only field representing the registration ids.","String JSON_RESULTS JSON-only field representing the result of each individual request.","String JSON_SUCCESS JSON-only field representing the number of successful messages.","String PARAM_COLLAPSE_KEY HTTP parameter for collapse key.","String PARAM_DELAY_WHILE_IDLE HTTP parameter for delaying the message delivery if the device is idle.","String PARAM_DRY_RUN HTTP parameter for telling gcm to validate the message without actually sending it.","String PARAM_PAYLOAD_PREFIX Prefix to HTTP parameter used to pass key-values in the message payload.","String PARAM_REGISTRATION_ID HTTP parameter for registration id.","String PARAM_RESTRICTED_PACKAGE_NAME HTTP parameter for package name that can be used to restrict message delivery by matching against the package name used to generate the registration id.","String PARAM_TIME_TO_LIVE Prefix to HTTP parameter used to set the message time-to-live.","String TOKEN_CANONICAL_REG_ID Token returned by GCM when the requested registration id has a canonical value.","String TOKEN_ERROR Token returned by GCM when there was an error sending a message.","String TOKEN_MESSAGE_ID Token returned by GCM when a message was successfully sent."],"class":"Constants","constructors":[],"fields":[]}