{"methods":["static EntityIterator newEntityIterator(Cursor cursor)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_ITEM_TYPE The MIME type of a single group.","String CONTENT_TYPE The MIME type of a directory of groups.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.ContactsContract.BaseSyncColumns String SYNC1 Generic column for use by sync adapters. String SYNC2 Generic column for use by sync adapters. String SYNC3 Generic column for use by sync adapters. String SYNC4 Generic column for use by sync adapters.","String SYNC1 Generic column for use by sync adapters.","String SYNC2 Generic column for use by sync adapters.","String SYNC3 Generic column for use by sync adapters.","String SYNC4 Generic column for use by sync adapters.","From interface android.provider.ContactsContract.GroupsColumns String AUTO_ADD Any newly created contacts will automatically be added to groups that have this flag set to true. String DATA_SET The data set within the account that this group belongs to. String DELETED The \"deleted\" flag: \"0\" by default, \"1\" if the row has been marked for deletion. String FAVORITES When a contacts is marked as a favorites it will be automatically added to the groups that have this flag set, and when it is removed from favorites it will be removed from these groups. String GROUP_IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter. String GROUP_VISIBLE Flag indicating if the contacts belonging to this group should be visible in any user interface. String NOTES Notes about the group. String RES_PACKAGE The package name to use when creating Resources objects for this group. String SHOULD_SYNC Whether this group should be synced if the SYNC_EVERYTHING settings is false for this group's account. String SUMMARY_COUNT The total number of Contacts that have ContactsContract.CommonDataKinds.GroupMembership in this group. String SUMMARY_WITH_PHONES The total number of Contacts that have both ContactsContract.CommonDataKinds.GroupMembership in this group, and also have phone numbers. String SYSTEM_ID The ID of this group if it is a System Group, i.e. String TITLE The display title of this group. String TITLE_RES The display title of this group to load as a resource from RES_PACKAGE, which may be localized.","String AUTO_ADD Any newly created contacts will automatically be added to groups that have this flag set to true.","String DATA_SET The data set within the account that this group belongs to.","String DELETED The \"deleted\" flag: \"0\" by default, \"1\" if the row has been marked for deletion.","String FAVORITES When a contacts is marked as a favorites it will be automatically added to the groups that have this flag set, and when it is removed from favorites it will be removed from these groups.","String GROUP_IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter.","String GROUP_VISIBLE Flag indicating if the contacts belonging to this group should be visible in any user interface.","String NOTES Notes about the group.","String RES_PACKAGE The package name to use when creating Resources objects for this group.","String SHOULD_SYNC Whether this group should be synced if the SYNC_EVERYTHING settings is false for this group's account.","String SUMMARY_COUNT The total number of Contacts that have ContactsContract.CommonDataKinds.GroupMembership in this group.","String SUMMARY_WITH_PHONES The total number of Contacts that have both ContactsContract.CommonDataKinds.GroupMembership in this group, and also have phone numbers.","String SYSTEM_ID The ID of this group if it is a System Group, i.e.","String TITLE The display title of this group.","String TITLE_RES The display title of this group to load as a resource from RES_PACKAGE, which may be localized.","From interface android.provider.ContactsContract.SyncColumns String ACCOUNT_NAME The name of the account instance to which this row belongs, which when paired with ACCOUNT_TYPE identifies a specific account. String ACCOUNT_TYPE The type of account to which this row belongs, which when paired with ACCOUNT_NAME identifies a specific account. String DIRTY Flag indicating that VERSION has changed, and this row needs to be synchronized by its owning account. String SOURCE_ID String that uniquely identifies this row to its source account. String VERSION Version number that is updated whenever this row or its related data changes.","String ACCOUNT_NAME The name of the account instance to which this row belongs, which when paired with ACCOUNT_TYPE identifies a specific account.","String ACCOUNT_TYPE The type of account to which this row belongs, which when paired with ACCOUNT_NAME identifies a specific account.","String DIRTY Flag indicating that VERSION has changed, and this row needs to be synchronized by its owning account.","String SOURCE_ID String that uniquely identifies this row to its source account.","String VERSION Version number that is updated whenever this row or its related data changes."],"class":"ContactsContract.Groups","constructors":[],"fields":["public static final Uri CONTENT_SUMMARY_URI The content:// style URI for this table joined with details data from ContactsContract.Data.","public static final Uri CONTENT_URI The content:// style URI for this table"]}