{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String QUERY_PARAMETER_SIP_ADDRESS If this boolean parameter is set to true, then the appended query is treated as a SIP address and the lookup will be performed against SIP addresses in the user's contacts.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.ContactsContract.ContactOptionsColumns String CUSTOM_RINGTONE URI for a custom ringtone associated with the contact. String LAST_TIME_CONTACTED The last time a contact was contacted. String PINNED The position at which the contact is pinned. String SEND_TO_VOICEMAIL Whether the contact should always be sent to voicemail. String STARRED Is the contact starred? Type: INTEGER (boolean) String TIMES_CONTACTED The number of times a contact has been contacted Type: INTEGER","String CUSTOM_RINGTONE URI for a custom ringtone associated with the contact.","String LAST_TIME_CONTACTED The last time a contact was contacted.","String PINNED The position at which the contact is pinned.","String SEND_TO_VOICEMAIL Whether the contact should always be sent to voicemail.","String STARRED Is the contact starred? Type: INTEGER (boolean)","String TIMES_CONTACTED The number of times a contact has been contacted Type: INTEGER","From interface android.provider.ContactsContract.ContactsColumns String CONTACT_LAST_UPDATED_TIMESTAMP Timestamp (milliseconds since epoch) of when this contact was last updated. String DISPLAY_NAME The display name for the contact. String HAS_PHONE_NUMBER An indicator of whether this contact has at least one phone number. String IN_DEFAULT_DIRECTORY Flag that reflects whether the contact exists inside the default directory. String IN_VISIBLE_GROUP Flag that reflects the GROUP_VISIBLE state of any ContactsContract.CommonDataKinds.GroupMembership for this contact. String IS_USER_PROFILE Flag that reflects whether this contact represents the user's personal profile entry. String LOOKUP_KEY An opaque value that contains hints on how to find the contact if its row id changed as a result of a sync or aggregation. String NAME_RAW_CONTACT_ID Reference to the row in the RawContacts table holding the contact name. String PHOTO_FILE_ID Photo file ID of the full-size photo. String PHOTO_ID Reference to the row in the data table holding the photo. String PHOTO_THUMBNAIL_URI A URI that can be used to retrieve a thumbnail of the contact's photo. String PHOTO_URI A URI that can be used to retrieve the contact's full-size photo.","String CONTACT_LAST_UPDATED_TIMESTAMP Timestamp (milliseconds since epoch) of when this contact was last updated.","String DISPLAY_NAME The display name for the contact.","String HAS_PHONE_NUMBER An indicator of whether this contact has at least one phone number.","String IN_DEFAULT_DIRECTORY Flag that reflects whether the contact exists inside the default directory.","String IN_VISIBLE_GROUP Flag that reflects the GROUP_VISIBLE state of any ContactsContract.CommonDataKinds.GroupMembership for this contact.","String IS_USER_PROFILE Flag that reflects whether this contact represents the user's personal profile entry.","String LOOKUP_KEY An opaque value that contains hints on how to find the contact if its row id changed as a result of a sync or aggregation.","String NAME_RAW_CONTACT_ID Reference to the row in the RawContacts table holding the contact name.","String PHOTO_FILE_ID Photo file ID of the full-size photo.","String PHOTO_ID Reference to the row in the data table holding the photo.","String PHOTO_THUMBNAIL_URI A URI that can be used to retrieve a thumbnail of the contact's photo.","String PHOTO_URI A URI that can be used to retrieve the contact's full-size photo.","From interface android.provider.ContactsContract.PhoneLookupColumns String LABEL The user defined label for the phone number. String NORMALIZED_NUMBER The phone number's E164 representation. String NUMBER The phone number as the user entered it. String TYPE The type of phone number, for example Home or Work.","String LABEL The user defined label for the phone number.","String NORMALIZED_NUMBER The phone number's E164 representation.","String NUMBER The phone number as the user entered it.","String TYPE The type of phone number, for example Home or Work."],"class":"ContactsContract.PhoneLookup","constructors":[],"fields":["public static final Uri CONTENT_FILTER_URI The content:// style URI for this table.","public static final Uri ENTERPRISE_CONTENT_FILTER_URI URI used for the \"enterprise caller-id\"."]}