{"methods":["static String getSetting(ContentResolver cr, String account, String key) This method was deprecated in API level 5. see ContactsContract","static void setSetting(ContentResolver cr, String account, String key, String value) This method was deprecated in API level 5. see ContactsContract","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_DIRECTORY This constant was deprecated in API level 5. see ContactsContract","String DEFAULT_SORT_ORDER This constant was deprecated in API level 5. see ContactsContract","String SYNC_EVERYTHING This constant was deprecated in API level 5. see ContactsContract","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.Contacts.SettingsColumns String KEY This constant was deprecated in API level 5. see ContactsContract String VALUE This constant was deprecated in API level 5. see ContactsContract String _SYNC_ACCOUNT This constant was deprecated in API level 5. see ContactsContract String _SYNC_ACCOUNT_TYPE This constant was deprecated in API level 5. see ContactsContract","String KEY This constant was deprecated in API level 5. see ContactsContract","String VALUE This constant was deprecated in API level 5. see ContactsContract","String _SYNC_ACCOUNT This constant was deprecated in API level 5. see ContactsContract","String _SYNC_ACCOUNT_TYPE This constant was deprecated in API level 5. see ContactsContract"],"class":"Contacts.Settings","constructors":[],"fields":["public static final Uri CONTENT_URI This field was deprecated in API level 5. see ContactsContract"]}