{"methods":["void clear() Removes all values.","boolean containsKey(String key) Returns true if this object has the named value.","int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object object) Compares this instance with the specified object and indicates if they are equal.","Object get(String key) Gets a value.","Boolean getAsBoolean(String key) Gets a value and converts it to a Boolean.","Byte getAsByte(String key) Gets a value and converts it to a Byte.","byte[] getAsByteArray(String key) Gets a value that is a byte array.","Double getAsDouble(String key) Gets a value and converts it to a Double.","Float getAsFloat(String key) Gets a value and converts it to a Float.","Integer getAsInteger(String key) Gets a value and converts it to an Integer.","Long getAsLong(String key) Gets a value and converts it to a Long.","Short getAsShort(String key) Gets a value and converts it to a Short.","String getAsString(String key) Gets a value and converts it to a String.","int hashCode() Returns an integer hash code for this object.","Set<String> keySet() Returns a set of all of the keys","void put(String key, Byte value) Adds a value to the set.","void put(String key, Integer value) Adds a value to the set.","void put(String key, Float value) Adds a value to the set.","void put(String key, Short value) Adds a value to the set.","void put(String key, byte[] value) Adds a value to the set.","void put(String key, String value) Adds a value to the set.","void put(String key, Double value) Adds a value to the set.","void put(String key, Long value) Adds a value to the set.","void put(String key, Boolean value) Adds a value to the set.","void putAll(ContentValues other) Adds all values from the passed in ContentValues.","void putNull(String key) Adds a null value to the set.","void remove(String key) Remove a single value.","int size() Returns the number of values.","String toString() Returns a string containing a concise, human-readable description of this object.","Set<Entry<String, Object>> valueSet() Returns a set of all of the keys and values","void writeToParcel(Parcel parcel, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.content","constants":["String TAG","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"ContentValues","constructors":[],"fields":["public static final Creator<ContentValues> CREATOR"]}