{"methods":["static Uri addToGroup(ContentResolver resolver, long personId, long groupId) This method was deprecated in API level 5. see ContactsContract","static Uri addToGroup(ContentResolver resolver, long personId, String groupName) This method was deprecated in API level 5. see ContactsContract","static Uri addToMyContactsGroup(ContentResolver resolver, long personId) This method was deprecated in API level 5. see ContactsContract","static Uri createPersonInMyContactsGroup(ContentResolver resolver, ContentValues values) This method was deprecated in API level 5. see ContactsContract","static Bitmap loadContactPhoto(Context context, Uri person, int placeholderImageResource, BitmapFactory.Options options) This method was deprecated in API level 5. see ContactsContract","static void markAsContacted(ContentResolver resolver, long personId) This method was deprecated in API level 5. see ContactsContract","static InputStream openContactPhotoInputStream(ContentResolver cr, Uri person) This method was deprecated in API level 5. see ContactsContract","static Cursor queryGroups(ContentResolver resolver, long person) This method was deprecated in API level 5. see ContactsContract","static void setPhotoData(ContentResolver cr, Uri person, byte[] data) This method was deprecated in API level 5. see ContactsContract","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_ITEM_TYPE This constant was deprecated in API level 5. see ContactsContract","String CONTENT_TYPE This constant was deprecated in API level 5. see ContactsContract","String DEFAULT_SORT_ORDER This constant was deprecated in API level 5. see ContactsContract","String PRIMARY_EMAIL_ID This constant was deprecated in API level 5. see ContactsContract","String PRIMARY_ORGANIZATION_ID This constant was deprecated in API level 5. see ContactsContract","String PRIMARY_PHONE_ID This constant was deprecated in API level 5. see ContactsContract","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.Contacts.PeopleColumns String CUSTOM_RINGTONE This constant was deprecated in API level 5. see ContactsContract String DISPLAY_NAME This constant was deprecated in API level 5. see ContactsContract String LAST_TIME_CONTACTED This constant was deprecated in API level 5. see ContactsContract String NAME This constant was deprecated in API level 5. see ContactsContract String NOTES This constant was deprecated in API level 5. see ContactsContract String PHONETIC_NAME This constant was deprecated in API level 5. see ContactsContract String PHOTO_VERSION This constant was deprecated in API level 5. see ContactsContract String SEND_TO_VOICEMAIL This constant was deprecated in API level 5. see ContactsContract String STARRED This constant was deprecated in API level 5. see ContactsContract String TIMES_CONTACTED This constant was deprecated in API level 5. see ContactsContract","String CUSTOM_RINGTONE This constant was deprecated in API level 5. see ContactsContract","String DISPLAY_NAME This constant was deprecated in API level 5. see ContactsContract","String LAST_TIME_CONTACTED This constant was deprecated in API level 5. see ContactsContract","String NAME This constant was deprecated in API level 5. see ContactsContract","String NOTES This constant was deprecated in API level 5. see ContactsContract","String PHONETIC_NAME This constant was deprecated in API level 5. see ContactsContract","String PHOTO_VERSION This constant was deprecated in API level 5. see ContactsContract","String SEND_TO_VOICEMAIL This constant was deprecated in API level 5. see ContactsContract","String STARRED This constant was deprecated in API level 5. see ContactsContract","String TIMES_CONTACTED This constant was deprecated in API level 5. see ContactsContract","From interface android.provider.Contacts.PhonesColumns String ISPRIMARY This constant was deprecated in API level 5. see ContactsContract String LABEL This constant was deprecated in API level 5. see ContactsContract String NUMBER This constant was deprecated in API level 5. see ContactsContract String NUMBER_KEY This constant was deprecated in API level 5. see ContactsContract String TYPE This constant was deprecated in API level 5. see ContactsContract int TYPE_CUSTOM This constant was deprecated in API level 5. see ContactsContract int TYPE_FAX_HOME This constant was deprecated in API level 5. see ContactsContract int TYPE_FAX_WORK This constant was deprecated in API level 5. see ContactsContract int TYPE_HOME This constant was deprecated in API level 5. see ContactsContract int TYPE_MOBILE This constant was deprecated in API level 5. see ContactsContract int TYPE_OTHER This constant was deprecated in API level 5. see ContactsContract int TYPE_PAGER This constant was deprecated in API level 5. see ContactsContract int TYPE_WORK This constant was deprecated in API level 5. see ContactsContract","String ISPRIMARY This constant was deprecated in API level 5. see ContactsContract","String LABEL This constant was deprecated in API level 5. see ContactsContract","String NUMBER This constant was deprecated in API level 5. see ContactsContract","String NUMBER_KEY This constant was deprecated in API level 5. see ContactsContract","String TYPE This constant was deprecated in API level 5. see ContactsContract","int TYPE_CUSTOM This constant was deprecated in API level 5. see ContactsContract","int TYPE_FAX_HOME This constant was deprecated in API level 5. see ContactsContract","int TYPE_FAX_WORK This constant was deprecated in API level 5. see ContactsContract","int TYPE_HOME This constant was deprecated in API level 5. see ContactsContract","int TYPE_MOBILE This constant was deprecated in API level 5. see ContactsContract","int TYPE_OTHER This constant was deprecated in API level 5. see ContactsContract","int TYPE_PAGER This constant was deprecated in API level 5. see ContactsContract","int TYPE_WORK This constant was deprecated in API level 5. see ContactsContract","From interface android.provider.Contacts.PresenceColumns int AVAILABLE int AWAY int DO_NOT_DISTURB int IDLE String IM_ACCOUNT This constant was deprecated in API level 5. see ContactsContract String IM_HANDLE This constant was deprecated in API level 5. see ContactsContract String IM_PROTOCOL This constant was deprecated in API level 5. see ContactsContract int INVISIBLE int OFFLINE Presence Status definition String PRESENCE_CUSTOM_STATUS The user defined status line. String PRESENCE_STATUS The server defined status. String PRIORITY The priority, an integer, used by XMPP presence Type: INTEGER","int AVAILABLE","int AWAY","int DO_NOT_DISTURB","int IDLE","String IM_ACCOUNT This constant was deprecated in API level 5. see ContactsContract","String IM_HANDLE This constant was deprecated in API level 5. see ContactsContract","String IM_PROTOCOL This constant was deprecated in API level 5. see ContactsContract","int INVISIBLE","int OFFLINE Presence Status definition","String PRESENCE_CUSTOM_STATUS The user defined status line.","String PRESENCE_STATUS The server defined status.","String PRIORITY The priority, an integer, used by XMPP presence Type: INTEGER"],"class":"Contacts.People","constructors":[],"fields":["public static final Uri CONTENT_FILTER_URI This field was deprecated in API level 5. see ContactsContract","public static final Uri CONTENT_URI This field was deprecated in API level 5. see ContactsContract","public static final Uri DELETED_CONTENT_URI This field was deprecated in API level 5. see ContactsContract"]}