{"methods":["[Expand] Inherited Methods","From class android.provider.ContactsContract.StatusUpdates final static int getPresenceIconResourceId(int status) Gets the resource ID for the proper presence icon. final static int getPresencePrecedence(int status) Returns the precedence of the status code the higher number being the higher precedence.","final static int getPresenceIconResourceId(int status) Gets the resource ID for the proper presence icon.","final static int getPresencePrecedence(int status) Returns the precedence of the status code the higher number being the higher precedence.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["[Expand] Inherited Constants","From class android.provider.ContactsContract.StatusUpdates String CONTENT_ITEM_TYPE The MIME type of a CONTENT_URI subdirectory of a single status update detail. String CONTENT_TYPE The MIME type of CONTENT_URI providing a directory of status update details.","String CONTENT_ITEM_TYPE The MIME type of a CONTENT_URI subdirectory of a single status update detail.","String CONTENT_TYPE The MIME type of CONTENT_URI providing a directory of status update details.","From interface android.provider.ContactsContract.PresenceColumns String CUSTOM_PROTOCOL Name of the custom protocol. String DATA_ID Reference to the _ID entry that owns this presence. String IM_ACCOUNT The IM account for the local user that the presence data came from. String IM_HANDLE The IM handle the presence item is for. String PROTOCOL See ContactsContract.CommonDataKinds.Im for a list of defined protocol constants.","String CUSTOM_PROTOCOL Name of the custom protocol.","String DATA_ID Reference to the _ID entry that owns this presence.","String IM_ACCOUNT The IM account for the local user that the presence data came from.","String IM_HANDLE The IM handle the presence item is for.","String PROTOCOL See ContactsContract.CommonDataKinds.Im for a list of defined protocol constants.","From interface android.provider.ContactsContract.StatusColumns int AVAILABLE An allowed value of PRESENCE. int AWAY An allowed value of PRESENCE. int CAPABILITY_HAS_CAMERA An allowed flag of CHAT_CAPABILITY. int CAPABILITY_HAS_VIDEO An allowed flag of CHAT_CAPABILITY. int CAPABILITY_HAS_VOICE An allowed flag of CHAT_CAPABILITY. String CHAT_CAPABILITY Contact's audio/video chat capability level. int DO_NOT_DISTURB An allowed value of PRESENCE. int IDLE An allowed value of PRESENCE. int INVISIBLE An allowed value of PRESENCE. int OFFLINE An allowed value of PRESENCE. String PRESENCE Contact's latest presence level. String PRESENCE_CUSTOM_STATUS This constant was deprecated in API level 8. use STATUS String PRESENCE_STATUS This constant was deprecated in API level 8. use PRESENCE String STATUS Contact latest status update. String STATUS_ICON The resource ID of the icon for the source of the status update. String STATUS_LABEL The resource ID of the label describing the source of the status update, e.g. String STATUS_RES_PACKAGE The package containing resources for this status: label and icon. String STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated.","int AVAILABLE An allowed value of PRESENCE.","int AWAY An allowed value of PRESENCE.","int CAPABILITY_HAS_CAMERA An allowed flag of CHAT_CAPABILITY.","int CAPABILITY_HAS_VIDEO An allowed flag of CHAT_CAPABILITY.","int CAPABILITY_HAS_VOICE An allowed flag of CHAT_CAPABILITY.","String CHAT_CAPABILITY Contact's audio/video chat capability level.","int DO_NOT_DISTURB An allowed value of PRESENCE.","int IDLE An allowed value of PRESENCE.","int INVISIBLE An allowed value of PRESENCE.","int OFFLINE An allowed value of PRESENCE.","String PRESENCE Contact's latest presence level.","String PRESENCE_CUSTOM_STATUS This constant was deprecated in API level 8. use STATUS","String PRESENCE_STATUS This constant was deprecated in API level 8. use PRESENCE","String STATUS Contact latest status update.","String STATUS_ICON The resource ID of the icon for the source of the status update.","String STATUS_LABEL The resource ID of the label describing the source of the status update, e.g.","String STATUS_RES_PACKAGE The package containing resources for this status: label and icon.","String STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated."],"class":"ContactsContract.Presence","constructors":[],"fields":[]}