{"methods":["static void notifyDirectoryChange(ContentResolver resolver) Notifies the system of a change in the list of directories handled by a particular directory provider.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ACCOUNT_NAME The account with which this directory is associated.","String ACCOUNT_TYPE The account type which this directory is associated.","String CONTENT_ITEM_TYPE The MIME type of a CONTENT_URI item.","String CONTENT_TYPE The MIME-type of CONTENT_URI providing a directory of contact directories.","long DEFAULT _ID of the default directory, which represents locally stored contacts.","String DIRECTORY_AUTHORITY The authority of the Directory Provider.","String DISPLAY_NAME An optional name that can be used in the UI to represent this directory, e.g.","String EXPORT_SUPPORT One of EXPORT_SUPPORT_NONE, EXPORT_SUPPORT_ANY_ACCOUNT, EXPORT_SUPPORT_SAME_ACCOUNT_ONLY.","int EXPORT_SUPPORT_ANY_ACCOUNT An EXPORT_SUPPORT setting that indicates that the directory allow its data copied to any contacts account.","int EXPORT_SUPPORT_NONE An EXPORT_SUPPORT setting that indicates that the directory does not allow any data to be copied out of it.","int EXPORT_SUPPORT_SAME_ACCOUNT_ONLY An EXPORT_SUPPORT setting that indicates that the directory allow its data copied only to the account specified by ACCOUNT_TYPE/ACCOUNT_NAME.","long LOCAL_INVISIBLE _ID of the directory that represents locally stored invisible contacts.","String PACKAGE_NAME The name of the package that owns this directory.","String PHOTO_SUPPORT One of PHOTO_SUPPORT_NONE, PHOTO_SUPPORT_THUMBNAIL_ONLY, PHOTO_SUPPORT_FULL.","int PHOTO_SUPPORT_FULL An PHOTO_SUPPORT setting that indicates that the directory can produce thumbnails as well as full-size contact photos.","int PHOTO_SUPPORT_FULL_SIZE_ONLY An PHOTO_SUPPORT setting that indicates that the directory has full-size contact photos, but cannot provide scaled thumbnails.","int PHOTO_SUPPORT_NONE An PHOTO_SUPPORT setting that indicates that the directory does not provide any photos.","int PHOTO_SUPPORT_THUMBNAIL_ONLY An PHOTO_SUPPORT setting that indicates that the directory can only produce small size thumbnails of contact photos.","String SHORTCUT_SUPPORT One of SHORTCUT_SUPPORT_NONE, SHORTCUT_SUPPORT_DATA_ITEMS_ONLY, SHORTCUT_SUPPORT_FULL.","int SHORTCUT_SUPPORT_DATA_ITEMS_ONLY An SHORTCUT_SUPPORT setting that indicates that the directory allow creation of shortcuts for data items like email, phone or postal address, but not the entire contact.","int SHORTCUT_SUPPORT_FULL An SHORTCUT_SUPPORT setting that indicates that the directory allow creation of shortcuts for contact as well as their constituent elements.","int SHORTCUT_SUPPORT_NONE An SHORTCUT_SUPPORT setting that indicates that the directory does not allow any shortcuts created for its contacts.","String TYPE_RESOURCE_ID The type of directory captured as a resource ID in the context of the package PACKAGE_NAME, e.g.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"ContactsContract.Directory","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URI for this table."]}