{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_ITEM_TYPE The MIME-type of CONTENT_URI providing a single setting.","String CONTENT_TYPE The MIME-type of CONTENT_URI providing a directory of settings.","[Expand] Inherited Constants","From interface android.provider.ContactsContract.SettingsColumns String ACCOUNT_NAME The name of the account instance to which this row belongs. String ACCOUNT_TYPE The type of account to which this row belongs, which when paired with ACCOUNT_NAME identifies a specific account. String ANY_UNSYNCED Read-only flag indicating if this SHOULD_SYNC or any SHOULD_SYNC under this account have been marked as unsynced. String DATA_SET The data set within the account that this row belongs to. String SHOULD_SYNC Depending on the mode defined by the sync-adapter, this flag controls the top-level sync behavior for this data source. String UNGROUPED_COUNT Read-only count of Contacts from a specific source that have no ContactsContract.CommonDataKinds.GroupMembership entries. String UNGROUPED_VISIBLE Flag indicating if contacts without any ContactsContract.CommonDataKinds.GroupMembership entries should be visible in any user interface. String UNGROUPED_WITH_PHONES Read-only count of Contacts from a specific source that have no ContactsContract.CommonDataKinds.GroupMembership entries, and also have phone numbers.","String ACCOUNT_NAME The name of the account instance to which this row belongs.","String ACCOUNT_TYPE The type of account to which this row belongs, which when paired with ACCOUNT_NAME identifies a specific account.","String ANY_UNSYNCED Read-only flag indicating if this SHOULD_SYNC or any SHOULD_SYNC under this account have been marked as unsynced.","String DATA_SET The data set within the account that this row belongs to.","String SHOULD_SYNC Depending on the mode defined by the sync-adapter, this flag controls the top-level sync behavior for this data source.","String UNGROUPED_COUNT Read-only count of Contacts from a specific source that have no ContactsContract.CommonDataKinds.GroupMembership entries.","String UNGROUPED_VISIBLE Flag indicating if contacts without any ContactsContract.CommonDataKinds.GroupMembership entries should be visible in any user interface.","String UNGROUPED_WITH_PHONES Read-only count of Contacts from a specific source that have no ContactsContract.CommonDataKinds.GroupMembership entries, and also have phone numbers."],"class":"ContactsContract.Settings","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URI for this table"]}