{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String PHOTO This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.ContactsContract.StreamItemPhotosColumns String PHOTO_FILE_ID This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String PHOTO_URI This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String SORT_INDEX This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String STREAM_ITEM_ID This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String SYNC1 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String SYNC2 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String SYNC3 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty. String SYNC4 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String PHOTO_FILE_ID This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String PHOTO_URI This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String SORT_INDEX This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String STREAM_ITEM_ID This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String SYNC1 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String SYNC2 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String SYNC3 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty.","String SYNC4 This constant was deprecated in API level 21. - Do not use. This will not be supported in the future. In the future, cursors returned from related queries will be empty."],"class":"ContactsContract.StreamItemPhotos","constructors":[],"fields":[]}