{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_ITEM_TYPE MIME type used when storing this in data table.","String EXTRA_ADDRESS_BOOK_INDEX Add this query parameter to a URI to get back row counts grouped by the address book index as cursor extras.","String EXTRA_ADDRESS_BOOK_INDEX_COUNTS The array of group counts for the corresponding group.","String EXTRA_ADDRESS_BOOK_INDEX_TITLES The array of address book index titles, which are returned in the same order as the data in the cursor.","String GROUP_ROW_ID The row id of the group that this group membership refers to.","String GROUP_SOURCE_ID The sourceid of the group that this group membership refers to.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.ContactsContract.ContactNameColumns String DISPLAY_NAME_ALTERNATIVE An alternative representation of the display name, such as \"family name first\" instead of \"given name first\" for Western names. String DISPLAY_NAME_PRIMARY The standard text shown as the contact's display name, based on the best available information for the contact (for example, it might be the email address if the name is not available). String DISPLAY_NAME_SOURCE The kind of data that is used as the display name for the contact, such as structured name or email address. String PHONETIC_NAME Pronunciation of the full name in the phonetic alphabet specified by PHONETIC_NAME_STYLE. String PHONETIC_NAME_STYLE The phonetic alphabet used to represent the PHONETIC_NAME. String SORT_KEY_ALTERNATIVE Sort key based on the alternative representation of the full name, DISPLAY_NAME_ALTERNATIVE. String SORT_KEY_PRIMARY Sort key that takes into account locale-based traditions for sorting names in address books.","String DISPLAY_NAME_ALTERNATIVE An alternative representation of the display name, such as \"family name first\" instead of \"given name first\" for Western names.","String DISPLAY_NAME_PRIMARY The standard text shown as the contact's display name, based on the best available information for the contact (for example, it might be the email address if the name is not available).","String DISPLAY_NAME_SOURCE The kind of data that is used as the display name for the contact, such as structured name or email address.","String PHONETIC_NAME Pronunciation of the full name in the phonetic alphabet specified by PHONETIC_NAME_STYLE.","String PHONETIC_NAME_STYLE The phonetic alphabet used to represent the PHONETIC_NAME.","String SORT_KEY_ALTERNATIVE Sort key based on the alternative representation of the full name, DISPLAY_NAME_ALTERNATIVE.","String SORT_KEY_PRIMARY Sort key that takes into account locale-based traditions for sorting names in address books.","From interface android.provider.ContactsContract.ContactOptionsColumns String CUSTOM_RINGTONE URI for a custom ringtone associated with the contact. String LAST_TIME_CONTACTED The last time a contact was contacted. String PINNED The position at which the contact is pinned. String SEND_TO_VOICEMAIL Whether the contact should always be sent to voicemail. String STARRED Is the contact starred? Type: INTEGER (boolean) String TIMES_CONTACTED The number of times a contact has been contacted Type: INTEGER","String CUSTOM_RINGTONE URI for a custom ringtone associated with the contact.","String LAST_TIME_CONTACTED The last time a contact was contacted.","String PINNED The position at which the contact is pinned.","String SEND_TO_VOICEMAIL Whether the contact should always be sent to voicemail.","String STARRED Is the contact starred? Type: INTEGER (boolean)","String TIMES_CONTACTED The number of times a contact has been contacted Type: INTEGER","From interface android.provider.ContactsContract.ContactStatusColumns String CONTACT_CHAT_CAPABILITY Contact Chat Capabilities. String CONTACT_PRESENCE Contact presence status. String CONTACT_STATUS Contact's latest status update. String CONTACT_STATUS_ICON The resource ID of the icon for the source of contact status. String CONTACT_STATUS_LABEL The resource ID of the label describing the source of contact status, e.g. String CONTACT_STATUS_RES_PACKAGE The package containing resources for this status: label and icon. String CONTACT_STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated.","String CONTACT_CHAT_CAPABILITY Contact Chat Capabilities.","String CONTACT_PRESENCE Contact presence status.","String CONTACT_STATUS Contact's latest status update.","String CONTACT_STATUS_ICON The resource ID of the icon for the source of contact status.","String CONTACT_STATUS_LABEL The resource ID of the label describing the source of contact status, e.g.","String CONTACT_STATUS_RES_PACKAGE The package containing resources for this status: label and icon.","String CONTACT_STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated.","From interface android.provider.ContactsContract.ContactsColumns String CONTACT_LAST_UPDATED_TIMESTAMP Timestamp (milliseconds since epoch) of when this contact was last updated. String DISPLAY_NAME The display name for the contact. String HAS_PHONE_NUMBER An indicator of whether this contact has at least one phone number. String IN_DEFAULT_DIRECTORY Flag that reflects whether the contact exists inside the default directory. String IN_VISIBLE_GROUP Flag that reflects the GROUP_VISIBLE state of any ContactsContract.CommonDataKinds.GroupMembership for this contact. String IS_USER_PROFILE Flag that reflects whether this contact represents the user's personal profile entry. String LOOKUP_KEY An opaque value that contains hints on how to find the contact if its row id changed as a result of a sync or aggregation. String NAME_RAW_CONTACT_ID Reference to the row in the RawContacts table holding the contact name. String PHOTO_FILE_ID Photo file ID of the full-size photo. String PHOTO_ID Reference to the row in the data table holding the photo. String PHOTO_THUMBNAIL_URI A URI that can be used to retrieve a thumbnail of the contact's photo. String PHOTO_URI A URI that can be used to retrieve the contact's full-size photo.","String CONTACT_LAST_UPDATED_TIMESTAMP Timestamp (milliseconds since epoch) of when this contact was last updated.","String DISPLAY_NAME The display name for the contact.","String HAS_PHONE_NUMBER An indicator of whether this contact has at least one phone number.","String IN_DEFAULT_DIRECTORY Flag that reflects whether the contact exists inside the default directory.","String IN_VISIBLE_GROUP Flag that reflects the GROUP_VISIBLE state of any ContactsContract.CommonDataKinds.GroupMembership for this contact.","String IS_USER_PROFILE Flag that reflects whether this contact represents the user's personal profile entry.","String LOOKUP_KEY An opaque value that contains hints on how to find the contact if its row id changed as a result of a sync or aggregation.","String NAME_RAW_CONTACT_ID Reference to the row in the RawContacts table holding the contact name.","String PHOTO_FILE_ID Photo file ID of the full-size photo.","String PHOTO_ID Reference to the row in the data table holding the photo.","String PHOTO_THUMBNAIL_URI A URI that can be used to retrieve a thumbnail of the contact's photo.","String PHOTO_URI A URI that can be used to retrieve the contact's full-size photo.","From interface android.provider.ContactsContract.DataColumns String DATA1 Generic data column, the meaning is MIMETYPE specific String DATA10 Generic data column, the meaning is MIMETYPE specific String DATA11 Generic data column, the meaning is MIMETYPE specific String DATA12 Generic data column, the meaning is MIMETYPE specific String DATA13 Generic data column, the meaning is MIMETYPE specific String DATA14 Generic data column, the meaning is MIMETYPE specific String DATA15 Generic data column, the meaning is MIMETYPE specific. String DATA2 Generic data column, the meaning is MIMETYPE specific String DATA3 Generic data column, the meaning is MIMETYPE specific String DATA4 Generic data column, the meaning is MIMETYPE specific String DATA5 Generic data column, the meaning is MIMETYPE specific String DATA6 Generic data column, the meaning is MIMETYPE specific String DATA7 Generic data column, the meaning is MIMETYPE specific String DATA8 Generic data column, the meaning is MIMETYPE specific String DATA9 Generic data column, the meaning is MIMETYPE specific String DATA_VERSION The version of this data record. String IS_PRIMARY Whether this is the primary entry of its kind for the raw contact it belongs to. String IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter. String IS_SUPER_PRIMARY Whether this is the primary entry of its kind for the aggregate contact it belongs to. String MIMETYPE The MIME type of the item represented by this row. String RAW_CONTACT_ID A reference to the _ID that this data belongs to. String RES_PACKAGE The package name to use when creating Resources objects for this data row. String SYNC1 Generic column for use by sync adapters. String SYNC2 Generic column for use by sync adapters. String SYNC3 Generic column for use by sync adapters. String SYNC4 Generic column for use by sync adapters.","String DATA1 Generic data column, the meaning is MIMETYPE specific","String DATA10 Generic data column, the meaning is MIMETYPE specific","String DATA11 Generic data column, the meaning is MIMETYPE specific","String DATA12 Generic data column, the meaning is MIMETYPE specific","String DATA13 Generic data column, the meaning is MIMETYPE specific","String DATA14 Generic data column, the meaning is MIMETYPE specific","String DATA15 Generic data column, the meaning is MIMETYPE specific.","String DATA2 Generic data column, the meaning is MIMETYPE specific","String DATA3 Generic data column, the meaning is MIMETYPE specific","String DATA4 Generic data column, the meaning is MIMETYPE specific","String DATA5 Generic data column, the meaning is MIMETYPE specific","String DATA6 Generic data column, the meaning is MIMETYPE specific","String DATA7 Generic data column, the meaning is MIMETYPE specific","String DATA8 Generic data column, the meaning is MIMETYPE specific","String DATA9 Generic data column, the meaning is MIMETYPE specific","String DATA_VERSION The version of this data record.","String IS_PRIMARY Whether this is the primary entry of its kind for the raw contact it belongs to.","String IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter.","String IS_SUPER_PRIMARY Whether this is the primary entry of its kind for the aggregate contact it belongs to.","String MIMETYPE The MIME type of the item represented by this row.","String RAW_CONTACT_ID A reference to the _ID that this data belongs to.","String RES_PACKAGE The package name to use when creating Resources objects for this data row.","String SYNC1 Generic column for use by sync adapters.","String SYNC2 Generic column for use by sync adapters.","String SYNC3 Generic column for use by sync adapters.","String SYNC4 Generic column for use by sync adapters.","From interface android.provider.ContactsContract.DataUsageStatColumns String LAST_TIME_USED The last time (in milliseconds) this ContactsContract.Contacts.Data was used. String TIMES_USED The number of times the referenced ContactsContract.Contacts.Data has been used.","String LAST_TIME_USED The last time (in milliseconds) this ContactsContract.Contacts.Data was used.","String TIMES_USED The number of times the referenced ContactsContract.Contacts.Data has been used.","From interface android.provider.ContactsContract.RawContactsColumns String ACCOUNT_TYPE_AND_DATA_SET A concatenation of the account type and data set (delimited by a forward slash) - if the data set is empty, this will be the same as the account type. String AGGREGATION_MODE The aggregation mode for this contact. String CONTACT_ID A reference to the _ID that this data belongs to. String DATA_SET The data set within the account that this row belongs to. String DELETED The \"deleted\" flag: \"0\" by default, \"1\" if the row has been marked for deletion. String RAW_CONTACT_IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter. String RAW_CONTACT_IS_USER_PROFILE Flag that reflects whether this raw contact belongs to the user's personal profile entry.","String ACCOUNT_TYPE_AND_DATA_SET A concatenation of the account type and data set (delimited by a forward slash) - if the data set is empty, this will be the same as the account type.","String AGGREGATION_MODE The aggregation mode for this contact.","String CONTACT_ID A reference to the _ID that this data belongs to.","String DATA_SET The data set within the account that this row belongs to.","String DELETED The \"deleted\" flag: \"0\" by default, \"1\" if the row has been marked for deletion.","String RAW_CONTACT_IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter.","String RAW_CONTACT_IS_USER_PROFILE Flag that reflects whether this raw contact belongs to the user's personal profile entry.","From interface android.provider.ContactsContract.StatusColumns int AVAILABLE An allowed value of PRESENCE. int AWAY An allowed value of PRESENCE. int CAPABILITY_HAS_CAMERA An allowed flag of CHAT_CAPABILITY. int CAPABILITY_HAS_VIDEO An allowed flag of CHAT_CAPABILITY. int CAPABILITY_HAS_VOICE An allowed flag of CHAT_CAPABILITY. String CHAT_CAPABILITY Contact's audio/video chat capability level. int DO_NOT_DISTURB An allowed value of PRESENCE. int IDLE An allowed value of PRESENCE. int INVISIBLE An allowed value of PRESENCE. int OFFLINE An allowed value of PRESENCE. String PRESENCE Contact's latest presence level. String PRESENCE_CUSTOM_STATUS This constant was deprecated in API level 8. use STATUS String PRESENCE_STATUS This constant was deprecated in API level 8. use PRESENCE String STATUS Contact latest status update. String STATUS_ICON The resource ID of the icon for the source of the status update. String STATUS_LABEL The resource ID of the label describing the source of the status update, e.g. String STATUS_RES_PACKAGE The package containing resources for this status: label and icon. String STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated.","int AVAILABLE An allowed value of PRESENCE.","int AWAY An allowed value of PRESENCE.","int CAPABILITY_HAS_CAMERA An allowed flag of CHAT_CAPABILITY.","int CAPABILITY_HAS_VIDEO An allowed flag of CHAT_CAPABILITY.","int CAPABILITY_HAS_VOICE An allowed flag of CHAT_CAPABILITY.","String CHAT_CAPABILITY Contact's audio/video chat capability level.","int DO_NOT_DISTURB An allowed value of PRESENCE.","int IDLE An allowed value of PRESENCE.","int INVISIBLE An allowed value of PRESENCE.","int OFFLINE An allowed value of PRESENCE.","String PRESENCE Contact's latest presence level.","String PRESENCE_CUSTOM_STATUS This constant was deprecated in API level 8. use STATUS","String PRESENCE_STATUS This constant was deprecated in API level 8. use PRESENCE","String STATUS Contact latest status update.","String STATUS_ICON The resource ID of the icon for the source of the status update.","String STATUS_LABEL The resource ID of the label describing the source of the status update, e.g.","String STATUS_RES_PACKAGE The package containing resources for this status: label and icon.","String STATUS_TIMESTAMP The absolute time in milliseconds when the latest status was inserted/updated."],"class":"ContactsContract.CommonDataKinds.GroupMembership","constructors":[],"fields":[]}