{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONTENT_DIRECTORY The directory twig for this sub-table","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.ContactsContract.DataColumns String DATA1 Generic data column, the meaning is MIMETYPE specific String DATA10 Generic data column, the meaning is MIMETYPE specific String DATA11 Generic data column, the meaning is MIMETYPE specific String DATA12 Generic data column, the meaning is MIMETYPE specific String DATA13 Generic data column, the meaning is MIMETYPE specific String DATA14 Generic data column, the meaning is MIMETYPE specific String DATA15 Generic data column, the meaning is MIMETYPE specific. String DATA2 Generic data column, the meaning is MIMETYPE specific String DATA3 Generic data column, the meaning is MIMETYPE specific String DATA4 Generic data column, the meaning is MIMETYPE specific String DATA5 Generic data column, the meaning is MIMETYPE specific String DATA6 Generic data column, the meaning is MIMETYPE specific String DATA7 Generic data column, the meaning is MIMETYPE specific String DATA8 Generic data column, the meaning is MIMETYPE specific String DATA9 Generic data column, the meaning is MIMETYPE specific String DATA_VERSION The version of this data record. String IS_PRIMARY Whether this is the primary entry of its kind for the raw contact it belongs to. String IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter. String IS_SUPER_PRIMARY Whether this is the primary entry of its kind for the aggregate contact it belongs to. String MIMETYPE The MIME type of the item represented by this row. String RAW_CONTACT_ID A reference to the _ID that this data belongs to. String RES_PACKAGE The package name to use when creating Resources objects for this data row. String SYNC1 Generic column for use by sync adapters. String SYNC2 Generic column for use by sync adapters. String SYNC3 Generic column for use by sync adapters. String SYNC4 Generic column for use by sync adapters.","String DATA1 Generic data column, the meaning is MIMETYPE specific","String DATA10 Generic data column, the meaning is MIMETYPE specific","String DATA11 Generic data column, the meaning is MIMETYPE specific","String DATA12 Generic data column, the meaning is MIMETYPE specific","String DATA13 Generic data column, the meaning is MIMETYPE specific","String DATA14 Generic data column, the meaning is MIMETYPE specific","String DATA15 Generic data column, the meaning is MIMETYPE specific.","String DATA2 Generic data column, the meaning is MIMETYPE specific","String DATA3 Generic data column, the meaning is MIMETYPE specific","String DATA4 Generic data column, the meaning is MIMETYPE specific","String DATA5 Generic data column, the meaning is MIMETYPE specific","String DATA6 Generic data column, the meaning is MIMETYPE specific","String DATA7 Generic data column, the meaning is MIMETYPE specific","String DATA8 Generic data column, the meaning is MIMETYPE specific","String DATA9 Generic data column, the meaning is MIMETYPE specific","String DATA_VERSION The version of this data record.","String IS_PRIMARY Whether this is the primary entry of its kind for the raw contact it belongs to.","String IS_READ_ONLY The \"read-only\" flag: \"0\" by default, \"1\" if the row cannot be modified or deleted except by a sync adapter.","String IS_SUPER_PRIMARY Whether this is the primary entry of its kind for the aggregate contact it belongs to.","String MIMETYPE The MIME type of the item represented by this row.","String RAW_CONTACT_ID A reference to the _ID that this data belongs to.","String RES_PACKAGE The package name to use when creating Resources objects for this data row.","String SYNC1 Generic column for use by sync adapters.","String SYNC2 Generic column for use by sync adapters.","String SYNC3 Generic column for use by sync adapters.","String SYNC4 Generic column for use by sync adapters."],"class":"ContactsContract.RawContacts.Data","constructors":[],"fields":[]}