{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ATTACH_IMAGE Starts an Activity that lets the user pick a contact to attach an image to.","String CONTACTS_DATABASE_CREATED This is the intent that is fired when the contacts database is created.","String EXTRA_CREATE_DESCRIPTION Used with SHOW_OR_CREATE_CONTACT to specify an exact description to be shown when prompting user about creating a new contact.","String EXTRA_FORCE_CREATE Used with SHOW_OR_CREATE_CONTACT to force creating a new contact if no matching contact found.","String INVITE_CONTACT This is the intent that is fired when the user clicks the \"invite to the network\" button on a contact.","String SEARCH_SUGGESTION_CLICKED This is the intent that is fired when a search suggestion is clicked on.","String SEARCH_SUGGESTION_CREATE_CONTACT_CLICKED This is the intent that is fired when a search suggestion for creating a contact is clicked on.","String SEARCH_SUGGESTION_DIAL_NUMBER_CLICKED This is the intent that is fired when a search suggestion for dialing a number is clicked on.","String SHOW_OR_CREATE_CONTACT Takes as input a data URI with a mailto: or tel: scheme."],"class":"ContactsContract.Intents","constructors":[],"fields":[]}