{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","int getAccuracy() Returns a constant indicating desired accuracy of location Accuracy may be ACCURACY_FINE if desired location is fine, else it can be ACCURACY_COARSE.","int getBearingAccuracy() Returns a constant indicating the desired bearing accuracy.","int getHorizontalAccuracy() Returns a constant indicating the desired horizontal accuracy (latitude and longitude).","int getPowerRequirement() Returns a constant indicating the desired power requirement.","int getSpeedAccuracy() Returns a constant indicating the desired speed accuracy Accuracy may be ACCURACY_LOW, ACCURACY_HIGH, or NO_REQUIREMENT.","int getVerticalAccuracy() Returns a constant indicating the desired vertical accuracy (altitude).","boolean isAltitudeRequired() Returns whether the provider must provide altitude information.","boolean isBearingRequired() Returns whether the provider must provide bearing information.","boolean isCostAllowed() Returns whether the provider is allowed to incur monetary cost.","boolean isSpeedRequired() Returns whether the provider must provide speed information.","void setAccuracy(int accuracy) Indicates the desired accuracy for latitude and longitude.","void setAltitudeRequired(boolean altitudeRequired) Indicates whether the provider must provide altitude information.","void setBearingAccuracy(int accuracy) Indicates the desired bearing accuracy.","void setBearingRequired(boolean bearingRequired) Indicates whether the provider must provide bearing information.","void setCostAllowed(boolean costAllowed) Indicates whether the provider is allowed to incur monetary cost.","void setHorizontalAccuracy(int accuracy) Indicates the desired horizontal accuracy (latitude and longitude).","void setPowerRequirement(int level) Indicates the desired maximum power level.","void setSpeedAccuracy(int accuracy) Indicates the desired speed accuracy.","void setSpeedRequired(boolean speedRequired) Indicates whether the provider must provide speed information.","void setVerticalAccuracy(int accuracy) Indicates the desired vertical accuracy (altitude).","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel parcel, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.location","constants":["int ACCURACY_COARSE A constant indicating an approximate accuracy requirement","int ACCURACY_FINE A constant indicating a finer location accuracy requirement","int ACCURACY_HIGH a constant indicating a high accuracy requirement - may be used for horizontal, altitude, speed or bearing accuracy.","int ACCURACY_LOW A constant indicating a low location accuracy requirement - may be used for horizontal, altitude, speed or bearing accuracy.","int ACCURACY_MEDIUM A constant indicating a medium accuracy requirement - currently used only for horizontal accuracy.","int NO_REQUIREMENT A constant indicating that the application does not choose to place requirement on a particular feature.","int POWER_HIGH A constant indicating a high power requirement.","int POWER_LOW A constant indicating a low power requirement.","int POWER_MEDIUM A constant indicating a medium power requirement.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"Criteria","constructors":[],"fields":["public static final Creator<Criteria> CREATOR"]}