{"methods":["boolean allocRow() Allocates a new row at the end of this cursor window.","void clear() Clears out the existing contents of the window, making it safe to reuse for new data.","void copyStringToBuffer(int row, int column, CharArrayBuffer buffer) Copies the text of the field at the specified row and column index into a CharArrayBuffer.","int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","void freeLastRow() Frees the last row in this cursor window.","byte[] getBlob(int row, int column) Gets the value of the field at the specified row and column index as a byte array.","double getDouble(int row, int column) Gets the value of the field at the specified row and column index as a double.","float getFloat(int row, int column) Gets the value of the field at the specified row and column index as a float.","int getInt(int row, int column) Gets the value of the field at the specified row and column index as an int.","long getLong(int row, int column) Gets the value of the field at the specified row and column index as a long.","int getNumRows() Gets the number of rows in this window.","short getShort(int row, int column) Gets the value of the field at the specified row and column index as a short.","int getStartPosition() Gets the start position of this cursor window.","String getString(int row, int column) Gets the value of the field at the specified row and column index as a string.","int getType(int row, int column) Returns the type of the field at the specified row and column index.","boolean isBlob(int row, int column) This method was deprecated in API level 11. Use getType(int, int) instead.","boolean isFloat(int row, int column) This method was deprecated in API level 11. Use getType(int, int) instead.","boolean isLong(int row, int column) This method was deprecated in API level 11. Use getType(int, int) instead.","boolean isNull(int row, int column) This method was deprecated in API level 11. Use getType(int, int) instead.","boolean isString(int row, int column) This method was deprecated in API level 11. Use getType(int, int) instead.","static CursorWindow newFromParcel(Parcel p)","boolean putBlob(byte[] value, int row, int column) Copies a byte array into the field at the specified row and column index.","boolean putDouble(double value, int row, int column) Puts a double-precision floating point value into the field at the specified row and column index.","boolean putLong(long value, int row, int column) Puts a long integer into the field at the specified row and column index.","boolean putNull(int row, int column) Puts a null value into the field at the specified row and column index.","boolean putString(String value, int row, int column) Copies a string into the field at the specified row and column index.","boolean setNumColumns(int columnNum) Sets the number of columns in this window.","void setStartPosition(int pos) Sets the start position of this cursor window.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close().","[Expand] Inherited Methods","From class android.database.sqlite.SQLiteClosable void acquireReference() Acquires a reference to the object. void close() Releases a reference to the object, closing the object if the last reference was released. abstract void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close(). void onAllReferencesReleasedFromContainer() This method was deprecated in API level 16. Do not use. void releaseReference() Releases a reference to the object, closing the object if the last reference was released. void releaseReferenceFromContainer() This method was deprecated in API level 16. Do not use.","void acquireReference() Acquires a reference to the object.","void close() Releases a reference to the object, closing the object if the last reference was released.","abstract void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close().","void onAllReferencesReleasedFromContainer() This method was deprecated in API level 16. Do not use.","void releaseReference() Releases a reference to the object, closing the object if the last reference was released.","void releaseReferenceFromContainer() This method was deprecated in API level 16. Do not use.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"android.database","constants":["[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"CursorWindow","constructors":[],"fields":["public static final Creator<CursorWindow> CREATOR"]}