{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","RectF getCharacterBounds(int index) Returns a new instance of RectF that indicates the location of the character specified with the index.","int getCharacterBoundsFlags(int index) Returns the flags associated with the character bounds specified with the index.","CharSequence getComposingText() Returns the entire composing text.","int getComposingTextStart() Returns the index where the composing text starts.","float getInsertionMarkerBaseline() Returns the vertical baseline position of the insertion marker, in the local coordinates that will be transformed with getMatrix() when rendered on the screen.","float getInsertionMarkerBottom() Returns the vertical bottom position of the insertion marker, in the local coordinates that will be transformed with getMatrix() when rendered on the screen.","int getInsertionMarkerFlags() Returns the flag of the insertion marker.","float getInsertionMarkerHorizontal() Returns the horizontal start of the insertion marker, in the local coordinates that will be transformed with getMatrix() when rendered on the screen.","float getInsertionMarkerTop() Returns the vertical top position of the insertion marker, in the local coordinates that will be transformed with getMatrix() when rendered on the screen.","Matrix getMatrix() Returns a new instance of Matrix that indicates the transformation matrix that is to be applied other positional data in this class.","int getSelectionEnd() Returns the index where the selection ends.","int getSelectionStart() Returns the index where the selection starts.","int hashCode() Returns an integer hash code for this object.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Used to package this object into a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.view.inputmethod","constants":["int FLAG_HAS_INVISIBLE_REGION Flag for getInsertionMarkerFlags() and getCharacterBoundsFlags(int): the insertion marker or character bounds have at least one invisible (clipped) region.","int FLAG_HAS_VISIBLE_REGION Flag for getInsertionMarkerFlags() and getCharacterBoundsFlags(int): the insertion marker or character bounds have at least one visible region.","int FLAG_IS_RTL Flag for getInsertionMarkerFlags() and getCharacterBoundsFlags(int): the insertion marker or character bounds is placed at right-to-left (RTL) character.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"CursorAnchorInfo","constructors":[],"fields":["public static final Creator<CursorAnchorInfo> CREATOR Used to make this class parcelable."]}