{"methods":["static ArrayList<DataMap> arrayListFromBundleArrayList(ArrayList<Bundle> bundleArrayList) Returns an ArrayList of DataMaps from an ArrayList of Bundles.","void clear() Removes all elements from the mapping of this DataMap.","boolean containsKey(String key) Returns true if the given key is contained in the mapping of this DataMap.","boolean equals(Object o) Returns true if the given Object is a DataMap equivalent to this one.","static DataMap fromBundle(Bundle bundle) Returns a DataMap from a Bundle.","static DataMap fromByteArray(byte[] bytes) Returns a DataMap from a byte[].","<T> T get(String key) Returns the entry with the given key as an object.","Asset getAsset(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","boolean getBoolean(String key) Returns the value associated with the given key, or false if no mapping of the desired type exists for the given key.","boolean getBoolean(String key, boolean defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","byte getByte(String key) Returns the value associated with the given key, or (byte) 0 if no mapping of the desired type exists for the given key.","byte getByte(String key, byte defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","byte[] getByteArray(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","DataMap getDataMap(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","ArrayList<DataMap> getDataMapArrayList(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","double getDouble(String key) Returns the value associated with the given key, or 0.0 if no mapping of the desired type exists for the given key.","double getDouble(String key, double defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","float getFloat(String key) Returns the value associated with the given key, or 0.0f if no mapping of the desired type exists for the given key.","float getFloat(String key, float defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","float[] getFloatArray(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","int getInt(String key, int defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","int getInt(String key) Returns the value associated with the given key, or 0 if no mapping of the desired type exists for the given key.","ArrayList<Integer> getIntegerArrayList(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","long getLong(String key) Returns the value associated with the given key, or 0L if no mapping of the desired type exists for the given key.","long getLong(String key, long defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","long[] getLongArray(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","String getString(String key, String defaultValue) Returns the value associated with the given key, or defaultValue if no mapping of the desired type exists for the given key.","String getString(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","String[] getStringArray(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","ArrayList<String> getStringArrayList(String key) Returns the value associated with the given key, or null if no mapping of the desired type exists for the given key or a null value is explicitly associated with the key.","int hashCode()","boolean isEmpty() Returns true if the mapping of this DataMap is empty, false otherwise.","Set<String> keySet() Returns a Set containing the Strings used as keys in this DataMap.","void putAll(DataMap dataMap) Inserts all mappings from the given DataMap into this DataMap.","void putAsset(String key, Asset value) Inserts an Asset into the mapping of this DataMap, replacing any existing Asset for the given key.","void putBoolean(String key, boolean value) Inserts a Boolean value into the mapping of this DataMap, replacing any existing value for the given key.","void putByte(String key, byte value) Inserts a byte value into the mapping of this DataMap, replacing any existing value for the given key.","void putByteArray(String key, byte[] value) Inserts a byte array value into the mapping of this dataMap, replacing any existing value for the given key.","void putDataMap(String key, DataMap value) Inserts a DataMap into the mapping of this DataMap, replacing any existing DataMap for the given key.","void putDataMapArrayList(String key, ArrayList<DataMap> value) Inserts an ArrayList value into the mapping of this DataMap, replacing any existing value for the given key.","void putDouble(String key, double value) Inserts a double value into the mapping of this DataMap, replacing any existing value for the given key.","void putFloat(String key, float value) Inserts a float value into the mapping of this dataMap, replacing any existing value for the given key.","void putFloatArray(String key, float[] value) Inserts a float array value into the mapping of this dataMap, replacing any existing value for the given key.","void putInt(String key, int value) Inserts an int value into the mapping of this DataMap, replacing any existing value for the given key.","void putIntegerArrayList(String key, ArrayList<Integer> value) Inserts an ArrayList value into the mapping of this dataMap, replacing any existing value for the given key.","void putLong(String key, long value) Inserts a long value into the mapping of this DataMap, replacing any existing value for the given key.","void putLongArray(String key, long[] value) Inserts a long array value into the mapping of this dataMap, replacing any existing value for the given key.","void putString(String key, String value) Inserts a String value into the mapping of this DataMap, replacing any existing value for the given key.","void putStringArray(String key, String[] value) Inserts a String array value into the mapping of this dataMap, replacing any existing value for the given key.","void putStringArrayList(String key, ArrayList<String> value) Inserts an ArrayList value into the mapping of this dataMap, replacing any existing value for the given key.","Object remove(String key) Removes any entry with the given key from the mapping of this dataMap.","int size() Returns the number of key-value pairs in this map.","Bundle toBundle() Returns a Bundle containing all the elements on this DataMap.","byte[] toByteArray() Returns a serialized byte[] representing this DataMap.","String toString()","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.wearable","constants":["String TAG"],"class":"DataMap","constructors":[],"fields":[]}