{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.datatype","constants":["int APRIL Value for fourth month of year.","int AUGUST Value for eighth month of year.","int DECEMBER Value for twelve month of year.","int EQUAL Comparison result.","int FEBRUARY Value for second month of year.","int FIELD_UNDEFINED Designation that an \"int\" field is not set.","int GREATER Comparison result.","int INDETERMINATE Comparison result.","int JANUARY Value for first month of year.","int JULY Value for seventh month of year.","int JUNE Value for sixth month of year.","int LESSER Comparison result.","int MARCH Value for third month of year.","int MAX_TIMEZONE_OFFSET W3C XML Schema max timezone offset is -14:00.","int MAY Value for fifth month of year.","int MIN_TIMEZONE_OFFSET W3C XML Schema min timezone offset is +14:00.","int NOVEMBER Value for eleven month of year.","int OCTOBER Value for tenth month of year.","int SEPTEMBER Value for ninth month of year."],"class":"DatatypeConstants","constructors":[],"fields":["public static final QName DATE Fully qualified name for W3C XML Schema 1.0 datatype date.","public static final QName DATETIME Fully qualified name for W3C XML Schema 1.0 datatype dateTime.","public static final DatatypeConstants.Field DAYS A constant that represents the days field.","public static final QName DURATION Fully qualified name for W3C XML Schema datatype duration.","public static final QName DURATION_DAYTIME Fully qualified name for XQuery 1.0 and XPath 2.0 datatype dayTimeDuration.","public static final QName DURATION_YEARMONTH Fully qualified name for XQuery 1.0 and XPath 2.0 datatype yearMonthDuration.","public static final QName GDAY Fully qualified name for W3C XML Schema 1.0 datatype gDay.","public static final QName GMONTH Fully qualified name for W3C XML Schema 1.0 datatype gMonth.","public static final QName GMONTHDAY Fully qualified name for W3C XML Schema 1.0 datatype gMonthDay.","public static final QName GYEAR Fully qualified name for W3C XML Schema 1.0 datatype gYear.","public static final QName GYEARMONTH Fully qualified name for W3C XML Schema 1.0 datatype gYearMonth.","public static final DatatypeConstants.Field HOURS A constant that represents the hours field.","public static final DatatypeConstants.Field MINUTES A constant that represents the minutes field.","public static final DatatypeConstants.Field MONTHS A constant that represents the months field.","public static final DatatypeConstants.Field SECONDS A constant that represents the seconds field.","public static final QName TIME Fully qualified name for W3C XML Schema 1.0 datatype time.","public static final DatatypeConstants.Field YEARS A constant that represents the years field."]}