{"methods":["abstract Connection getConnection() Creates a connection to the database represented by this DataSource.","abstract Connection getConnection(String theUsername, String thePassword) Creates a connection to the database represented by this DataSource, using the supplied user name and password.","[Expand] Inherited Methods","From interface java.sql.Wrapper abstract boolean isWrapperFor(Class<?> iface) If the caller is a wrapper of the class or implements the given interface, the methods return false and vice versa. abstract <T> T unwrap(Class<T> iface) Returns an object that implements the given interface.","abstract boolean isWrapperFor(Class<?> iface) If the caller is a wrapper of the class or implements the given interface, the methods return false and vice versa.","abstract <T> T unwrap(Class<T> iface) Returns an object that implements the given interface.","From interface javax.sql.CommonDataSource abstract PrintWriter getLogWriter() Retrieves a log writer which is a character output stream to which all logging and tracing messages for this data source will be printed. abstract int getLoginTimeout() While attempting to connect to a database, this method get the maximum time in seconds that this data source can wait. abstract void setLogWriter(PrintWriter out) Set a log writer which is a character output stream to which all logging and tracing messages for this data source will be printed. abstract void setLoginTimeout(int seconds) While attempting to connect to a database, this method set the maximum time in seconds that this data source can wait.","abstract PrintWriter getLogWriter() Retrieves a log writer which is a character output stream to which all logging and tracing messages for this data source will be printed.","abstract int getLoginTimeout() While attempting to connect to a database, this method get the maximum time in seconds that this data source can wait.","abstract void setLogWriter(PrintWriter out) Set a log writer which is a character output stream to which all logging and tracing messages for this data source will be printed.","abstract void setLoginTimeout(int seconds) While attempting to connect to a database, this method set the maximum time in seconds that this data source can wait."],"package":"javax.sql","constants":[],"class":"DataSource","constructors":[],"fields":[]}