{"methods":["synchronized InetAddress getAddress() Gets the sender or destination IP address of this datagram packet.","synchronized byte[] getData() Gets the data of this datagram packet.","synchronized int getLength() Gets the length of the data stored in this datagram packet.","synchronized int getOffset() Gets the offset of the data stored in this datagram packet.","synchronized int getPort() Gets the port number of the target or sender host of this datagram packet.","synchronized SocketAddress getSocketAddress() Gets the host address and the port to which this datagram packet is sent as a SocketAddress object.","synchronized void setAddress(InetAddress addr) Sets the IP address of the target host.","synchronized void setData(byte[] buf) Sets the data buffer for this datagram packet.","synchronized void setData(byte[] data, int offset, int byteCount) Sets the data buffer for this datagram packet.","synchronized void setLength(int length) Sets the length of the datagram packet.","synchronized void setPort(int aPort) Sets the port number of the target host of this datagram packet.","synchronized void setSocketAddress(SocketAddress sockAddr) Sets the SocketAddress for this datagram packet.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"DatagramPacket","constructors":[],"fields":[]}