{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.fitness.data","constants":[],"class":"DataTypes","constructors":[],"fields":["public static final DataType ACTIVITY_SAMPLE In the com.google.activity.sample data type, each data point represents an instantaneous sample of the current activity.","public static final DataType ACTIVITY_SEGMENT In the com.google.activity.segment data type, each data point represents a continuous time interval with a single activity value.","public static final DataType CALORIES_CONSUMED In the com.google.calories.consumed data type, each data point represents the number of calories consumed, in kcal, over the time interval of the data point.","public static final DataType CALORIES_EXPENDED In the com.google.calories.expended data type, each data point represents the number of calories expended, in kcal, over the time interval of the data point.","public static final DataType CYCLING_PEDALING_CADENCE In the com.google.cycling,cadence data type, each data point represents an instantaneous measurement of the pedaling rate in crank revolutions per minute.","public static final DataType CYCLING_PEDALING_CUMULATIVE In the com.google.cycling.pedaling.cumulative data type, each data point represents the number of rotations taken from the start of the count.","public static final DataType CYCLING_WHEEL_REVOLUTION In the com.google.cycling.wheel_revolution.cumulative data type, each data point represents the number of revolutions taken from the start of the count.","public static final DataType CYCLING_WHEEL_RPM In the com.google.cycling.wheel.revolutions data type, each data point represents an instantaneous measurement of the wheel in revolutions per minute.","public static final DataType DISTANCE_DELTA In the com.google.distance.delta data type, each data point represents the distance covered, in meters, since the last reading.","public static final DataType HEART_RATE_BPM In the com.google.heart_rate.bpm data type, each data point represents an instantaneous measurement of the heart rate in beats per minute.","public static final DataType HEIGHT In the com.google.height data type, each data point represents the height of the user at the time of the reading, in meters.","public static final DataType LOCATION_SAMPLE In the com.google.location.sample data type, each data point represents the user's location at a given instant.","public static final DataType POWER_SAMPLE In the com.google.power.sample data type, each data point represents an instantaneous measurement of power in watts.","public static final DataType SPEED In the com.google.speed data type, each data point represents the instantaneous speed over ground, in meters/second.","public static final DataType STEP_COUNT_CADENCE In the com.google.step_count.cadence data type, each data point represents an instantaneous measurement of the cadence in steps per minute.","public static final DataType STEP_COUNT_DELTA In the com.google.step_count.delta data type, each data point represents the number of steps taken since the last reading.","public static final DataType WEIGHT In the com.google.weight data type, each data point represents the weight of the user at the time of the reading, in kilograms."]}