{"methods":["Object clone() Creates and returns a copy of this Object.","boolean equals(Object object) Compares this object with the specified object and indicates if they are equal.","String[] getAmPmStrings() Returns the array of strings which represent AM and PM.","static Locale[] getAvailableLocales() Returns an array of locales for which custom DateFormatSymbols instances are available.","String[] getEras() Returns the array of strings which represent BC and AD.","final static DateFormatSymbols getInstance() Returns a new DateFormatSymbols instance for the user's default locale.","final static DateFormatSymbols getInstance(Locale locale) Returns a new DateFormatSymbols for the given locale.","String getLocalPatternChars() Returns the pattern characters used by SimpleDateFormat to specify date and time fields.","String[] getMonths() Returns the array of strings containing the full names of the months.","String[] getShortMonths() Returns the array of strings containing the abbreviated names of the months.","String[] getShortWeekdays() Returns the array of strings containing the abbreviated names of the days of the week.","String[] getWeekdays() Returns the array of strings containing the full names of the days of the week.","String[][] getZoneStrings() Returns the two-dimensional array of strings containing localized names for time zones.","int hashCode() Returns an integer hash code for this object.","void setAmPmStrings(String[] data) Sets the array of strings which represent AM and PM.","void setEras(String[] data) Sets the array of Strings which represent BC and AD.","void setLocalPatternChars(String data) Sets the pattern characters used by SimpleDateFormat to specify date and time fields.","void setMonths(String[] data) Sets the array of strings containing the full names of the months.","void setShortMonths(String[] data) Sets the array of strings containing the abbreviated names of the months.","void setShortWeekdays(String[] data) Sets the array of strings containing the abbreviated names of the days of the week.","void setWeekdays(String[] data) Sets the array of strings containing the full names of the days of the week.","void setZoneStrings(String[][] zoneStrings) Sets the two-dimensional array of strings containing localized names for time zones.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.text","constants":[],"class":"DateFormatSymbols","constructors":[],"fields":[]}