{"methods":["int getCalendarField() Returns the Calendar field that this field represents.","static DateFormat.Field ofCalendarField(int calendarField) Returns the DateFormat.Field instance for the given calendar field.","[Expand] Inherited Methods","From class java.text.AttributedCharacterIterator.Attribute final boolean equals(Object object) Compares this attribute with the specified object. String getName() Returns the name of this attribute. final int hashCode() Calculates the hash code for objects of type Attribute. Object readResolve() Resolves a deserialized instance to the correct constant attribute. String toString() Returns the name of the class followed by a \"(\", the name of the attribute, and a \")\".","final boolean equals(Object object) Compares this attribute with the specified object.","String getName() Returns the name of this attribute.","final int hashCode() Calculates the hash code for objects of type Attribute.","Object readResolve() Resolves a deserialized instance to the correct constant attribute.","String toString() Returns the name of the class followed by a \"(\", the name of the attribute, and a \")\".","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.text","constants":[],"class":"DateFormat.Field","constructors":[],"fields":["public static final DateFormat.Field AM_PM Marks the time indicator part of a date.","public static final DateFormat.Field DAY_OF_MONTH Marks the day of the month part of a date.","public static final DateFormat.Field DAY_OF_WEEK Marks the day of the week part of a date.","public static final DateFormat.Field DAY_OF_WEEK_IN_MONTH Marks the day of the week in the month part of a date.","public static final DateFormat.Field DAY_OF_YEAR Marks the day of the year part of a date.","public static final DateFormat.Field ERA Marks the era part of a date.","public static final DateFormat.Field HOUR0 Marks the hour part of a date (0-11).","public static final DateFormat.Field HOUR1 Marks the hour part of a date (1-12).","public static final DateFormat.Field HOUR_OF_DAY0 Marks the hour of the day part of a date (0-11).","public static final DateFormat.Field HOUR_OF_DAY1 Marks the hour of the day part of a date (1-12).","public static final DateFormat.Field MILLISECOND Marks the millisecond part of a time.","public static final DateFormat.Field MINUTE Marks the minute part of a time.","public static final DateFormat.Field MONTH Marks the month part of a date.","public static final DateFormat.Field SECOND Marks the second part of a time.","public static final DateFormat.Field TIME_ZONE Marks the time zone part of a date.","public static final DateFormat.Field WEEK_OF_MONTH Marks the week of the month part of a date.","public static final DateFormat.Field WEEK_OF_YEAR Marks the week of the year part of a date.","public static final DateFormat.Field YEAR Marks the year part of a date."]}