{"methods":["HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request.","HttpRequest createConnectRequest(HttpRoute route, HttpContext context) Creates the CONNECT request for tunnelling.","boolean createTunnelToProxy(HttpRoute route, int hop, HttpContext context) Creates a tunnel to an intermediate proxy.","boolean createTunnelToTarget(HttpRoute route, HttpContext context) Creates a tunnel to the target server.","HttpRoute determineRoute(HttpHost target, HttpRequest request, HttpContext context) Determines the route for a request.","void establishRoute(HttpRoute route, HttpContext context) Establishes the target route.","RoutedRequest handleResponse(RoutedRequest roureq, HttpResponse response, HttpContext context) Analyzes a response to check need for a followup.","void releaseConnection() Returns the connection back to the connection manager and prepares for retrieving a new connection during the next request.","void rewriteRequestURI(RequestWrapper request, HttpRoute route)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.client.RequestDirector abstract HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request.","abstract HttpResponse execute(HttpHost target, HttpRequest request, HttpContext context) Executes a request."],"package":"org.apache.http.impl.client","constants":[],"class":"DefaultRequestDirector","constructors":[],"fields":["protected final ClientConnectionManager connManager The connection manager.","protected final HttpProcessor httpProcessor The HTTP protocol processor.","protected final ConnectionKeepAliveStrategy keepAliveStrategy The keep-alive duration strategy.","protected ManagedClientConnection managedConn The currently allocated connection.","protected final HttpParams params The HTTP parameters.","protected final RedirectHandler redirectHandler The redirect handler.","protected final HttpRequestExecutor requestExec The request executor.","protected final HttpRequestRetryHandler retryHandler The request retry handler.","protected final ConnectionReuseStrategy reuseStrategy The connection re-use strategy.","protected final HttpRoutePlanner routePlanner The route planner."]}