{"methods":["final void addAction(int pos, Action action) Add an Action to the overview at the specified position.","final void addAction(Action action) Add an Action to the overview.","final List<Action> getActions() Gets a read-only view of the list of Actions of this details overview.","final Drawable getImageDrawable() Gets the image drawable of this details overview.","final Object getItem() Gets the main item for the details page.","boolean isImageScaleUpAllowed() Returns true if the image may be scaled up; false otherwise.","final boolean removeAction(Action action) Remove the given Action from the overview.","final void setImageBitmap(Context context, Bitmap bm) Sets a Bitmap as the image of this details overview.","final void setImageDrawable(Drawable drawable) Sets a drawable as the image of this details overview.","void setImageScaleUpAllowed(boolean allowed) Allows or disallows scaling up of images.","[Expand] Inherited Methods","From class android.support.v17.leanback.widget.Row final HeaderItem getHeaderItem() Get the HeaderItem that represents metadata for the row. final long getId() Returns a unique identifier for this row. final void setHeaderItem(HeaderItem headerItem) Set the HeaderItem that represents metadata for the row. final void setId(long id) Set the id for this row.","final HeaderItem getHeaderItem() Get the HeaderItem that represents metadata for the row.","final long getId() Returns a unique identifier for this row.","final void setHeaderItem(HeaderItem headerItem) Set the HeaderItem that represents metadata for the row.","final void setId(long id) Set the id for this row.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v17.leanback.widget","constants":[],"class":"DetailsOverviewRow","constructors":[],"fields":[]}