{"methods":["VirtualDisplay createVirtualDisplay(String name, int width, int height, int densityDpi, Surface surface, int flags, VirtualDisplay.Callback callback, Handler handler) Creates a virtual display.","VirtualDisplay createVirtualDisplay(String name, int width, int height, int densityDpi, Surface surface, int flags) Creates a virtual display.","Display getDisplay(int displayId) Gets information about a logical display.","Display[] getDisplays() Gets all currently valid logical displays.","Display[] getDisplays(String category) Gets all currently valid logical displays of the specified category.","void registerDisplayListener(DisplayManager.DisplayListener listener, Handler handler) Registers an display listener to receive notifications about when displays are added, removed or changed.","void unregisterDisplayListener(DisplayManager.DisplayListener listener) Unregisters a display listener.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware.display","constants":["String DISPLAY_CATEGORY_PRESENTATION Display category: Presentation displays.","int VIRTUAL_DISPLAY_FLAG_AUTO_MIRROR Virtual display flag: Allows content to be mirrored on private displays when no content is being shown.","int VIRTUAL_DISPLAY_FLAG_OWN_CONTENT_ONLY Virtual display flag: Only show this display's own content; do not mirror the content of another display.","int VIRTUAL_DISPLAY_FLAG_PRESENTATION Virtual display flag: Create a presentation display.","int VIRTUAL_DISPLAY_FLAG_PUBLIC Virtual display flag: Create a public display.","int VIRTUAL_DISPLAY_FLAG_SECURE Virtual display flag: Create a secure display."],"class":"DisplayManager","constructors":[],"fields":[]}