{"methods":["long getAppVsyncOffsetNanos() Gets the app VSYNC offset, in nanoseconds.","void getCurrentSizeRange(Point outSmallestSize, Point outLargestSize) Return the range of display sizes an application can expect to encounter under normal operation, as long as there is no physical change in screen size.","int getDisplayId() Gets the display id.","int getFlags() Returns a combination of flags that describe the capabilities of the display.","int getHeight() This method was deprecated in API level 13. Use getSize(Point) instead.","void getMetrics(DisplayMetrics outMetrics) Gets display metrics that describe the size and density of this display.","String getName() Gets the name of the display.","int getOrientation() This method was deprecated in API level 8. use getRotation()","int getPixelFormat() This method was deprecated in API level 17. This method is no longer supported. The result is always RGBA_8888.","long getPresentationDeadlineNanos() This is how far in advance a buffer must be queued for presentation at a given time.","void getRealMetrics(DisplayMetrics outMetrics) Gets display metrics based on the real size of this display.","void getRealSize(Point outSize) Gets the real size of the display without subtracting any window decor or applying any compatibility scale factors.","void getRectSize(Rect outSize) Gets the size of the display as a rectangle, in pixels.","float getRefreshRate() Gets the refresh rate of this display in frames per second.","int getRotation() Returns the rotation of the screen from its \"natural\" orientation.","void getSize(Point outSize) Gets the size of the display, in pixels.","int getState() Gets the state of the display, such as whether it is on or off.","float[] getSupportedRefreshRates() Get the supported refresh rates of this display in frames per second.","int getWidth() This method was deprecated in API level 13. Use getSize(Point) instead.","boolean isValid() Returns true if this display is still valid, false if the display has been removed.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":["int DEFAULT_DISPLAY The default Display id, which is the id of the built-in primary display assuming there is one.","int FLAG_PRESENTATION Display flag: Indicates that the display is a presentation display.","int FLAG_PRIVATE Display flag: Indicates that the display is private.","int FLAG_SECURE Display flag: Indicates that the display has a secure video output and supports compositing secure surfaces.","int FLAG_SUPPORTS_PROTECTED_BUFFERS Display flag: Indicates that the display supports compositing content that is stored in protected graphics buffers.","int STATE_DOZE Display state: The display is dozing in a low power state; it is still on but is optimized for showing system-provided content while the device is non-interactive.","int STATE_DOZE_SUSPEND Display state: The display is dozing in a suspended low power state; it is still on but is optimized for showing static system-provided content while the device is non-interactive.","int STATE_OFF Display state: The display is off.","int STATE_ON Display state: The display is on.","int STATE_UNKNOWN Display state: The display state is unknown."],"class":"Display","constructors":[],"fields":[]}