{"methods":["boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","boolean equals(DisplayMetrics other) Returns true if these display metrics equal the other display metrics.","int hashCode() Returns an integer hash code for this object.","void setTo(DisplayMetrics o)","void setToDefaults()","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.util","constants":["int DENSITY_400 Intermediate density for screens that sit somewhere between DENSITY_XHIGH (320 dpi) and DENSITY_XXHIGH (480 dpi).","int DENSITY_560 Intermediate density for screens that sit somewhere between DENSITY_XXHIGH (480 dpi) and DENSITY_XXXHIGH (640 dpi).","int DENSITY_DEFAULT The reference density used throughout the system.","int DENSITY_HIGH Standard quantized DPI for high-density screens.","int DENSITY_LOW Standard quantized DPI for low-density screens.","int DENSITY_MEDIUM Standard quantized DPI for medium-density screens.","int DENSITY_TV This is a secondary density, added for some common screen configurations.","int DENSITY_XHIGH Standard quantized DPI for extra-high-density screens.","int DENSITY_XXHIGH Standard quantized DPI for extra-extra-high-density screens.","int DENSITY_XXXHIGH Standard quantized DPI for extra-extra-extra-high-density screens."],"class":"DisplayMetrics","constructors":[],"fields":["public float density The logical density of the display.","public int densityDpi The screen density expressed as dots-per-inch.","public int heightPixels The absolute height of the display in pixels.","public float scaledDensity A scaling factor for fonts displayed on the display.","public int widthPixels The absolute width of the display in pixels.","public float xdpi The exact physical pixels per inch of the screen in the X dimension.","public float ydpi The exact physical pixels per inch of the screen in the Y dimension."]}