{"methods":["static Uri buildChildDocumentsUri(String authority, String parentDocumentId) Build URI representing the children of the target directory in a document provider.","static Uri buildChildDocumentsUriUsingTree(Uri treeUri, String parentDocumentId) Build URI representing the children of the target directory in a document provider.","static Uri buildDocumentUri(String authority, String documentId) Build URI representing the target COLUMN_DOCUMENT_ID in a document provider.","static Uri buildDocumentUriUsingTree(Uri treeUri, String documentId) Build URI representing the target COLUMN_DOCUMENT_ID in a document provider.","static Uri buildRecentDocumentsUri(String authority, String rootId) Build URI representing the recently modified documents of a specific root in a document provider.","static Uri buildRootUri(String authority, String rootId) Build URI representing the given COLUMN_ROOT_ID in a document provider.","static Uri buildRootsUri(String authority) Build URI representing the roots of a document provider.","static Uri buildSearchDocumentsUri(String authority, String rootId, String query) Build URI representing a search for matching documents under a specific root in a document provider.","static Uri buildTreeDocumentUri(String authority, String documentId) Build URI representing access to descendant documents of the given COLUMN_DOCUMENT_ID.","static Uri createDocument(ContentResolver resolver, Uri parentDocumentUri, String mimeType, String displayName) Create a new document with given MIME type and display name.","static boolean deleteDocument(ContentResolver resolver, Uri documentUri) Delete the given document.","static String getDocumentId(Uri documentUri) Extract the COLUMN_DOCUMENT_ID from the given URI.","static Bitmap getDocumentThumbnail(ContentResolver resolver, Uri documentUri, Point size, CancellationSignal signal) Return thumbnail representing the document at the given URI.","static String getRootId(Uri rootUri) Extract the COLUMN_ROOT_ID from the given URI.","static String getSearchDocumentsQuery(Uri searchDocumentsUri) Extract the search query from a URI built by buildSearchDocumentsUri(String, String, String).","static String getTreeDocumentId(Uri documentUri) Extract the via COLUMN_DOCUMENT_ID from the given URI.","static boolean isDocumentUri(Context context, Uri uri) Test if the given URI represents a DocumentsContract.Document backed by a DocumentsProvider.","static Uri renameDocument(ContentResolver resolver, Uri documentUri, String displayName) Change the display name of an existing document.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String EXTRA_ERROR Optional string included in a directory getExtras() providing an error message that should be shown to a user.","String EXTRA_INFO Optional string included in a directory getExtras() providing an informational message that should be shown to a user.","String EXTRA_LOADING Optional boolean flag included in a directory getExtras() indicating that a document provider is still loading data.","String PROVIDER_INTERFACE Intent action used to identify DocumentsProvider instances."],"class":"DocumentsContract","constructors":[],"fields":[]}