{"methods":["abstract boolean canRead() Indicates whether the current context is allowed to read from this file.","abstract boolean canWrite() Indicates whether the current context is allowed to write to this file.","abstract DocumentFile createDirectory(String displayName) Create a new directory as a direct child of this directory.","abstract DocumentFile createFile(String mimeType, String displayName) Create a new document as a direct child of this directory.","abstract boolean delete() Deletes this file.","abstract boolean exists() Returns a boolean indicating whether this file can be found.","DocumentFile findFile(String displayName) Search through listFiles() for the first document matching the given display name.","static DocumentFile fromFile(File file) Create a DocumentFile representing the filesystem tree rooted at the given Uri.","static DocumentFile fromSingleUri(Context context, Uri singleUri) Create a DocumentFile representing the single document at the given Uri.","static DocumentFile fromTreeUri(Context context, Uri treeUri) Create a DocumentFile representing the document tree rooted at the given Uri.","abstract String getName() Return the display name of this document.","DocumentFile getParentFile() Return the parent file of this document.","abstract String getType() Return the MIME type of this document.","abstract Uri getUri() Return a Uri for the underlying document represented by this file.","abstract boolean isDirectory() Indicates if this file represents a directory.","static boolean isDocumentUri(Context context, Uri uri) Test if given Uri is backed by a DocumentsProvider.","abstract boolean isFile() Indicates if this file represents a file.","abstract long lastModified() Returns the time when this file was last modified, measured in milliseconds since January 1st, 1970, midnight.","abstract long length() Returns the length of this file in bytes.","abstract DocumentFile[] listFiles() Returns an array of files contained in the directory represented by this file.","abstract boolean renameTo(String displayName) Renames this file to displayName.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.provider","constants":[],"class":"DocumentFile","constructors":[],"fields":[]}