{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String COLUMN_AVAILABLE_BYTES Number of bytes available in this root.","String COLUMN_DOCUMENT_ID Document which is a directory that represents the top directory of this root.","String COLUMN_FLAGS Flags that apply to a root.","String COLUMN_ICON Icon resource ID for a root.","String COLUMN_MIME_TYPES MIME types supported by this root.","String COLUMN_ROOT_ID Unique ID of a root.","String COLUMN_SUMMARY Summary for this root, which may be shown to a user.","String COLUMN_TITLE Title for a root, which will be shown to a user.","int FLAG_LOCAL_ONLY Flag indicating that this root offers content that is strictly local on the device.","int FLAG_SUPPORTS_CREATE Flag indicating that at least one directory under this root supports creating content.","int FLAG_SUPPORTS_IS_CHILD Flag indicating that this root supports testing parent child relationships.","int FLAG_SUPPORTS_RECENTS Flag indicating that this root can be queried to provide recently modified documents.","int FLAG_SUPPORTS_SEARCH Flag indicating that this root supports search."],"class":"DocumentsContract.Root","constructors":[],"fields":[]}