{"methods":["DownloadManager.Request addRequestHeader(String header, String value) Add an HTTP header to be included with the download request.","void allowScanningByMediaScanner() If the file to be downloaded is to be scanned by MediaScanner, this method should be called before enqueue(Request) is called.","DownloadManager.Request setAllowedNetworkTypes(int flags) Restrict the types of networks over which this download may proceed.","DownloadManager.Request setAllowedOverMetered(boolean allow) Set whether this download may proceed over a metered network connection.","DownloadManager.Request setAllowedOverRoaming(boolean allowed) Set whether this download may proceed over a roaming connection.","DownloadManager.Request setDescription(CharSequence description) Set a description of this download, to be displayed in notifications (if enabled)","DownloadManager.Request setDestinationInExternalFilesDir(Context context, String dirType, String subPath) Set the local destination for the downloaded file to a path within the application's external files directory (as returned by getExternalFilesDir(String).","DownloadManager.Request setDestinationInExternalPublicDir(String dirType, String subPath) Set the local destination for the downloaded file to a path within the public external storage directory (as returned by getExternalStoragePublicDirectory(String)).","DownloadManager.Request setDestinationUri(Uri uri) Set the local destination for the downloaded file.","DownloadManager.Request setMimeType(String mimeType) Set the MIME content type of this download.","DownloadManager.Request setNotificationVisibility(int visibility) Control whether a system notification is posted by the download manager while this download is running or when it is completed.","DownloadManager.Request setShowRunningNotification(boolean show) This method was deprecated in API level 11. use setNotificationVisibility(int)","DownloadManager.Request setTitle(CharSequence title) Set the title of this download, to be displayed in notifications (if enabled).","DownloadManager.Request setVisibleInDownloadsUi(boolean isVisible) Set whether this download should be displayed in the system's Downloads UI.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["int NETWORK_MOBILE Bit flag for setAllowedNetworkTypes(int) corresponding to TYPE_MOBILE.","int NETWORK_WIFI Bit flag for setAllowedNetworkTypes(int) corresponding to TYPE_WIFI.","int VISIBILITY_HIDDEN This download doesn't show in the UI or in the notifications.","int VISIBILITY_VISIBLE This download is visible but only shows in the notifications while it's in progress.","int VISIBILITY_VISIBLE_NOTIFY_COMPLETED This download is visible and shows in the notifications while in progress and after completion.","int VISIBILITY_VISIBLE_NOTIFY_ONLY_COMPLETION This download shows in the notifications after completion ONLY."],"class":"DownloadManager.Request","constructors":[],"fields":[]}