{"methods":["long addCompletedDownload(String title, String description, boolean isMediaScannerScannable, String mimeType, String path, long length, boolean showNotification) Adds a file to the downloads database system, so it could appear in Downloads App (and thus become eligible for management by the Downloads App).","long enqueue(DownloadManager.Request request) Enqueue a new download.","static Long getMaxBytesOverMobile(Context context) Returns maximum size, in bytes, of downloads that may go over a mobile connection; or null if there's no limit","String getMimeTypeForDownloadedFile(long id) Returns the media type of the given downloaded file id, if the file was downloaded successfully.","static Long getRecommendedMaxBytesOverMobile(Context context) Returns recommended maximum size, in bytes, of downloads that may go over a mobile connection; or null if there's no recommended limit.","Uri getUriForDownloadedFile(long id) Returns the Uri of the given downloaded file id, if the file is downloaded successfully.","ParcelFileDescriptor openDownloadedFile(long id) Open a downloaded file for reading.","Cursor query(DownloadManager.Query query) Query the download manager about downloads that have been requested.","int remove(long... ids) Cancel downloads and remove them from the download manager.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["String ACTION_DOWNLOAD_COMPLETE Broadcast intent action sent by the download manager when a download completes.","String ACTION_NOTIFICATION_CLICKED Broadcast intent action sent by the download manager when the user clicks on a running download, either from a system notification or from the downloads UI.","String ACTION_VIEW_DOWNLOADS Intent action to launch an activity to display all downloads.","String COLUMN_BYTES_DOWNLOADED_SO_FAR Number of bytes download so far.","String COLUMN_DESCRIPTION The client-supplied description of this download.","String COLUMN_ID An identifier for a particular download, unique across the system.","String COLUMN_LAST_MODIFIED_TIMESTAMP Timestamp when the download was last modified, in System.currentTimeMillis() (wall clock time in UTC).","String COLUMN_LOCAL_FILENAME The pathname of the file where the download is stored.","String COLUMN_LOCAL_URI Uri where downloaded file will be stored.","String COLUMN_MEDIAPROVIDER_URI The URI to the corresponding entry in MediaProvider for this downloaded entry.","String COLUMN_MEDIA_TYPE Internet Media Type of the downloaded file.","String COLUMN_REASON Provides more detail on the status of the download.","String COLUMN_STATUS Current status of the download, as one of the STATUS_* constants.","String COLUMN_TITLE The client-supplied title for this download.","String COLUMN_TOTAL_SIZE_BYTES Total size of the download in bytes.","String COLUMN_URI URI to be downloaded.","int ERROR_CANNOT_RESUME Value of COLUMN_REASON when some possibly transient error occurred but we can't resume the download.","int ERROR_DEVICE_NOT_FOUND Value of COLUMN_REASON when no external storage device was found.","int ERROR_FILE_ALREADY_EXISTS Value of COLUMN_REASON when the requested destination file already exists (the download manager will not overwrite an existing file).","int ERROR_FILE_ERROR Value of COLUMN_REASON when a storage issue arises which doesn't fit under any other error code.","int ERROR_HTTP_DATA_ERROR Value of COLUMN_REASON when an error receiving or processing data occurred at the HTTP level.","int ERROR_INSUFFICIENT_SPACE Value of COLUMN_REASON when there was insufficient storage space.","int ERROR_TOO_MANY_REDIRECTS Value of COLUMN_REASON when there were too many redirects.","int ERROR_UNHANDLED_HTTP_CODE Value of COLUMN_REASON when an HTTP code was received that download manager can't handle.","int ERROR_UNKNOWN Value of COLUMN_ERROR_CODE when the download has completed with an error that doesn't fit under any other error code.","String EXTRA_DOWNLOAD_ID Intent extra included with ACTION_DOWNLOAD_COMPLETE intents, indicating the ID (as a long) of the download that just completed.","String EXTRA_NOTIFICATION_CLICK_DOWNLOAD_IDS When clicks on multiple notifications are received, the following provides an array of download ids corresponding to the download notification that was clicked.","String INTENT_EXTRAS_SORT_BY_SIZE Intent extra included with ACTION_VIEW_DOWNLOADS to start DownloadApp in sort-by-size mode.","int PAUSED_QUEUED_FOR_WIFI Value of COLUMN_REASON when the download exceeds a size limit for downloads over the mobile network and the download manager is waiting for a Wi-Fi connection to proceed.","int PAUSED_UNKNOWN Value of COLUMN_REASON when the download is paused for some other reason.","int PAUSED_WAITING_FOR_NETWORK Value of COLUMN_REASON when the download is waiting for network connectivity to proceed.","int PAUSED_WAITING_TO_RETRY Value of COLUMN_REASON when the download is paused because some network error occurred and the download manager is waiting before retrying the request.","int STATUS_FAILED Value of COLUMN_STATUS when the download has failed (and will not be retried).","int STATUS_PAUSED Value of COLUMN_STATUS when the download is waiting to retry or resume.","int STATUS_PENDING Value of COLUMN_STATUS when the download is waiting to start.","int STATUS_RUNNING Value of COLUMN_STATUS when the download is currently running.","int STATUS_SUCCESSFUL Value of COLUMN_STATUS when the download has successfully completed."],"class":"DownloadManager","constructors":[],"fields":[]}