{"methods":["int describeContents() Returns information about the Parcel representation of this DragEvent object.","int getAction() Inspect the action value of this event.","ClipData getClipData() Returns the ClipData object sent to the system as part of the call to startDrag().","ClipDescription getClipDescription() Returns the ClipDescription object contained in the ClipData object sent to the system as part of the call to startDrag().","Object getLocalState() Returns the local state object sent to the system as part of the call to startDrag().","boolean getResult() Returns an indication of the result of the drag and drop operation.","float getX() Gets the X coordinate of the drag point.","float getY() Gets the Y coordinate of the drag point.","String toString() Returns a string containing a concise, human-readable representation of this DragEvent object.","void writeToParcel(Parcel dest, int flags) Creates a Parcel object from this DragEvent object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.view","constants":["int ACTION_DRAG_ENDED Action constant returned by getAction(): Signals to a View that the drag and drop operation has concluded.","int ACTION_DRAG_ENTERED Action constant returned by getAction(): Signals to a View that the drag point has entered the bounding box of the View.","int ACTION_DRAG_EXITED Action constant returned by getAction(): Signals that the user has moved the drag shadow outside the bounding box of the View.","int ACTION_DRAG_LOCATION Action constant returned by getAction(): Sent to a View after ACTION_DRAG_ENTERED if the drag shadow is still within the View object's bounding box.","int ACTION_DRAG_STARTED Action constant returned by getAction(): Signals the start of a drag and drop operation.","int ACTION_DROP Action constant returned by getAction(): Signals to a View that the user has released the drag shadow, and the drag point is within the bounding box of the View.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"DragEvent","constructors":[],"fields":["public static final Creator<DragEvent> CREATOR A container for creating a DragEvent from a Parcel."]}