{"methods":["final int addChild(Drawable dr)","boolean canApplyTheme() Return whether this constant state can have a theme applied.","synchronized boolean canConstantState()","int getChangingConfigurations() Return a bit mask of configuration changes that will impact this drawable (and thus require completely reloading it).","final Drawable getChild(int index)","final int getChildCount()","final Drawable[] getChildren()","final int getConstantHeight()","final int getConstantMinimumHeight()","final int getConstantMinimumWidth()","final Rect getConstantPadding()","final int getConstantWidth()","final int getEnterFadeDuration()","final int getExitFadeDuration()","final int getOpacity()","void growArray(int oldSize, int newSize)","final boolean isConstantSize()","final boolean isStateful()","final void setConstantSize(boolean constant)","final void setEnterFadeDuration(int duration)","final void setExitFadeDuration(int duration)","final void setVariablePadding(boolean variable) A boolean value indicating whether to use the maximum padding value of all frames in the set (false), or to use the padding value of the frame being shown (true).","void computeConstantSize()","[Expand] Inherited Methods","From class android.graphics.drawable.Drawable.ConstantState boolean canApplyTheme() Return whether this constant state can have a theme applied. abstract int getChangingConfigurations() Return a bit mask of configuration changes that will impact this drawable (and thus require completely reloading it). abstract Drawable newDrawable() Create a new drawable without supplying resources the caller is running in. Drawable newDrawable(Resources res) Create a new Drawable instance from its constant state. Drawable newDrawable(Resources res, Resources.Theme theme) Create a new Drawable instance from its constant state.","boolean canApplyTheme() Return whether this constant state can have a theme applied.","abstract int getChangingConfigurations() Return a bit mask of configuration changes that will impact this drawable (and thus require completely reloading it).","abstract Drawable newDrawable() Create a new drawable without supplying resources the caller is running in.","Drawable newDrawable(Resources res) Create a new Drawable instance from its constant state.","Drawable newDrawable(Resources res, Resources.Theme theme) Create a new Drawable instance from its constant state.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics.drawable","constants":[],"class":"DrawableContainer.DrawableContainerState","constructors":[],"fields":[]}