{"methods":["int getColumnNumber() Return the column number where the current document event ends.","ContentHandler getContentHandler() Return the current content handler.","DTDHandler getDTDHandler() Return the current DTD handler.","EntityResolver getEntityResolver() Return the current entity resolver.","ErrorHandler getErrorHandler() Return the current error handler.","boolean getFeature(String name) Look up the value of a feature flag.","int getIndex(String qName) Look up the index of an attribute by XML qualified (prefixed) name.","int getIndex(String uri, String localName) Look up the index of an attribute by Namespace name.","int getLength() Return the number of attributes in the list.","int getLineNumber() Return the line number where the current document event ends.","String getLocalName(int index) Look up an attribute's local name by index.","Object getProperty(String name) Look up the value of a property.","String getPublicId() Return the public identifier for the current document event.","String getQName(int index) Look up an attribute's XML qualified (prefixed) name by index.","String getSystemId() Return the system identifier for the current document event.","String getType(String qName) Look up an attribute's type by XML qualified (prefixed) name.","String getType(String uri, String localName) Look up an attribute's type by Namespace name.","String getType(int index) Look up an attribute's type by index.","String getURI(int index) Look up an attribute's Namespace URI by index.","String getValue(String qName) Look up an attribute's value by XML qualified (prefixed) name.","String getValue(String uri, String localName) Look up an attribute's value by Namespace name.","String getValue(int index) Look up an attribute's value by index.","void parse(String systemId) Parse an XML document from a system identifier (URI).","void parse(InputSource source) Parse an XML document.","void parseSubTree(XmlPullParser pp)","void setContentHandler(ContentHandler handler) Allow an application to register a content event handler.","void setDTDHandler(DTDHandler handler) Allow an application to register a DTD event handler.","void setEntityResolver(EntityResolver resolver) Allow an application to register an entity resolver.","void setErrorHandler(ErrorHandler handler) Allow an application to register an error event handler.","void setFeature(String name, boolean value) Set the value of a feature flag.","void setProperty(String name, Object value) Set the value of a property.","void startElement(String namespace, String localName, String qName) Calls startElement on the ContentHandler with this driver object as the Attributes implementation.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.Attributes abstract int getIndex(String uri, String localName) Look up the index of an attribute by Namespace name. abstract int getIndex(String qName) Look up the index of an attribute by XML qualified (prefixed) name. abstract int getLength() Return the number of attributes in the list. abstract String getLocalName(int index) Look up an attribute's local name by index. abstract String getQName(int index) Look up an attribute's XML qualified (prefixed) name by index. abstract String getType(String qName) Look up an attribute's type by XML qualified (prefixed) name. abstract String getType(String uri, String localName) Look up an attribute's type by Namespace name. abstract String getType(int index) Look up an attribute's type by index. abstract String getURI(int index) Look up an attribute's Namespace URI by index. abstract String getValue(String qName) Look up an attribute's value by XML qualified (prefixed) name. abstract String getValue(String uri, String localName) Look up an attribute's value by Namespace name. abstract String getValue(int index) Look up an attribute's value by index.","abstract int getIndex(String uri, String localName) Look up the index of an attribute by Namespace name.","abstract int getIndex(String qName) Look up the index of an attribute by XML qualified (prefixed) name.","abstract int getLength() Return the number of attributes in the list.","abstract String getLocalName(int index) Look up an attribute's local name by index.","abstract String getQName(int index) Look up an attribute's XML qualified (prefixed) name by index.","abstract String getType(String qName) Look up an attribute's type by XML qualified (prefixed) name.","abstract String getType(String uri, String localName) Look up an attribute's type by Namespace name.","abstract String getType(int index) Look up an attribute's type by index.","abstract String getURI(int index) Look up an attribute's Namespace URI by index.","abstract String getValue(String qName) Look up an attribute's value by XML qualified (prefixed) name.","abstract String getValue(String uri, String localName) Look up an attribute's value by Namespace name.","abstract String getValue(int index) Look up an attribute's value by index.","From interface org.xml.sax.Locator abstract int getColumnNumber() Return the column number where the current document event ends. abstract int getLineNumber() Return the line number where the current document event ends. abstract String getPublicId() Return the public identifier for the current document event. abstract String getSystemId() Return the system identifier for the current document event.","abstract int getColumnNumber() Return the column number where the current document event ends.","abstract int getLineNumber() Return the line number where the current document event ends.","abstract String getPublicId() Return the public identifier for the current document event.","abstract String getSystemId() Return the system identifier for the current document event.","From interface org.xml.sax.XMLReader abstract ContentHandler getContentHandler() Return the current content handler. abstract DTDHandler getDTDHandler() Return the current DTD handler. abstract EntityResolver getEntityResolver() Return the current entity resolver. abstract ErrorHandler getErrorHandler() Return the current error handler. abstract boolean getFeature(String name) Look up the value of a feature flag. abstract Object getProperty(String name) Look up the value of a property. abstract void parse(String systemId) Parse an XML document from a system identifier (URI). abstract void parse(InputSource input) Parse an XML document. abstract void setContentHandler(ContentHandler handler) Allow an application to register a content event handler. abstract void setDTDHandler(DTDHandler handler) Allow an application to register a DTD event handler. abstract void setEntityResolver(EntityResolver resolver) Allow an application to register an entity resolver. abstract void setErrorHandler(ErrorHandler handler) Allow an application to register an error event handler. abstract void setFeature(String name, boolean value) Set the value of a feature flag. abstract void setProperty(String name, Object value) Set the value of a property.","abstract ContentHandler getContentHandler() Return the current content handler.","abstract DTDHandler getDTDHandler() Return the current DTD handler.","abstract EntityResolver getEntityResolver() Return the current entity resolver.","abstract ErrorHandler getErrorHandler() Return the current error handler.","abstract boolean getFeature(String name) Look up the value of a feature flag.","abstract Object getProperty(String name) Look up the value of a property.","abstract void parse(String systemId) Parse an XML document from a system identifier (URI).","abstract void parse(InputSource input) Parse an XML document.","abstract void setContentHandler(ContentHandler handler) Allow an application to register a content event handler.","abstract void setDTDHandler(DTDHandler handler) Allow an application to register a DTD event handler.","abstract void setEntityResolver(EntityResolver resolver) Allow an application to register an entity resolver.","abstract void setErrorHandler(ErrorHandler handler) Allow an application to register an error event handler.","abstract void setFeature(String name, boolean value) Set the value of a feature flag.","abstract void setProperty(String name, Object value) Set the value of a property."],"package":"org.xmlpull.v1.sax2","constants":["String APACHE_DYNAMIC_VALIDATION_FEATURE","String APACHE_SCHEMA_VALIDATION_FEATURE","String DECLARATION_HANDLER_PROPERTY","String LEXICAL_HANDLER_PROPERTY","String NAMESPACES_FEATURE","String NAMESPACE_PREFIXES_FEATURE","String VALIDATION_FEATURE"],"class":"Driver","constructors":[],"fields":["protected ContentHandler contentHandler","protected ErrorHandler errorHandler","protected XmlPullParser pp","protected String systemId"]}