{"methods":["static void deregisterDriver(Driver driver) Removes a driver from the DriverManager's registered driver list.","static Connection getConnection(String url, Properties info) Attempts to establish a connection to the given database URL.","static Connection getConnection(String url, String user, String password) Attempts to establish a connection to the given database URL.","static Connection getConnection(String url) Attempts to establish a connection to the given database URL.","static Driver getDriver(String url) Tries to find a driver that can interpret the supplied URL.","static Enumeration<Driver> getDrivers() Returns an Enumeration that contains all of the loaded JDBC drivers that the current caller can access.","static PrintStream getLogStream() This method was deprecated in API level 1. Use getLogWriter() instead.","static PrintWriter getLogWriter() Retrieves the log writer.","static int getLoginTimeout() Returns the login timeout when connecting to a database in seconds.","static void println(String message) Prints a message to the current JDBC log stream.","static void registerDriver(Driver driver) Registers a given JDBC driver with the DriverManager.","static void setLogStream(PrintStream out) This method was deprecated in API level 1. Use setLogWriter(PrintWriter) instead.","static void setLogWriter(PrintWriter out) Sets the PrintWriter that is used by all loaded drivers, and also the DriverManager.","static void setLoginTimeout(int seconds) Sets the login timeout when connecting to a database in seconds.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.sql","constants":[],"class":"DriverManager","constructors":[],"fields":[]}