{"methods":["abstract PendingResult<Status> discardContents(GoogleApiClient apiClient, Contents contents) This method is deprecated. Stop using Contents and use DriveContents and discard(GoogleApiClient) instead.","abstract PendingResult<DriveApi.DriveIdResult> fetchDriveId(GoogleApiClient apiClient, String resourceId) Retrieves a DriveId object that can be used in further drive api operations (e.g.","abstract DriveFolder getAppFolder(GoogleApiClient apiClient) Retrieves a DriveFolder object that can be used to interact with the App Folder.","abstract DriveFile getFile(GoogleApiClient apiClient, DriveId id) Retrieves a DriveFile object that can be used to interact with the file specified by the provided DriveId.","abstract DriveFolder getFolder(GoogleApiClient apiClient, DriveId id) Retrieves a DriveFolder object that can be used to interact with the folder specified by the provided DriveId.","abstract DriveFolder getRootFolder(GoogleApiClient apiClient) Retrieves a DriveFolder object that can be used to interact with the root folder.","abstract PendingResult<DriveApi.ContentsResult> newContents(GoogleApiClient apiClient) This method is deprecated. Use newDriveContents(GoogleApiClient) instead.","abstract CreateFileActivityBuilder newCreateFileActivityBuilder() Creates a builder for a Create File activity where a user can select a file name and destination for a new binary file in their Drive with the contents and additional metadata provided in the builder.","abstract PendingResult<DriveApi.DriveContentsResult> newDriveContents(GoogleApiClient apiClient) Retrieves a new DriveContents instance that can be used to provide initial contents for a new file.","abstract OpenFileActivityBuilder newOpenFileActivityBuilder() Creates a builder for an Open File activity that allows user selection of a Drive file.","abstract PendingResult<DriveApi.MetadataBufferResult> query(GoogleApiClient apiClient, Query query) Retrieves a collection of metadata for the files and folders that match the specified query.","abstract PendingResult<Status> requestSync(GoogleApiClient apiClient) Requests synchronization a PendingResult that is ready when synchronization has completed."],"package":"com.google.android.gms.drive","constants":[],"class":"DriveApi","constructors":[],"fields":[]}