{"methods":["abstract PendingResult<DriveFolder.DriveFileResult> createFile(GoogleApiClient apiClient, MetadataChangeSet changeSet, DriveContents driveContents, ExecutionOptions executionOptions) Creates a new binary file within this folder, with the provided initial metadata and DriveContents.","abstract PendingResult<DriveFolder.DriveFileResult> createFile(GoogleApiClient apiClient, MetadataChangeSet changeSet, Contents contents) This method is deprecated. use createFile(GoogleApiClient, MetadataChangeSet, DriveContents) instead.","abstract PendingResult<DriveFolder.DriveFileResult> createFile(GoogleApiClient apiClient, MetadataChangeSet changeSet, DriveContents driveContents) Creates a new binary file within this folder, with the provided initial metadata and DriveContents.","abstract PendingResult<DriveFolder.DriveFolderResult> createFolder(GoogleApiClient apiClient, MetadataChangeSet changeSet) Creates a new folder within this folder, with the provided initial metadata.","abstract PendingResult<DriveApi.MetadataBufferResult> listChildren(GoogleApiClient apiClient) Retrieves a collection of metadata for the direct children of this folder.","abstract PendingResult<DriveApi.MetadataBufferResult> queryChildren(GoogleApiClient apiClient, Query query) Retrieves a collection of metadata for the all authorized direct children of this folder.","[Expand] Inherited Methods","From interface com.google.android.gms.drive.DriveResource abstract PendingResult<Status> addChangeListener(GoogleApiClient apiClient, ChangeListener listener) Adds a new listener for changes on this resource. abstract PendingResult<Status> addChangeListener(GoogleApiClient apiClient, Listener<ChangeEvent> listener) This method is deprecated. Use addChangeListener(GoogleApiClient, ChangeListener) abstract PendingResult<Status> addChangeSubscription(GoogleApiClient apiClient) Adds a change subscription for this resource that will deliver events to the application event service. abstract DriveId getDriveId() Returns the DriveId that uniquely identifies this resource. abstract PendingResult<DriveResource.MetadataResult> getMetadata(GoogleApiClient apiClient) Retrieves the Metadata associated with this resource. abstract PendingResult<DriveApi.MetadataBufferResult> listParents(GoogleApiClient apiClient) Retrieves a collection of metadata for all of the parents of this resource that the calling app has been authorized to view. abstract PendingResult<Status> removeChangeListener(GoogleApiClient apiClient, Listener<ChangeEvent> listener) This method is deprecated. Use removeChangeListener(GoogleApiClient, ChangeListener) abstract PendingResult<Status> removeChangeListener(GoogleApiClient apiClient, ChangeListener listener) Removes a listener for changes on this resource that was previously added by addChangeListener(GoogleApiClient, ChangeListener). abstract PendingResult<Status> removeChangeSubscription(GoogleApiClient apiClient) Removes any existing change subscription for this resource. abstract PendingResult<Status> setParents(GoogleApiClient apiClient, Set<DriveId> parentIds) Sets the parents of this resource. abstract PendingResult<DriveResource.MetadataResult> updateMetadata(GoogleApiClient apiClient, MetadataChangeSet changeSet) Updates the Metadata that is associated with this resource with the changes described in the MetadataChangeSet.","abstract PendingResult<Status> addChangeListener(GoogleApiClient apiClient, ChangeListener listener) Adds a new listener for changes on this resource.","abstract PendingResult<Status> addChangeListener(GoogleApiClient apiClient, Listener<ChangeEvent> listener) This method is deprecated. Use addChangeListener(GoogleApiClient, ChangeListener)","abstract PendingResult<Status> addChangeSubscription(GoogleApiClient apiClient) Adds a change subscription for this resource that will deliver events to the application event service.","abstract DriveId getDriveId() Returns the DriveId that uniquely identifies this resource.","abstract PendingResult<DriveResource.MetadataResult> getMetadata(GoogleApiClient apiClient) Retrieves the Metadata associated with this resource.","abstract PendingResult<DriveApi.MetadataBufferResult> listParents(GoogleApiClient apiClient) Retrieves a collection of metadata for all of the parents of this resource that the calling app has been authorized to view.","abstract PendingResult<Status> removeChangeListener(GoogleApiClient apiClient, Listener<ChangeEvent> listener) This method is deprecated. Use removeChangeListener(GoogleApiClient, ChangeListener)","abstract PendingResult<Status> removeChangeListener(GoogleApiClient apiClient, ChangeListener listener) Removes a listener for changes on this resource that was previously added by addChangeListener(GoogleApiClient, ChangeListener).","abstract PendingResult<Status> removeChangeSubscription(GoogleApiClient apiClient) Removes any existing change subscription for this resource.","abstract PendingResult<Status> setParents(GoogleApiClient apiClient, Set<DriveId> parentIds) Sets the parents of this resource.","abstract PendingResult<DriveResource.MetadataResult> updateMetadata(GoogleApiClient apiClient, MetadataChangeSet changeSet) Updates the Metadata that is associated with this resource with the changes described in the MetadataChangeSet."],"package":"com.google.android.gms.drive","constants":["String MIME_TYPE The MIME type associated with folder resources."],"class":"DriveFolder","constructors":[],"fields":[]}