{"methods":["Object get(String key) Retrieves the value of a given key.","int getInfoType() Retrieves the information type associated with this object.","String getMimeType() Retrieves the MIME type associated with this object.","Iterator<Object> iterator() Retrieves an iterator object that you can use to iterate over the values associated with this DrmInfoRequest object.","Iterator<String> keyIterator() Retrieves an iterator object that you can use to iterate over the keys associated with this DrmInfoRequest object.","void put(String key, Object value) Adds optional information as key-value pairs to this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.drm","constants":["String ACCOUNT_ID Key that is used to pass the unique session ID for the account or the user.","String SUBSCRIPTION_ID Key that is used to pass the unique session ID for the subscription.","int TYPE_REGISTRATION_INFO Acquires DRM server registration information.","int TYPE_RIGHTS_ACQUISITION_INFO Acquires rights information.","int TYPE_RIGHTS_ACQUISITION_PROGRESS_INFO Acquires the progress of the rights acquisition.","int TYPE_UNREGISTRATION_INFO Acquires information for unregistering the DRM server."],"class":"DrmInfoRequest","constructors":[],"fields":[]}