{"methods":["DrmInfo acquireDrmInfo(DrmInfoRequest drmInfoRequest) Retrieves information for registering, unregistering, or acquiring rights.","int acquireRights(DrmInfoRequest drmInfoRequest) Processes a given DrmInfoRequest and returns the rights information asynchronously.","boolean canHandle(Uri uri, String mimeType) Checks whether the given MIME type or URI can be handled.","boolean canHandle(String path, String mimeType) Checks whether the given MIME type or path can be handled.","int checkRightsStatus(String path) Checks whether the given content has valid rights.","int checkRightsStatus(String path, int action) Checks whether the given rights-protected content has valid rights for the specified DrmStore.Action.","int checkRightsStatus(Uri uri, int action) Checks whether the given rights-protected content has valid rights for the specified DrmStore.Action.","int checkRightsStatus(Uri uri) Check whether the given content has valid rights.","DrmConvertedStatus closeConvertSession(int convertId) Informs the DRM plug-in (agent) that there is no more data to convert or that an error has occurred.","DrmConvertedStatus convertData(int convertId, byte[] inputData) Converts the input data (content) that is part of a rights-protected file.","String[] getAvailableDrmEngines() Retrieves information about all the DRM plug-ins (agents) that are registered with the DRM framework.","ContentValues getConstraints(String path, int action) Retrieves constraint information for rights-protected content.","ContentValues getConstraints(Uri uri, int action) Retrieves constraint information for rights-protected content.","int getDrmObjectType(Uri uri, String mimeType) Retrieves the type of rights-protected object (for example, content object, rights object, and so on) using the specified URI or MIME type.","int getDrmObjectType(String path, String mimeType) Retrieves the type of rights-protected object (for example, content object, rights object, and so on) using the specified path or MIME type.","ContentValues getMetadata(Uri uri) Retrieves metadata information for rights-protected content.","ContentValues getMetadata(String path) Retrieves metadata information for rights-protected content.","String getOriginalMimeType(String path) Retrieves the MIME type embedded in the original content.","String getOriginalMimeType(Uri uri) Retrieves the MIME type embedded in the original content.","int openConvertSession(String mimeType) Initiates a new conversion session.","int processDrmInfo(DrmInfo drmInfo) Processes the given DRM information based on the information type.","void release() Releases resources associated with the current session of DrmManagerClient.","int removeAllRights() Removes all the rights information of every DRM plug-in (agent) associated with the DRM framework.","int removeRights(String path) Removes the rights associated with the given rights-protected content.","int removeRights(Uri uri) Removes the rights associated with the given rights-protected content.","int saveRights(DrmRights drmRights, String rightsPath, String contentPath) Saves rights to a specified path and associates that path with the content path.","synchronized void setOnErrorListener(DrmManagerClient.OnErrorListener errorListener) Registers an DrmManagerClient.OnErrorListener callback, which is invoked when the DRM framework sends error information.","synchronized void setOnEventListener(DrmManagerClient.OnEventListener eventListener) Registers an DrmManagerClient.OnEventListener callback, which is invoked when the DRM framework sends information about DRM processing.","synchronized void setOnInfoListener(DrmManagerClient.OnInfoListener infoListener) Registers an DrmManagerClient.OnInfoListener callback, which is invoked when the DRM framework sends status or warning information during registration or rights acquisition.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.drm","constants":["int ERROR_NONE Indicates that a request was successful or that no error occurred.","int ERROR_UNKNOWN Indicates that an error occurred and the reason is not known."],"class":"DrmManagerClient","constructors":[],"fields":[]}