{"methods":["void addData(String tag, byte[] data, int flags) Stores binary data, which may be ignored or discarded as with addText(String, String).","void addFile(String tag, File file, int flags) Stores the contents of a file, which may be ignored or discarded as with addText(String, String).","void addText(String tag, String data) Stores human-readable text.","DropBoxManager.Entry getNextEntry(String tag, long msec) Gets the next entry from the drop box after the specified time.","boolean isTagEnabled(String tag) Checks any blacklists (set in system settings) to see whether a certain tag is allowed.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":["String ACTION_DROPBOX_ENTRY_ADDED Broadcast Action: This is broadcast when a new entry is added in the dropbox.","String EXTRA_TAG Extra for ACTION_DROPBOX_ENTRY_ADDED: string containing the dropbox tag.","String EXTRA_TIME Extra for ACTION_DROPBOX_ENTRY_ADDED: long integer value containing time (in milliseconds since January 1, 1970 00:00:00 UTC) when the entry was created.","int IS_EMPTY Flag value: Entry's content was deleted to save space.","int IS_GZIPPED Flag value: Content can be decompressed with GZIPOutputStream.","int IS_TEXT Flag value: Content is human-readable UTF-8 text (can be combined with IS_GZIPPED)."],"class":"DropBoxManager","constructors":[],"fields":[]}