{"methods":["abstract Duration add(Duration rhs) Computes a new duration whose value is this+rhs.","abstract void addTo(Calendar calendar) Adds this duration to a Calendar object.","void addTo(Date date) Adds this duration to a Date object.","abstract int compare(Duration duration) Partial order relation comparison with this Duration instance.","boolean equals(Object duration) Checks if this duration object has the same duration as another Duration object.","int getDays() Obtains the value of the DAYS field as an integer value, or 0 if not present.","abstract Number getField(DatatypeConstants.Field field) Gets the value of a field.","int getHours() Obtains the value of the HOURS field as an integer value, or 0 if not present.","int getMinutes() Obtains the value of the MINUTES field as an integer value, or 0 if not present.","int getMonths() Obtains the value of the MONTHS field as an integer value, or 0 if not present.","int getSeconds() Obtains the value of the SECONDS field as an integer value, or 0 if not present.","abstract int getSign() Returns the sign of this duration in -1,0, or 1.","long getTimeInMillis(Calendar startInstant) Returns the length of the duration in milliseconds.","long getTimeInMillis(Date startInstant) Returns the length of the duration in milliseconds.","QName getXMLSchemaType() Return the name of the XML Schema date/time type that this instance maps to.","int getYears() Get the years value of this Duration as an int or 0 if not present.","abstract int hashCode() Returns a hash code consistent with the definition of the equals method.","boolean isLongerThan(Duration duration) Checks if this duration object is strictly longer than another Duration object.","abstract boolean isSet(DatatypeConstants.Field field) Checks if a field is set.","boolean isShorterThan(Duration duration) Checks if this duration object is strictly shorter than another Duration object.","Duration multiply(int factor) Computes a new duration whose value is factor times longer than the value of this duration.","abstract Duration multiply(BigDecimal factor) Computes a new duration whose value is factor times longer than the value of this duration.","abstract Duration negate() Returns a new Duration object whose value is -this.","abstract Duration normalizeWith(Calendar startTimeInstant) Converts the years and months fields into the days field by using a specific time instant as the reference point.","Duration subtract(Duration rhs) Computes a new duration whose value is this-rhs.","String toString() Returns a String representation of this Duration Object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.datatype","constants":[],"class":"Duration","constructors":[],"fields":[]}