{"methods":["Effect createEffect(String effectName) Instantiate a new effect with the given effect name.","static boolean isEffectSupported(String effectName) Check if an effect is supported on this platform.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.effect","constants":["String EFFECT_AUTOFIX Attempts to auto-fix the image based on histogram equalization.","String EFFECT_BACKDROPPER Replaces the background of the input frames with frames from a selected video.","String EFFECT_BITMAPOVERLAY Overlays a bitmap (with premultiplied alpha channel) onto the input image.","String EFFECT_BLACKWHITE Adjusts the range of minimal and maximal color pixel intensities.","String EFFECT_BRIGHTNESS Adjusts the brightness of the image.","String EFFECT_CONTRAST Adjusts the contrast of the image.","String EFFECT_CROP Crops an upright rectangular area from the image.","String EFFECT_CROSSPROCESS Applies a cross process effect on image, in which the red and green channels are enhanced while the blue channel is restricted.","String EFFECT_DOCUMENTARY Applies black and white documentary style effect on image..","String EFFECT_DUOTONE Representation of photo using only two color tones.","String EFFECT_FILLLIGHT Applies back-light filling to the image.","String EFFECT_FISHEYE Applies a fisheye lens distortion to the image.","String EFFECT_FLIP Flips image vertically and/or horizontally.","String EFFECT_GRAIN Applies film grain effect to image.","String EFFECT_GRAYSCALE Converts image to grayscale.","String EFFECT_LOMOISH Applies lomo-camera style effect to image.","String EFFECT_NEGATIVE Inverts the image colors.","String EFFECT_POSTERIZE Applies posterization effect to image.","String EFFECT_REDEYE Removes red eyes on specified region.","String EFFECT_ROTATE Rotates the image.","String EFFECT_SATURATE Adjusts color saturation of image.","String EFFECT_SEPIA Converts image to sepia tone.","String EFFECT_SHARPEN Sharpens the image.","String EFFECT_STRAIGHTEN Rotates the image according to the specified angle, and crops the image so that no non-image portions are visible.","String EFFECT_TEMPERATURE Adjusts color temperature of the image.","String EFFECT_TINT Tints the photo with specified color.","String EFFECT_VIGNETTE Adds a vignette effect to image, i.e."],"class":"EffectFactory","constructors":[],"fields":[]}