{"methods":["static <E만xtendsEnum<E>> EnumSet<E> allOf(Class<E> elementType) Creates an enum set filled with all the enum elements of the specified elementType.","EnumSet<E> clone() Creates a new enum set with the same elements as those contained in this enum set.","static <E만xtendsEnum<E>> EnumSet<E> complementOf(EnumSet<E> s) Creates an enum set.","static <E만xtendsEnum<E>> EnumSet<E> copyOf(EnumSet<E> s) Creates an enum set.","static <E만xtendsEnum<E>> EnumSet<E> copyOf(Collection<E> c) Creates an enum set.","static <E만xtendsEnum<E>> EnumSet<E> noneOf(Class<E> elementType) Creates an empty enum set.","static <E만xtendsEnum<E>> EnumSet<E> of(E e1, E e2, E e3, E e4) Creates a new enum set, containing only the specified elements.","static <E만xtendsEnum<E>> EnumSet<E> of(E start, E... others) Creates a new enum set, containing only the specified elements.","static <E만xtendsEnum<E>> EnumSet<E> of(E e) Creates a new enum set, containing only the specified element.","static <E만xtendsEnum<E>> EnumSet<E> of(E e1, E e2) Creates a new enum set, containing only the specified elements.","static <E만xtendsEnum<E>> EnumSet<E> of(E e1, E e2, E e3, E e4, E e5) Creates a new enum set, containing only the specified elements.","static <E만xtendsEnum<E>> EnumSet<E> of(E e1, E e2, E e3) Creates a new enum set, containing only the specified elements.","static <E만xtendsEnum<E>> EnumSet<E> range(E start, E end) Creates an enum set containing all the elements within the range defined by start and end (inclusive).","[Expand] Inherited Methods","From class java.util.AbstractSet boolean equals(Object object) Compares the specified object to this Set and returns true if they are equal. int hashCode() Returns the hash code for this set. boolean removeAll(Collection<?> collection) Removes all occurrences in this collection which are contained in the specified collection.","boolean equals(Object object) Compares the specified object to this Set and returns true if they are equal.","int hashCode() Returns the hash code for this set.","boolean removeAll(Collection<?> collection) Removes all occurrences in this collection which are contained in the specified collection.","From class java.util.AbstractCollection boolean add(E object) Attempts to add object to the contents of this Collection (optional). boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in collection to the contents of this Collection (optional). void clear() Removes all elements from this Collection, leaving it empty (optional). boolean contains(Object object) Tests whether this Collection contains the specified object. boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection. boolean isEmpty() Returns if this Collection contains no elements. abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection. boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional). boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional). boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional). abstract int size() Returns a count of how many objects this Collection contains. <T> T[] toArray(T[] contents) Returns an array containing all elements contained in this Collection. Object[] toArray() Returns a new array containing all elements contained in this Collection. String toString() Returns the string representation of this Collection.","boolean add(E object) Attempts to add object to the contents of this Collection (optional).","boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in collection to the contents of this Collection (optional).","void clear() Removes all elements from this Collection, leaving it empty (optional).","boolean contains(Object object) Tests whether this Collection contains the specified object.","boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection.","boolean isEmpty() Returns if this Collection contains no elements.","abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection.","boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional).","boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional).","boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional).","abstract int size() Returns a count of how many objects this Collection contains.","<T> T[] toArray(T[] contents) Returns an array containing all elements contained in this Collection.","Object[] toArray() Returns a new array containing all elements contained in this Collection.","String toString() Returns the string representation of this Collection.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Iterable abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","From interface java.util.Collection abstract boolean add(E object) Attempts to add object to the contents of this Collection (optional). abstract boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in Collection to the contents of this Collection (optional). abstract void clear() Removes all elements from this Collection, leaving it empty (optional). abstract boolean contains(Object object) Tests whether this Collection contains the specified object. abstract boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection. abstract boolean equals(Object object) Compares the argument to the receiver, and returns true if they represent the same object using a class specific comparison. abstract int hashCode() Returns an integer hash code for the receiver. abstract boolean isEmpty() Returns if this Collection contains no elements. abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection. abstract boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional). abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional). abstract boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional). abstract int size() Returns a count of how many objects this Collection contains. abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this Collection. abstract Object[] toArray() Returns a new array containing all elements contained in this Collection.","abstract boolean add(E object) Attempts to add object to the contents of this Collection (optional).","abstract boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in Collection to the contents of this Collection (optional).","abstract void clear() Removes all elements from this Collection, leaving it empty (optional).","abstract boolean contains(Object object) Tests whether this Collection contains the specified object.","abstract boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection.","abstract boolean equals(Object object) Compares the argument to the receiver, and returns true if they represent the same object using a class specific comparison.","abstract int hashCode() Returns an integer hash code for the receiver.","abstract boolean isEmpty() Returns if this Collection contains no elements.","abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection.","abstract boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional).","abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional).","abstract boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional).","abstract int size() Returns a count of how many objects this Collection contains.","abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this Collection.","abstract Object[] toArray() Returns a new array containing all elements contained in this Collection.","From interface java.util.Set abstract boolean add(E object) Adds the specified object to this set. abstract boolean addAll(Collection<?만xtendsE> collection) Adds the objects in the specified collection which do not exist yet in this set. abstract void clear() Removes all elements from this set, leaving it empty. abstract boolean contains(Object object) Searches this set for the specified object. abstract boolean containsAll(Collection<?> collection) Searches this set for all objects in the specified collection. abstract boolean equals(Object object) Compares the specified object to this set, and returns true if they represent the same object using a class specific comparison. abstract int hashCode() Returns the hash code for this set. abstract boolean isEmpty() Returns true if this set has no elements. abstract Iterator<E> iterator() Returns an iterator on the elements of this set. abstract boolean remove(Object object) Removes the specified object from this set. abstract boolean removeAll(Collection<?> collection) Removes all objects in the specified collection from this set. abstract boolean retainAll(Collection<?> collection) Removes all objects from this set that are not contained in the specified collection. abstract int size() Returns the number of elements in this set. abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this set. abstract Object[] toArray() Returns an array containing all elements contained in this set.","abstract boolean add(E object) Adds the specified object to this set.","abstract boolean addAll(Collection<?만xtendsE> collection) Adds the objects in the specified collection which do not exist yet in this set.","abstract void clear() Removes all elements from this set, leaving it empty.","abstract boolean contains(Object object) Searches this set for the specified object.","abstract boolean containsAll(Collection<?> collection) Searches this set for all objects in the specified collection.","abstract boolean equals(Object object) Compares the specified object to this set, and returns true if they represent the same object using a class specific comparison.","abstract int hashCode() Returns the hash code for this set.","abstract boolean isEmpty() Returns true if this set has no elements.","abstract Iterator<E> iterator() Returns an iterator on the elements of this set.","abstract boolean remove(Object object) Removes the specified object from this set.","abstract boolean removeAll(Collection<?> collection) Removes all objects in the specified collection from this set.","abstract boolean retainAll(Collection<?> collection) Removes all objects from this set that are not contained in the specified collection.","abstract int size() Returns the number of elements in this set.","abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this set.","abstract Object[] toArray() Returns an array containing all elements contained in this set."],"package":"java.util","constants":[],"class":"EnumSet","constructors":[],"fields":[]}