{"methods":["static File getDataDirectory() Return the user data directory.","static File getDownloadCacheDirectory() Return the download/cache content directory.","static File getExternalStorageDirectory() Return the primary external storage directory.","static File getExternalStoragePublicDirectory(String type) Get a top-level public external storage directory for placing files of a particular type.","static String getExternalStorageState(File path) Returns the current state of the storage device that provides the given path.","static String getExternalStorageState() Returns the current state of the primary \"external\" storage device.","static File getRootDirectory() Return root of the \"system\" partition holding the core Android OS.","static String getStorageState(File path) This method was deprecated in API level 21. use getExternalStorageState(File)","static boolean isExternalStorageEmulated() Returns whether the primary \"external\" storage device is emulated.","static boolean isExternalStorageEmulated(File path) Returns whether the storage device that provides the given path is emulated.","static boolean isExternalStorageRemovable(File path) Returns whether the storage device that provides the given path is removable.","static boolean isExternalStorageRemovable() Returns whether the primary \"external\" storage device is removable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":["String MEDIA_BAD_REMOVAL Storage state if the media was removed before it was unmounted.","String MEDIA_CHECKING Storage state if the media is present and being disk-checked.","String MEDIA_MOUNTED Storage state if the media is present and mounted at its mount point with read/write access.","String MEDIA_MOUNTED_READ_ONLY Storage state if the media is present and mounted at its mount point with read-only access.","String MEDIA_NOFS Storage state if the media is present but is blank or is using an unsupported filesystem.","String MEDIA_REMOVED Storage state if the media is not present.","String MEDIA_SHARED Storage state if the media is present not mounted, and shared via USB mass storage.","String MEDIA_UNKNOWN Unknown storage state, such as when a path isn't backed by known storage media.","String MEDIA_UNMOUNTABLE Storage state if the media is present but cannot be mounted.","String MEDIA_UNMOUNTED Storage state if the media is present but not mounted."],"class":"Environment","constructors":[],"fields":["public static String DIRECTORY_ALARMS Standard directory in which to place any audio files that should be in the list of alarms that the user can select (not as regular music).","public static String DIRECTORY_DCIM The traditional location for pictures and videos when mounting the device as a camera.","public static String DIRECTORY_DOCUMENTS Standard directory in which to place documents that have been created by the user.","public static String DIRECTORY_DOWNLOADS Standard directory in which to place files that have been downloaded by the user.","public static String DIRECTORY_MOVIES Standard directory in which to place movies that are available to the user.","public static String DIRECTORY_MUSIC Standard directory in which to place any audio files that should be in the regular list of music for the user.","public static String DIRECTORY_NOTIFICATIONS Standard directory in which to place any audio files that should be in the list of notifications that the user can select (not as regular music).","public static String DIRECTORY_PICTURES Standard directory in which to place pictures that are available to the user.","public static String DIRECTORY_PODCASTS Standard directory in which to place any audio files that should be in the list of podcasts that the user can select (not as regular music).","public static String DIRECTORY_RINGTONES Standard directory in which to place any audio files that should be in the list of ringtones that the user can select (not as regular music)."]}