{"methods":["void abortConnection() Aborts this stream.","int available() Returns an estimated number of bytes that can be read or skipped without blocking for more input.","void close() Closes this stream.","int read(byte[] b) Equivalent to read(buffer, 0, buffer.length).","int read() Reads a single byte from this stream and returns it as an integer in the range from 0 to 255.","int read(byte[] b, int off, int len) Reads up to byteCount bytes from this stream and stores them in the byte array buffer starting at byteOffset.","void releaseConnection() Same as close().","void checkAbort() Detects stream abort and notifies the watcher.","void checkClose() Detects stream close and notifies the watcher.","void checkEOF(int eof) Detects EOF and notifies the watcher.","boolean isReadAllowed() Checks whether the underlying stream can be read from.","[Expand] Inherited Methods","From class java.io.InputStream int available() Returns an estimated number of bytes that can be read or skipped without blocking for more input. void close() Closes this stream. void mark(int readlimit) Sets a mark position in this InputStream. boolean markSupported() Indicates whether this stream supports the mark() and reset() methods. int read(byte[] buffer) Equivalent to read(buffer, 0, buffer.length). abstract int read() Reads a single byte from this stream and returns it as an integer in the range from 0 to 255. int read(byte[] buffer, int byteOffset, int byteCount) Reads up to byteCount bytes from this stream and stores them in the byte array buffer starting at byteOffset. synchronized void reset() Resets this stream to the last marked location. long skip(long byteCount) Skips at most byteCount bytes in this stream.","int available() Returns an estimated number of bytes that can be read or skipped without blocking for more input.","void close() Closes this stream.","void mark(int readlimit) Sets a mark position in this InputStream.","boolean markSupported() Indicates whether this stream supports the mark() and reset() methods.","int read(byte[] buffer) Equivalent to read(buffer, 0, buffer.length).","abstract int read() Reads a single byte from this stream and returns it as an integer in the range from 0 to 255.","int read(byte[] buffer, int byteOffset, int byteCount) Reads up to byteCount bytes from this stream and stores them in the byte array buffer starting at byteOffset.","synchronized void reset() Resets this stream to the last marked location.","long skip(long byteCount) Skips at most byteCount bytes in this stream.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface org.apache.http.conn.ConnectionReleaseTrigger abstract void abortConnection() Releases the connection without the option of keep-alive. abstract void releaseConnection() Releases the connection with the option of keep-alive.","abstract void abortConnection() Releases the connection without the option of keep-alive.","abstract void releaseConnection() Releases the connection with the option of keep-alive."],"package":"org.apache.http.conn","constants":[],"class":"EofSensorInputStream","constructors":[],"fields":["protected InputStream wrappedStream The wrapped input stream, while accessible."]}