{"methods":["static void decodeBlock(Buffer in, Buffer out) Decode a block of pixels.","static void decodeImage(Buffer in, Buffer out, int width, int height, int pixelSize, int stride) Decode an entire image.","static void encodeBlock(Buffer in, int validPixelMask, Buffer out) Encode a block of pixels.","static void encodeImage(Buffer in, int width, int height, int pixelSize, int stride, Buffer out) Encode an entire image.","static void formatHeader(Buffer header, int width, int height) Format a PKM header","static int getEncodedDataSize(int width, int height) Return the size of the encoded image data (does not include size of PKM header).","static int getHeight(Buffer header) Read the image height from a PKM header","static int getWidth(Buffer header) Read the image width from a PKM header","static boolean isValid(Buffer header) Check if a PKM header is correctly formatted.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.opengl","constants":["int DECODED_BLOCK_SIZE Size in bytes of a decoded block.","int ENCODED_BLOCK_SIZE Size in bytes of an encoded block.","int ETC1_RGB8_OES Accepted by the internalformat parameter of glCompressedTexImage2D.","int ETC_PKM_HEADER_SIZE Size of a PKM file header, in bytes."],"class":"ETC1","constructors":[],"fields":[]}