{"methods":["static ETC1Util.ETC1Texture compressTexture(Buffer input, int width, int height, int pixelSize, int stride) Helper function that compresses an image into an ETC1Texture.","static ETC1Util.ETC1Texture createTexture(InputStream input) Create a new ETC1Texture from an input stream containing a PKM formatted compressed texture.","static boolean isETC1Supported() Check if ETC1 texture compression is supported by the active OpenGL ES context.","static void loadTexture(int target, int level, int border, int fallbackFormat, int fallbackType, InputStream input) Convenience method to load an ETC1 texture whether or not the active OpenGL context supports the ETC1 texture compression format.","static void loadTexture(int target, int level, int border, int fallbackFormat, int fallbackType, ETC1Util.ETC1Texture texture) Convenience method to load an ETC1 texture whether or not the active OpenGL context supports the ETC1 texture compression format.","static void writeTexture(ETC1Util.ETC1Texture texture, OutputStream output) Helper function that writes an ETC1Texture to an output stream formatted as a PKM file.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.opengl","constants":[],"class":"ETC1Util","constructors":[],"fields":[]}