{"methods":["final int genExemptionBlob(byte[] output) Generates the result key blob for this exemption mechanism and stores it into the output buffer.","final byte[] genExemptionBlob() Generates the result key blob for this exemption mechanism.","final int genExemptionBlob(byte[] output, int outputOffset) Generates the result key blob for this exemption mechanism and stores it into the output buffer at offset outputOffset.","final static ExemptionMechanism getInstance(String algorithm, String provider) Returns a new ExemptionMechansm instance that provides the specified exemption mechanism algorithm from the specified provider.","final static ExemptionMechanism getInstance(String algorithm, Provider provider) Returns a new ExemptionMechanism instance that provides the specified exemption mechanism algorithm from the specified provider.","final static ExemptionMechanism getInstance(String algorithm) Returns a new ExemptionMechanism instance that provides the specified exemption mechanism algorithm.","final String getName() Returns the name of this ExemptionMechanism.","final int getOutputSize(int inputLen) Returns the size in bytes for the output buffer needed to hold the output of the next genExemptionBlob() call, given the specified inputLen (in bytes).","final Provider getProvider() Returns the provider of this ExemptionMechanism instance.","final void init(Key key, AlgorithmParameterSpec param) Initializes this ExemptionMechanism instance with the specified key and algorithm parameters.","final void init(Key key) Initializes this ExemptionMechanism instance with the specified key.","final void init(Key key, AlgorithmParameters param) Initializes this ExemptionMechanism instance with the specified key and algorithm parameters.","final boolean isCryptoAllowed(Key key) Returns whether the result blob for this ExemptionMechanism instance has been generated successfully and that the specified key is the same as the one that was used to initialize and generate.","void finalize() Override to clear any key state in the instance.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.crypto","constants":[],"class":"ExemptionMechanism","constructors":[],"fields":[]}