{"methods":["Animator onAppear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator.","Animator onDisappear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator.","[Expand] Inherited Methods","From class android.transition.Visibility void captureEndValues(TransitionValues transitionValues) Captures the values in the end scene for the properties that this transition monitors. void captureStartValues(TransitionValues transitionValues) Captures the values in the start scene for the properties that this transition monitors. Animator createAnimator(ViewGroup sceneRoot, TransitionValues startValues, TransitionValues endValues) This method creates an animation that will be run for this transition given the information in the startValues and endValues structures captured earlier for the start and end scenes. int getMode() Returns whether appearing and/or disappearing Views are supported. String[] getTransitionProperties() Returns the set of property names used stored in the TransitionValues object passed into captureStartValues(TransitionValues) that this transition cares about for the purposes of canceling overlapping animations. boolean isVisible(TransitionValues values) Returns whether the view is 'visible' according to the given values object. Animator onAppear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator. Animator onAppear(ViewGroup sceneRoot, TransitionValues startValues, int startVisibility, TransitionValues endValues, int endVisibility) The default implementation of this method calls onAppear(ViewGroup, View, TransitionValues, TransitionValues). Animator onDisappear(ViewGroup sceneRoot, TransitionValues startValues, int startVisibility, TransitionValues endValues, int endVisibility) Subclasses should override this method or onDisappear(ViewGroup, View, TransitionValues, TransitionValues) if they need to create an Animator when targets disappear. Animator onDisappear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator. void setMode(int mode) Changes the transition to support appearing and/or disappearing Views, depending on mode.","void captureEndValues(TransitionValues transitionValues) Captures the values in the end scene for the properties that this transition monitors.","void captureStartValues(TransitionValues transitionValues) Captures the values in the start scene for the properties that this transition monitors.","Animator createAnimator(ViewGroup sceneRoot, TransitionValues startValues, TransitionValues endValues) This method creates an animation that will be run for this transition given the information in the startValues and endValues structures captured earlier for the start and end scenes.","int getMode() Returns whether appearing and/or disappearing Views are supported.","String[] getTransitionProperties() Returns the set of property names used stored in the TransitionValues object passed into captureStartValues(TransitionValues) that this transition cares about for the purposes of canceling overlapping animations.","boolean isVisible(TransitionValues values) Returns whether the view is 'visible' according to the given values object.","Animator onAppear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator.","Animator onAppear(ViewGroup sceneRoot, TransitionValues startValues, int startVisibility, TransitionValues endValues, int endVisibility) The default implementation of this method calls onAppear(ViewGroup, View, TransitionValues, TransitionValues).","Animator onDisappear(ViewGroup sceneRoot, TransitionValues startValues, int startVisibility, TransitionValues endValues, int endVisibility) Subclasses should override this method or onDisappear(ViewGroup, View, TransitionValues, TransitionValues) if they need to create an Animator when targets disappear.","Animator onDisappear(ViewGroup sceneRoot, View view, TransitionValues startValues, TransitionValues endValues) The default implementation of this method returns a null Animator.","void setMode(int mode) Changes the transition to support appearing and/or disappearing Views, depending on mode.","From class android.transition.Transition Transition addListener(Transition.TransitionListener listener) Adds a listener to the set of listeners that are sent events through the life of an animation, such as start, repeat, and end. Transition addTarget(int targetId) Adds the id of a target view that this Transition is interested in animating. Transition addTarget(Class targetType) Adds the Class of a target view that this Transition is interested in animating. Transition addTarget(View target) Sets the target view instances that this Transition is interested in animating. Transition addTarget(String targetName) Adds the transitionName of a target view that this Transition is interested in animating. boolean canRemoveViews() abstract void captureEndValues(TransitionValues transitionValues) Captures the values in the end scene for the properties that this transition monitors. abstract void captureStartValues(TransitionValues transitionValues) Captures the values in the start scene for the properties that this transition monitors. Transition clone() Creates and returns a copy of this Object. Animator createAnimator(ViewGroup sceneRoot, TransitionValues startValues, TransitionValues endValues) This method creates an animation that will be run for this transition given the information in the startValues and endValues structures captured earlier for the start and end scenes. Transition excludeChildren(View target, boolean exclude) Whether to add the children of given target to the list of target children to exclude from this transition. Transition excludeChildren(Class type, boolean exclude) Whether to add the given type to the list of types whose children should be excluded from this transition. Transition excludeChildren(int targetId, boolean exclude) Whether to add the children of the given id to the list of targets to exclude from this transition. Transition excludeTarget(String targetName, boolean exclude) Whether to add the given transitionName to the list of target transitionNames to exclude from this transition. Transition excludeTarget(int targetId, boolean exclude) Whether to add the given id to the list of target ids to exclude from this transition. Transition excludeTarget(Class type, boolean exclude) Whether to add the given type to the list of types to exclude from this transition. Transition excludeTarget(View target, boolean exclude) Whether to add the given target to the list of targets to exclude from this transition. long getDuration() Returns the duration set on this transition. Rect getEpicenter() Returns the epicenter as specified by the Transition.EpicenterCallback or null if no callback exists. Transition.EpicenterCallback getEpicenterCallback() Returns the callback used to find the epicenter of the Transition. TimeInterpolator getInterpolator() Returns the interpolator set on this transition. String getName() Returns the name of this Transition. PathMotion getPathMotion() Returns the algorithm object used to interpolate along two dimensions. TransitionPropagation getPropagation() Returns the TransitionPropagation used to calculate Animator start delays. long getStartDelay() Returns the startDelay set on this transition. List<Integer> getTargetIds() Returns the list of target IDs that this transition limits itself to tracking and animating. List<String> getTargetNames() Returns the list of target transitionNames that this transition limits itself to tracking and animating. List<Class> getTargetTypes() Returns the list of target transitionNames that this transition limits itself to tracking and animating. List<View> getTargets() Returns the list of target views that this transition limits itself to tracking and animating. String[] getTransitionProperties() Returns the set of property names used stored in the TransitionValues object passed into captureStartValues(TransitionValues) that this transition cares about for the purposes of canceling overlapping animations. TransitionValues getTransitionValues(View view, boolean start) This method can be called by transitions to get the TransitionValues for any particular view during the transition-playing process. Transition removeListener(Transition.TransitionListener listener) Removes a listener from the set listening to this animation. Transition removeTarget(int targetId) Removes the given targetId from the list of ids that this Transition is interested in animating. Transition removeTarget(View target) Removes the given target from the list of targets that this Transition is interested in animating. Transition removeTarget(String targetName) Removes the given targetName from the list of transitionNames that this Transition is interested in animating. Transition removeTarget(Class target) Removes the given target from the list of targets that this Transition is interested in animating. Transition setDuration(long duration) Sets the duration of this transition. void setEpicenterCallback(Transition.EpicenterCallback epicenterCallback) Sets the callback to use to find the epicenter of a Transition. Transition setInterpolator(TimeInterpolator interpolator) Sets the interpolator of this transition. void setMatchOrder(int... matches) Sets the order in which Transition matches View start and end values. void setPathMotion(PathMotion pathMotion) Sets the algorithm used to calculate two-dimensional interpolation. void setPropagation(TransitionPropagation transitionPropagation) Sets the method for determining Animator start delays. Transition setStartDelay(long startDelay) Sets the startDelay of this transition. String toString() Returns a string containing a concise, human-readable description of this object.","Transition addListener(Transition.TransitionListener listener) Adds a listener to the set of listeners that are sent events through the life of an animation, such as start, repeat, and end.","Transition addTarget(int targetId) Adds the id of a target view that this Transition is interested in animating.","Transition addTarget(Class targetType) Adds the Class of a target view that this Transition is interested in animating.","Transition addTarget(View target) Sets the target view instances that this Transition is interested in animating.","Transition addTarget(String targetName) Adds the transitionName of a target view that this Transition is interested in animating.","boolean canRemoveViews()","abstract void captureEndValues(TransitionValues transitionValues) Captures the values in the end scene for the properties that this transition monitors.","abstract void captureStartValues(TransitionValues transitionValues) Captures the values in the start scene for the properties that this transition monitors.","Transition clone() Creates and returns a copy of this Object.","Animator createAnimator(ViewGroup sceneRoot, TransitionValues startValues, TransitionValues endValues) This method creates an animation that will be run for this transition given the information in the startValues and endValues structures captured earlier for the start and end scenes.","Transition excludeChildren(View target, boolean exclude) Whether to add the children of given target to the list of target children to exclude from this transition.","Transition excludeChildren(Class type, boolean exclude) Whether to add the given type to the list of types whose children should be excluded from this transition.","Transition excludeChildren(int targetId, boolean exclude) Whether to add the children of the given id to the list of targets to exclude from this transition.","Transition excludeTarget(String targetName, boolean exclude) Whether to add the given transitionName to the list of target transitionNames to exclude from this transition.","Transition excludeTarget(int targetId, boolean exclude) Whether to add the given id to the list of target ids to exclude from this transition.","Transition excludeTarget(Class type, boolean exclude) Whether to add the given type to the list of types to exclude from this transition.","Transition excludeTarget(View target, boolean exclude) Whether to add the given target to the list of targets to exclude from this transition.","long getDuration() Returns the duration set on this transition.","Rect getEpicenter() Returns the epicenter as specified by the Transition.EpicenterCallback or null if no callback exists.","Transition.EpicenterCallback getEpicenterCallback() Returns the callback used to find the epicenter of the Transition.","TimeInterpolator getInterpolator() Returns the interpolator set on this transition.","String getName() Returns the name of this Transition.","PathMotion getPathMotion() Returns the algorithm object used to interpolate along two dimensions.","TransitionPropagation getPropagation() Returns the TransitionPropagation used to calculate Animator start delays.","long getStartDelay() Returns the startDelay set on this transition.","List<Integer> getTargetIds() Returns the list of target IDs that this transition limits itself to tracking and animating.","List<String> getTargetNames() Returns the list of target transitionNames that this transition limits itself to tracking and animating.","List<Class> getTargetTypes() Returns the list of target transitionNames that this transition limits itself to tracking and animating.","List<View> getTargets() Returns the list of target views that this transition limits itself to tracking and animating.","String[] getTransitionProperties() Returns the set of property names used stored in the TransitionValues object passed into captureStartValues(TransitionValues) that this transition cares about for the purposes of canceling overlapping animations.","TransitionValues getTransitionValues(View view, boolean start) This method can be called by transitions to get the TransitionValues for any particular view during the transition-playing process.","Transition removeListener(Transition.TransitionListener listener) Removes a listener from the set listening to this animation.","Transition removeTarget(int targetId) Removes the given targetId from the list of ids that this Transition is interested in animating.","Transition removeTarget(View target) Removes the given target from the list of targets that this Transition is interested in animating.","Transition removeTarget(String targetName) Removes the given targetName from the list of transitionNames that this Transition is interested in animating.","Transition removeTarget(Class target) Removes the given target from the list of targets that this Transition is interested in animating.","Transition setDuration(long duration) Sets the duration of this transition.","void setEpicenterCallback(Transition.EpicenterCallback epicenterCallback) Sets the callback to use to find the epicenter of a Transition.","Transition setInterpolator(TimeInterpolator interpolator) Sets the interpolator of this transition.","void setMatchOrder(int... matches) Sets the order in which Transition matches View start and end values.","void setPathMotion(PathMotion pathMotion) Sets the algorithm used to calculate two-dimensional interpolation.","void setPropagation(TransitionPropagation transitionPropagation) Sets the method for determining Animator start delays.","Transition setStartDelay(long startDelay) Sets the startDelay of this transition.","String toString() Returns a string containing a concise, human-readable description of this object.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.transition","constants":["int IN Fading mode used in Fade(int) to make the transition operate on targets that are appearing.","int OUT Fading mode used in Fade(int) to make the transition operate on targets that are disappearing.","[Expand] Inherited Constants","From class android.transition.Visibility int MODE_IN Mode used in setMode(int) to make the transition operate on targets that are appearing. int MODE_OUT Mode used in setMode(int) to make the transition operate on targets that are disappearing.","int MODE_IN Mode used in setMode(int) to make the transition operate on targets that are appearing.","int MODE_OUT Mode used in setMode(int) to make the transition operate on targets that are disappearing.","From class android.transition.Transition int MATCH_ID With setMatchOrder(int), chooses to match by getId(). int MATCH_INSTANCE With setMatchOrder(int), chooses to match by View instance. int MATCH_ITEM_ID With setMatchOrder(int), chooses to match by the Adapter item id. int MATCH_NAME With setMatchOrder(int), chooses to match by getTransitionName().","int MATCH_ID With setMatchOrder(int), chooses to match by getId().","int MATCH_INSTANCE With setMatchOrder(int), chooses to match by View instance.","int MATCH_ITEM_ID With setMatchOrder(int), chooses to match by the Adapter item id.","int MATCH_NAME With setMatchOrder(int), chooses to match by getTransitionName()."],"class":"Fade","constructors":[],"fields":[]}