{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.fitness.data","constants":[],"class":"Fields","constructors":[],"fields":["public static final Field ACCURACY The accuracy of an accompanied value (such as location)","public static final Field ACTIVITY An activity type of a DetectedActivity.","public static final Field ALTITUDE An altitude of a location represented as a float, in meters above sea level.","public static final Field AVERAGE An average value.","public static final Field BPM A heart rate in beats per minute.","public static final Field CALORIES Calories in kcal.","public static final Field CONFIDENCE A confidence of an accompanied value, specified as a value between 0.0 and 100.0.","public static final Field DISTANCE A distance in meters.","public static final Field DURATION A duration in milliseconds.","public static final Field HEIGHT A height in meters.","public static final Field HIGH_LATITUDE A high latitude of a location bounding box represented as a float, in degrees.","public static final Field HIGH_LONGITUDE A high longitude of a location bounding box represented as a float, in degrees.","public static final Field LATITUDE A latitude of a location represented as a float, in degrees.","public static final Field LONGITUDE A longitude of a location represented as a float, in degrees.","public static final Field LOW_LATITUDE A low latitude of a location bounding box represented as a float, in degrees.","public static final Field LOW_LONGITUDE A low longitude of a location bounding box represented as a float, in degrees.","public static final Field MAX A maximum value.","public static final Field MIN A minimum value.","public static final Field NUM_SEGMENTS A number of segments.","public static final Field REVOLUTIONS Revolutions.","public static final Field RPM Revolutions per minute or rate per minute.","public static final Field SPEED A speed in meter/sec.","public static final Field STEPS A number of steps.","public static final Field WATTS Power in watts.","public static final Field WEIGHT A weight in kilograms."]}