{"methods":["abstract void force(boolean metadata) Requests that all updates to this channel are committed to the storage device.","final FileLock lock() Obtains an exclusive lock on this file.","abstract FileLock lock(long position, long size, boolean shared) Obtains a lock on a specified region of the file.","abstract MappedByteBuffer map(FileChannel.MapMode mode, long position, long size) Maps the file into memory.","abstract long position() Returns the current position as a positive integer number of bytes from the start of the file.","abstract FileChannel position(long newPosition) Sets the file position pointer to a new value.","abstract int read(ByteBuffer buffer, long position) Reads bytes from this file channel into the given buffer starting from the specified file position.","abstract int read(ByteBuffer buffer) Reads bytes from this file channel into the given buffer.","abstract long read(ByteBuffer[] buffers, int start, int number) Reads bytes from this file channel into a subset of the given buffers.","final long read(ByteBuffer[] buffers) Reads bytes from this file channel and stores them in the specified array of buffers.","abstract long size() Returns the size of the file underlying this channel in bytes.","abstract long transferFrom(ReadableByteChannel src, long position, long count) Reads up to count bytes from src and stores them in this channel's file starting at position.","abstract long transferTo(long position, long count, WritableByteChannel target) Reads up to count bytes from this channel's file starting at position and writes them to target.","abstract FileChannel truncate(long size) Truncates the file underlying this channel to a given size.","abstract FileLock tryLock(long position, long size, boolean shared) Attempts to acquire an exclusive lock on this file without blocking.","final FileLock tryLock() Attempts to acquire an exclusive lock on this file without blocking.","final long write(ByteBuffer[] buffers) Writes bytes from all the given byte buffers to this file channel.","abstract long write(ByteBuffer[] buffers, int offset, int length) Attempts to write a subset of the given bytes from the buffers to this file channel.","abstract int write(ByteBuffer src) Writes bytes from the given byte buffer to this file channel.","abstract int write(ByteBuffer buffer, long position) Writes bytes from the given buffer to this file channel starting at the given file position.","[Expand] Inherited Methods","From class java.nio.channels.spi.AbstractInterruptibleChannel final void begin() Indicates the beginning of a code section that includes an I/O operation that is potentially blocking. final void close() Closes an open channel. final void end(boolean success) Indicates the end of a code section that has been started with begin() and that includes a potentially blocking I/O operation. abstract void implCloseChannel() Implements the channel closing behavior. synchronized final boolean isOpen() Returns true if this channel is open.","final void begin() Indicates the beginning of a code section that includes an I/O operation that is potentially blocking.","final void close() Closes an open channel.","final void end(boolean success) Indicates the end of a code section that has been started with begin() and that includes a potentially blocking I/O operation.","abstract void implCloseChannel() Implements the channel closing behavior.","synchronized final boolean isOpen() Returns true if this channel is open.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.nio.channels.Channel abstract void close() Closes an open channel. abstract boolean isOpen() Returns true if this channel is open.","abstract void close() Closes an open channel.","abstract boolean isOpen() Returns true if this channel is open.","From interface java.nio.channels.GatheringByteChannel abstract long write(ByteBuffer[] buffers, int offset, int length) Attempts to write all remaining() bytes from length byte buffers, in order, starting at buffers[offset]. abstract long write(ByteBuffer[] buffers) Writes bytes from all the given buffers to a channel.","abstract long write(ByteBuffer[] buffers, int offset, int length) Attempts to write all remaining() bytes from length byte buffers, in order, starting at buffers[offset].","abstract long write(ByteBuffer[] buffers) Writes bytes from all the given buffers to a channel.","From interface java.nio.channels.InterruptibleChannel abstract void close() Closes the channel.","abstract void close() Closes the channel.","From interface java.nio.channels.ReadableByteChannel abstract int read(ByteBuffer buffer) Reads bytes from the channel into the given buffer.","abstract int read(ByteBuffer buffer) Reads bytes from the channel into the given buffer.","From interface java.nio.channels.ScatteringByteChannel abstract long read(ByteBuffer[] buffers, int offset, int length) Attempts to read all remaining() bytes from length byte buffers, in order, starting at buffers[offset]. abstract long read(ByteBuffer[] buffers) Reads bytes from this channel into the specified array of buffers.","abstract long read(ByteBuffer[] buffers, int offset, int length) Attempts to read all remaining() bytes from length byte buffers, in order, starting at buffers[offset].","abstract long read(ByteBuffer[] buffers) Reads bytes from this channel into the specified array of buffers.","From interface java.nio.channels.WritableByteChannel abstract int write(ByteBuffer buffer) Writes bytes from the given buffer to the channel.","abstract int write(ByteBuffer buffer) Writes bytes from the given buffer to the channel."],"package":"java.nio.channels","constants":[],"class":"FileChannel","constructors":[],"fields":[]}