{"methods":["abstract void onEvent(int event, String path) The event handler, which must be implemented by subclasses.","void startWatching() Start watching for events.","void stopWatching() Stop watching for events.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":["int ACCESS Event type: Data was read from a file","int ALL_EVENTS Event mask: All valid event types, combined","int ATTRIB Event type: Metadata (permissions, owner, timestamp) was changed explicitly","int CLOSE_NOWRITE Event type: Someone had a file or directory open read-only, and closed it","int CLOSE_WRITE Event type: Someone had a file or directory open for writing, and closed it","int CREATE Event type: A new file or subdirectory was created under the monitored directory","int DELETE Event type: A file was deleted from the monitored directory","int DELETE_SELF Event type: The monitored file or directory was deleted; monitoring effectively stops","int MODIFY Event type: Data was written to a file","int MOVED_FROM Event type: A file or subdirectory was moved from the monitored directory","int MOVED_TO Event type: A file or subdirectory was moved to the monitored directory","int MOVE_SELF Event type: The monitored file or directory was moved; monitoring continues","int OPEN Event type: A file or directory was opened"],"class":"FileObserver","constructors":[],"fields":[]}