{"methods":["static Filter and(Filter filter, Filter... additionalFilters) Returns a logical expression which combines filters with the 'AND' operator.","static Filter and(Iterable<Filter> filters) Returns a filter that matches items which are matched by every element of filters.","static Filter contains(SearchableMetadataField<String> field, String value) Returns a filter which checks whether value is a substring of field.","static <T> Filter eq(SearchableMetadataField<T> field, T value) Returns a filter which checks if the value of field equals value.","static <T만xtendsComparable<T>> Filter greaterThan(SearchableOrderedMetadataField<T> field, T value) Returns a filter which checks if the value of field is greater than value.","static <T만xtendsComparable<T>> Filter greaterThanEquals(SearchableOrderedMetadataField<T> field, T value) Returns a filter which checks if the value of field is greater than or equal to value.","static <T> Filter in(SearchableCollectionMetadataField<T> field, T value) Returns a filter which checks whether value is an element of field.","static <T만xtendsComparable<T>> Filter lessThan(SearchableOrderedMetadataField<T> field, T value) Returns a filter which checks if the value of field is less than value.","static <T만xtendsComparable<T>> Filter lessThanEquals(SearchableOrderedMetadataField<T> field, T value) Returns a filter which checks if the value of field is less than or equal to value.","static Filter not(Filter toNegate) Returns the negation of an filter.","static Filter openedByMe() Returns a filter that matches only items that the current user has opened in the past.","static Filter or(Iterable<Filter> filters) Returns a filter that matches items which are matched by any element of filters.","static Filter or(Filter filter, Filter... additionalFilters) Returns a filter that matches items which are matched by any of the provided filter parameters.","static Filter sharedWithMe() Returns a filter that matches only items that are shared with the current user.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.drive.query","constants":[],"class":"Filters","constructors":[],"fields":[]}