{"methods":["static String getActivityMimeType(int activity) Returns the MIME type for a particular activity.","static DataSource getDataSource(Intent intent) Retrieves the data source extra from the given intent.","static String getDataTypeMimeType(DataType dataType) Returns the MIME type for a particular DataType.","static long getEndTime(Intent intent) Retrieves the end time extra from the given intent.","static String getSessionMimeType(int activity) Returns the MIME type which describes a Session for a particular activity.","static long getStartTime(Intent intent) Retrieves the start time extra from the given intent.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.fitness","constants":["String ACTION_TRACK Broadcast action: the user has requested that an application starts or stops tracking their activity.","String ACTION_VIEW Broadcast action: the user has requested that an application show the value of a particular fitness data type.","String ACTION_VIEW_GOAL Broadcast action: the user has requested to view their current fitness goal.","String EXTRA_DATA_SOURCE Name for the optional parcelable intent extra containing the data source.","String EXTRA_END_TIME Name for the optional long intent extra containing the end time in milliseconds since epoch.","String EXTRA_SESSION Name for the parcelable intent extra containing the data session.","String EXTRA_START_TIME Name for the optional long intent extra containing the start time in milliseconds since epoch.","String EXTRA_STATUS Name for the String extra containing the status of an activity.","String MIME_TYPE_ACTIVITY_PREFIX The common prefix for Activity types.","String MIME_TYPE_DATA_TYPE_PREFIX The common prefix for Fitness data type MIME types.","String MIME_TYPE_SESSION_PREFIX The common prefix for Session MIME types.","String STATUS_ACTIVE Status indicating the activity has started.","String STATUS_COMPLETED Status indicating the activity has ended."],"class":"FitnessIntents","constructors":[],"fields":[]}