{"methods":["boolean awaitQuiescence(long timeout, TimeUnit unit) If called by a ForkJoinTask operating in this pool, equivalent in effect to helpQuiesce().","boolean awaitTermination(long timeout, TimeUnit unit) Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first.","void execute(ForkJoinTask<?> task) Arranges for (asynchronous) execution of the given task.","void execute(Runnable task)","int getActiveThreadCount() Returns an estimate of the number of threads that are currently stealing or executing tasks.","boolean getAsyncMode() Returns true if this pool uses local first-in-first-out scheduling mode for forked tasks that are never joined.","ForkJoinPool.ForkJoinWorkerThreadFactory getFactory() Returns the factory used for constructing new workers.","int getParallelism() Returns the targeted parallelism level of this pool.","int getPoolSize() Returns the number of worker threads that have started but not yet terminated.","int getQueuedSubmissionCount() Returns an estimate of the number of tasks submitted to this pool that have not yet begun executing.","long getQueuedTaskCount() Returns an estimate of the total number of tasks currently held in queues by worker threads (but not including tasks submitted to the pool that have not begun executing).","int getRunningThreadCount() Returns an estimate of the number of worker threads that are not blocked waiting to join tasks or for other managed synchronization.","long getStealCount() Returns an estimate of the total number of tasks stolen from one thread's work queue by another.","Thread.UncaughtExceptionHandler getUncaughtExceptionHandler() Returns the handler for internal worker threads that terminate due to unrecoverable errors encountered while executing tasks.","boolean hasQueuedSubmissions() Returns true if there are any tasks submitted to this pool that have not yet begun executing.","<T> T invoke(ForkJoinTask<T> task) Performs the given task, returning its result upon completion.","<T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete.","boolean isQuiescent() Returns true if all worker threads are currently idle.","boolean isShutdown() Returns true if this pool has been shut down.","boolean isTerminated() Returns true if all tasks have completed following shut down.","boolean isTerminating() Returns true if the process of termination has commenced but not yet completed.","static void managedBlock(ForkJoinPool.ManagedBlocker blocker) Blocks in accord with the given blocker.","void shutdown() Possibly initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.","List<Runnable> shutdownNow() Possibly attempts to cancel and/or stop all tasks, and reject all subsequently submitted tasks.","<T> ForkJoinTask<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","<T> ForkJoinTask<T> submit(ForkJoinTask<T> task) Submits a ForkJoinTask for execution.","<T> ForkJoinTask<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","ForkJoinTask<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","String toString() Returns a string identifying this pool, as well as its state, including indications of run state, parallelism level, and worker and task counts.","int drainTasksTo(Collection<?맙uperForkJoinTask<?>> c) Removes all available unexecuted submitted and forked tasks from scheduling queues and adds them to the given collection, without altering their execution status.","<T> RunnableFuture<T> newTaskFor(Callable<T> callable) Returns a RunnableFuture for the given callable task.","<T> RunnableFuture<T> newTaskFor(Runnable runnable, T value) Returns a RunnableFuture for the given runnable and default value.","ForkJoinTask<?> pollSubmission() Removes and returns the next unexecuted submission if one is available.","[Expand] Inherited Methods","From class java.util.concurrent.AbstractExecutorService <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete. <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first. <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses. <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do. <T> RunnableFuture<T> newTaskFor(Callable<T> callable) Returns a RunnableFuture for the given callable task. <T> RunnableFuture<T> newTaskFor(Runnable runnable, T value) Returns a RunnableFuture for the given runnable and default value. <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task. <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task. Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","<T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete.","<T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first.","<T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses.","<T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do.","<T> RunnableFuture<T> newTaskFor(Callable<T> callable) Returns a RunnableFuture for the given callable task.","<T> RunnableFuture<T> newTaskFor(Runnable runnable, T value) Returns a RunnableFuture for the given runnable and default value.","<T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","<T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.concurrent.Executor abstract void execute(Runnable command) Executes the given command at some time in the future.","abstract void execute(Runnable command) Executes the given command at some time in the future.","From interface java.util.concurrent.ExecutorService abstract boolean awaitTermination(long timeout, TimeUnit unit) Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first. abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete. abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first. abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses. abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do. abstract boolean isShutdown() Returns true if this executor has been shut down. abstract boolean isTerminated() Returns true if all tasks have completed following shut down. abstract void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted. abstract List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution. abstract <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task. abstract <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task. abstract Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","abstract boolean awaitTermination(long timeout, TimeUnit unit) Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first.","abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete.","abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first.","abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses.","abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do.","abstract boolean isShutdown() Returns true if this executor has been shut down.","abstract boolean isTerminated() Returns true if all tasks have completed following shut down.","abstract void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.","abstract List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution.","abstract <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","abstract <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","abstract Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task."],"package":"java.util.concurrent","constants":[],"class":"ForkJoinPool","constructors":[],"fields":["public static final ForkJoinPool.ForkJoinWorkerThreadFactory defaultForkJoinWorkerThreadFactory Creates a new ForkJoinWorkerThread."]}