{"methods":["abstract void addOnBackStackChangedListener(FragmentManager.OnBackStackChangedListener listener) Add a new listener for changes to the fragment back stack.","abstract FragmentTransaction beginTransaction() Start a series of edit operations on the Fragments associated with this FragmentManager.","abstract void dump(String prefix, FileDescriptor fd, PrintWriter writer, String[] args) Print the FragmentManager's state into the given stream.","static void enableDebugLogging(boolean enabled) Control whether the framework's internal fragment manager debugging logs are turned on.","abstract boolean executePendingTransactions() After a FragmentTransaction is committed with FragmentTransaction.commit(), it is scheduled to be executed asynchronously on the process's main thread.","abstract Fragment findFragmentById(int id) Finds a fragment that was identified by the given id either when inflated from XML or as the container ID when added in a transaction.","abstract Fragment findFragmentByTag(String tag) Finds a fragment that was identified by the given tag either when inflated from XML or as supplied when added in a transaction.","abstract FragmentManager.BackStackEntry getBackStackEntryAt(int index) Return the BackStackEntry at index index in the back stack; entries start index 0 being the bottom of the stack.","abstract int getBackStackEntryCount() Return the number of entries currently in the back stack.","abstract Fragment getFragment(Bundle bundle, String key) Retrieve the current Fragment instance for a reference previously placed with putFragment(Bundle, String, Fragment).","abstract boolean isDestroyed() Returns true if the final Activity.onDestroy() call has been made on the FragmentManager's Activity, so this instance is now dead.","abstract void popBackStack() Pop the top state off the back stack.","abstract void popBackStack(String name, int flags) Pop the last fragment transition from the manager's fragment back stack.","abstract void popBackStack(int id, int flags) Pop all back stack states up to the one with the given identifier.","abstract boolean popBackStackImmediate(int id, int flags) Like popBackStack(int, int), but performs the operation immediately inside of the call.","abstract boolean popBackStackImmediate(String name, int flags) Like popBackStack(String, int), but performs the operation immediately inside of the call.","abstract boolean popBackStackImmediate() Like popBackStack(), but performs the operation immediately inside of the call.","abstract void putFragment(Bundle bundle, String key, Fragment fragment) Put a reference to a fragment in a Bundle.","abstract void removeOnBackStackChangedListener(FragmentManager.OnBackStackChangedListener listener) Remove a listener that was previously added with addOnBackStackChangedListener(OnBackStackChangedListener).","abstract Fragment.SavedState saveFragmentInstanceState(Fragment f) Save the current instance state of the given Fragment.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":["int POP_BACK_STACK_INCLUSIVE Flag for popBackStack(String, int) and popBackStack(int, int): If set, and the name or ID of a back stack entry has been supplied, then all matching entries will be consumed until one that doesn't match is found or the bottom of the stack is reached."],"class":"FragmentManager","constructors":[],"fields":[]}