{"methods":["void destroyItem(ViewGroup container, int position, Object object) Remove a page for the given position.","void finishUpdate(ViewGroup container) Called when the a change in the shown pages has been completed.","abstract Fragment getItem(int position) Return the Fragment associated with a specified position.","Object instantiateItem(ViewGroup container, int position) Create the page for the given position.","boolean isViewFromObject(View view, Object object) Determines whether a page View is associated with a specific key object as returned by instantiateItem(ViewGroup, int).","void restoreState(Parcelable state, ClassLoader loader) Restore any instance state associated with this adapter and its pages that was previously saved by saveState().","Parcelable saveState() Save any instance state associated with this adapter and its pages that should be restored if the current UI state needs to be reconstructed.","void setPrimaryItem(ViewGroup container, int position, Object object) Called to inform the adapter of which item is currently considered to be the \"primary\", that is the one show to the user as the current page.","void startUpdate(ViewGroup container) Called when a change in the shown pages is going to start being made.","[Expand] Inherited Methods","From class android.support.v4.view.PagerAdapter void destroyItem(ViewGroup container, int position, Object object) Remove a page for the given position. void destroyItem(View container, int position, Object object) This method is deprecated. Use destroyItem(ViewGroup, int, Object) void finishUpdate(View container) This method is deprecated. Use finishUpdate(ViewGroup) void finishUpdate(ViewGroup container) Called when the a change in the shown pages has been completed. abstract int getCount() Return the number of views available. int getItemPosition(Object object) Called when the host view is attempting to determine if an item's position has changed. CharSequence getPageTitle(int position) This method may be called by the ViewPager to obtain a title string to describe the specified page. float getPageWidth(int position) Returns the proportional width of a given page as a percentage of the ViewPager's measured width from (0.f-1.f] Object instantiateItem(ViewGroup container, int position) Create the page for the given position. Object instantiateItem(View container, int position) This method is deprecated. Use instantiateItem(ViewGroup, int) abstract boolean isViewFromObject(View view, Object object) Determines whether a page View is associated with a specific key object as returned by instantiateItem(ViewGroup, int). void notifyDataSetChanged() This method should be called by the application if the data backing this adapter has changed and associated views should update. void registerDataSetObserver(DataSetObserver observer) Register an observer to receive callbacks related to the adapter's data changing. void restoreState(Parcelable state, ClassLoader loader) Restore any instance state associated with this adapter and its pages that was previously saved by saveState(). Parcelable saveState() Save any instance state associated with this adapter and its pages that should be restored if the current UI state needs to be reconstructed. void setPrimaryItem(View container, int position, Object object) This method is deprecated. Use setPrimaryItem(ViewGroup, int, Object) void setPrimaryItem(ViewGroup container, int position, Object object) Called to inform the adapter of which item is currently considered to be the \"primary\", that is the one show to the user as the current page. void startUpdate(View container) This method is deprecated. Use startUpdate(ViewGroup) void startUpdate(ViewGroup container) Called when a change in the shown pages is going to start being made. void unregisterDataSetObserver(DataSetObserver observer) Unregister an observer from callbacks related to the adapter's data changing.","void destroyItem(ViewGroup container, int position, Object object) Remove a page for the given position.","void destroyItem(View container, int position, Object object) This method is deprecated. Use destroyItem(ViewGroup, int, Object)","void finishUpdate(View container) This method is deprecated. Use finishUpdate(ViewGroup)","void finishUpdate(ViewGroup container) Called when the a change in the shown pages has been completed.","abstract int getCount() Return the number of views available.","int getItemPosition(Object object) Called when the host view is attempting to determine if an item's position has changed.","CharSequence getPageTitle(int position) This method may be called by the ViewPager to obtain a title string to describe the specified page.","float getPageWidth(int position) Returns the proportional width of a given page as a percentage of the ViewPager's measured width from (0.f-1.f]","Object instantiateItem(ViewGroup container, int position) Create the page for the given position.","Object instantiateItem(View container, int position) This method is deprecated. Use instantiateItem(ViewGroup, int)","abstract boolean isViewFromObject(View view, Object object) Determines whether a page View is associated with a specific key object as returned by instantiateItem(ViewGroup, int).","void notifyDataSetChanged() This method should be called by the application if the data backing this adapter has changed and associated views should update.","void registerDataSetObserver(DataSetObserver observer) Register an observer to receive callbacks related to the adapter's data changing.","void restoreState(Parcelable state, ClassLoader loader) Restore any instance state associated with this adapter and its pages that was previously saved by saveState().","Parcelable saveState() Save any instance state associated with this adapter and its pages that should be restored if the current UI state needs to be reconstructed.","void setPrimaryItem(View container, int position, Object object) This method is deprecated. Use setPrimaryItem(ViewGroup, int, Object)","void setPrimaryItem(ViewGroup container, int position, Object object) Called to inform the adapter of which item is currently considered to be the \"primary\", that is the one show to the user as the current page.","void startUpdate(View container) This method is deprecated. Use startUpdate(ViewGroup)","void startUpdate(ViewGroup container) Called when a change in the shown pages is going to start being made.","void unregisterDataSetObserver(DataSetObserver observer) Unregister an observer from callbacks related to the adapter's data changing.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":["[Expand] Inherited Constants","From class android.support.v4.view.PagerAdapter int POSITION_NONE int POSITION_UNCHANGED","int POSITION_NONE","int POSITION_UNCHANGED"],"class":"FragmentStatePagerAdapter","constructors":[],"fields":[]}