{"methods":["static String getStatusString(int statusCode) Get the string associated with the status code.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.games","constants":["int STATUS_ACHIEVEMENT_NOT_INCREMENTAL Indicates that the call to increment achievement failed since the achievement is not an incremental achievement.","int STATUS_ACHIEVEMENT_UNKNOWN Could not find the achievement, so the operation to update the achievement failed.","int STATUS_ACHIEVEMENT_UNLOCKED Indicates that the incremental achievement was also unlocked when the call was made to increment the achievement.","int STATUS_ACHIEVEMENT_UNLOCK_FAILURE An incremental achievement cannot be unlocked directly, so the call to unlock achievement failed.","int STATUS_APP_MISCONFIGURED The developer has misconfigured their application in some way.","int STATUS_CLIENT_RECONNECT_REQUIRED The GoogleApiClient is in an inconsistent state and must reconnect to the service to resolve the issue.","int STATUS_GAME_NOT_FOUND The specified game ID was not recognized by the server.","int STATUS_INTERNAL_ERROR An unspecified error occurred; no more specific information is available.","int STATUS_INTERRUPTED Was interrupted while waiting for the result.","int STATUS_INVALID_REAL_TIME_ROOM_ID Constant indicating that the real-time room ID provided to the operation was not valid, or does not correspond to the currently active real-time room.","int STATUS_LICENSE_CHECK_FAILED The game is not licensed to the user.","int STATUS_MATCH_ERROR_ALREADY_REMATCHED The specified match has already had a rematch created.","int STATUS_MATCH_ERROR_INACTIVE_MATCH The match is not currently active.","int STATUS_MATCH_ERROR_INVALID_MATCH_RESULTS The match results provided in this API call are invalid.","int STATUS_MATCH_ERROR_INVALID_MATCH_STATE The match is not in the correct state to perform the specified action.","int STATUS_MATCH_ERROR_INVALID_PARTICIPANT_STATE One or more participants in this match are not in valid states.","int STATUS_MATCH_ERROR_LOCALLY_MODIFIED The specified match has already been modified locally.","int STATUS_MATCH_ERROR_OUT_OF_DATE_VERSION The match data is out of date.","int STATUS_MATCH_NOT_FOUND The specified match cannot be found.","int STATUS_MILESTONE_CLAIMED_PREVIOUSLY This quest milestone was previously claimed (on this device or another).","int STATUS_MILESTONE_CLAIM_FAILED This quest milestone is not available for claiming.","int STATUS_MULTIPLAYER_DISABLED This game does not support multiplayer.","int STATUS_MULTIPLAYER_ERROR_CREATION_NOT_ALLOWED The user is not allowed to create a new multiplayer game at this time.","int STATUS_MULTIPLAYER_ERROR_INVALID_MULTIPLAYER_TYPE The match is not the right type to perform this action on.","int STATUS_MULTIPLAYER_ERROR_INVALID_OPERATION This multiplayer operation is not valid, and the server rejected it.","int STATUS_MULTIPLAYER_ERROR_NOT_TRUSTED_TESTER The user attempted to invite another user who was not authorized to see the game.","int STATUS_NETWORK_ERROR_NO_DATA A network error occurred while attempting to retrieve fresh data, and no data was available locally.","int STATUS_NETWORK_ERROR_OPERATION_DEFERRED A network error occurred while attempting to modify data, but the data was successfully modified locally and will be updated on the network the next time the device is able to sync.","int STATUS_NETWORK_ERROR_OPERATION_FAILED A network error occurred while attempting to perform an operation that requires network access.","int STATUS_NETWORK_ERROR_STALE_DATA A network error occurred while attempting to retrieve fresh data, but some locally cached data was available.","int STATUS_OK The operation was successful.","int STATUS_OPERATION_IN_FLIGHT Trying to start a join/create operation while another is already in flight.","int STATUS_PARTICIPANT_NOT_CONNECTED Constant indicating that the ID of the participant provided by the user is not currently connected to the client in the real-time room.","int STATUS_QUEST_NOT_STARTED This quest is not available yet and cannot be accepted.","int STATUS_QUEST_NO_LONGER_AVAILABLE This quest has expired or the developer has removed, and cannot be accepted.","int STATUS_REAL_TIME_CONNECTION_FAILED Failed to initialize the network connection for a real-time room.","int STATUS_REAL_TIME_INACTIVE_ROOM The room is not currently active.","int STATUS_REAL_TIME_MESSAGE_SEND_FAILED Failed to send message to the peer participant for a real-time room.","int STATUS_REAL_TIME_ROOM_NOT_JOINED Failed to send message to the peer participant for a real-time room, since the user has not joined the room.","int STATUS_REQUEST_UPDATE_PARTIAL_SUCCESS Some of the batched network operations succeeded.","int STATUS_REQUEST_UPDATE_TOTAL_FAILURE All of the request update operations attempted failed.","int STATUS_SNAPSHOT_COMMIT_FAILED The attempt to commit the snapshot change failed.","int STATUS_SNAPSHOT_CONFLICT A conflict was detected for the snapshot.","int STATUS_SNAPSHOT_CONFLICT_MISSING The conflict that was being resolved doesn't exist.","int STATUS_SNAPSHOT_CONTENTS_UNAVAILABLE An error occurred while attempting to open the contents of the snapshot.","int STATUS_SNAPSHOT_CREATION_FAILED The attempt to create a snapshot failed.","int STATUS_SNAPSHOT_FOLDER_UNAVAILABLE The root folder for snapshots could not be found or created.","int STATUS_SNAPSHOT_NOT_FOUND The specified snapshot does not exist on the server.","int STATUS_TIMEOUT The operation timed out while awaiting the result."],"class":"GamesStatusCodes","constructors":[],"fields":[]}