{"methods":["static String getAppId(GoogleApiClient apiClient) Get the application ID linked to this client instance.","static String getCurrentAccountName(GoogleApiClient apiClient) Get the name of the currently selected account.","static int getSdkVariant(GoogleApiClient apiClient)","static Intent getSettingsIntent(GoogleApiClient apiClient) Gets an intent to show the Settings screen that allows the user to configure Games-related features for the current game.","static void setGravityForPopups(GoogleApiClient apiClient, int gravity) Specifies the part of the screen at which games service popups (for example, \"welcome back\" or \"achievement unlocked\" popups) will be displayed using gravity.","static void setViewForPopups(GoogleApiClient apiClient, View gamesContentView) Sets the View to use as a content view for popups.","static PendingResult<Status> signOut(GoogleApiClient apiClient) Asynchronously signs the current user out.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.games","constants":["String EXTRA_PLAYER_IDS Used to return a list of player IDs."],"class":"Games","constructors":[],"fields":["public static final Api<Games.GamesOptions> API Token to pass to addApi(Api) to enable the Games features.","public static final Achievements Achievements Methods for interacting with achievements.","public static final Events Events Methods for interacting with events.","public static final GamesMetadata GamesMetadata Methods for interacting with game metadata.","public static final Invitations Invitations Methods for interacting with invitations.","public static final Leaderboards Leaderboards Methods for interacting with leaderboard data.","public static final Notifications Notifications Methods for interacting with notifications.","public static final Players Players Methods for interacting with players.","public static final Quests Quests Methods for interacting with quests.","public static final RealTimeMultiplayer RealTimeMultiplayer Methods for interacting with real-time multiplayer games.","public static final Requests Requests Methods for interacting with requests.","public static final Scope SCOPE_GAMES Scope for accessing data from Google Play Games.","public static final Snapshots Snapshots Methods for interacting with snapshots.","public static final TurnBasedMultiplayer TurnBasedMultiplayer Methods for interacting with turn-based multiplayer games."]}