{"methods":["boolean onDoubleTap(MotionEvent e) Notified when a double-tap occurs.","boolean onDoubleTapEvent(MotionEvent e) Notified when an event within a double-tap gesture occurs, including the down, move, and up events.","boolean onDown(MotionEvent e) Notified when a tap occurs with the down MotionEvent that triggered it.","boolean onFling(MotionEvent e1, MotionEvent e2, float velocityX, float velocityY) Notified of a fling event when it occurs with the initial on down MotionEvent and the matching up MotionEvent.","void onLongPress(MotionEvent e) Notified when a long press occurs with the initial on down MotionEvent that trigged it.","boolean onScroll(MotionEvent e1, MotionEvent e2, float distanceX, float distanceY) Notified when a scroll occurs with the initial on down MotionEvent and the current move MotionEvent.","void onShowPress(MotionEvent e) The user has performed a down MotionEvent and not performed a move or up yet.","boolean onSingleTapConfirmed(MotionEvent e) Notified when a single-tap occurs.","boolean onSingleTapUp(MotionEvent e) Notified when a tap occurs with the up MotionEvent that triggered it.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.view.GestureDetector.OnDoubleTapListener abstract boolean onDoubleTap(MotionEvent e) Notified when a double-tap occurs. abstract boolean onDoubleTapEvent(MotionEvent e) Notified when an event within a double-tap gesture occurs, including the down, move, and up events. abstract boolean onSingleTapConfirmed(MotionEvent e) Notified when a single-tap occurs.","abstract boolean onDoubleTap(MotionEvent e) Notified when a double-tap occurs.","abstract boolean onDoubleTapEvent(MotionEvent e) Notified when an event within a double-tap gesture occurs, including the down, move, and up events.","abstract boolean onSingleTapConfirmed(MotionEvent e) Notified when a single-tap occurs.","From interface android.view.GestureDetector.OnGestureListener abstract boolean onDown(MotionEvent e) Notified when a tap occurs with the down MotionEvent that triggered it. abstract boolean onFling(MotionEvent e1, MotionEvent e2, float velocityX, float velocityY) Notified of a fling event when it occurs with the initial on down MotionEvent and the matching up MotionEvent. abstract void onLongPress(MotionEvent e) Notified when a long press occurs with the initial on down MotionEvent that trigged it. abstract boolean onScroll(MotionEvent e1, MotionEvent e2, float distanceX, float distanceY) Notified when a scroll occurs with the initial on down MotionEvent and the current move MotionEvent. abstract void onShowPress(MotionEvent e) The user has performed a down MotionEvent and not performed a move or up yet. abstract boolean onSingleTapUp(MotionEvent e) Notified when a tap occurs with the up MotionEvent that triggered it.","abstract boolean onDown(MotionEvent e) Notified when a tap occurs with the down MotionEvent that triggered it.","abstract boolean onFling(MotionEvent e1, MotionEvent e2, float velocityX, float velocityY) Notified of a fling event when it occurs with the initial on down MotionEvent and the matching up MotionEvent.","abstract void onLongPress(MotionEvent e) Notified when a long press occurs with the initial on down MotionEvent that trigged it.","abstract boolean onScroll(MotionEvent e1, MotionEvent e2, float distanceX, float distanceY) Notified when a scroll occurs with the initial on down MotionEvent and the current move MotionEvent.","abstract void onShowPress(MotionEvent e) The user has performed a down MotionEvent and not performed a move or up yet.","abstract boolean onSingleTapUp(MotionEvent e) Notified when a tap occurs with the up MotionEvent that triggered it."],"package":"android.view","constants":[],"class":"GestureDetector.SimpleOnGestureListener","constructors":[],"fields":[]}