{"methods":["static String getEGLErrorString(int error) Return a string for the EGL error code, or the hex representation if the error is unknown.","static int getInternalFormat(Bitmap bitmap) return the internal format as defined by OpenGL ES of the supplied bitmap.","static int getType(Bitmap bitmap) Return the type as defined by OpenGL ES of the supplied bitmap, if there is one.","static void texImage2D(int target, int level, Bitmap bitmap, int border) A version of texImage2D that determines the internalFormat and type automatically.","static void texImage2D(int target, int level, int internalformat, Bitmap bitmap, int type, int border) A version of texImage2D() that takes an explicit type parameter as defined by the OpenGL ES specification.","static void texImage2D(int target, int level, int internalformat, Bitmap bitmap, int border) Calls glTexImage2D() on the current OpenGL context.","static void texSubImage2D(int target, int level, int xoffset, int yoffset, Bitmap bitmap) Calls glTexSubImage2D() on the current OpenGL context.","static void texSubImage2D(int target, int level, int xoffset, int yoffset, Bitmap bitmap, int format, int type) A version of texSubImage2D() that takes an explicit type parameter as defined by the OpenGL ES specification.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.opengl","constants":[],"class":"GLUtils","constructors":[],"fields":[]}