{"methods":["abstract ConnectionResult blockingConnect() Connects the client to Google Play services.","abstract ConnectionResult blockingConnect(long timeout, TimeUnit unit) Connects the client to Google Play services.","abstract void connect() Connects the client to Google Play services.","abstract void disconnect() Closes the connection to Google Play services.","abstract boolean isConnected() Checks if the client is currently connected to the service, so that requests to other methods will succeed.","abstract boolean isConnecting() Checks if the client is attempting to connect to the service.","abstract boolean isConnectionCallbacksRegistered(GoogleApiClient.ConnectionCallbacks listener) Returns true if the specified listener is currently registered to receive connection events.","abstract boolean isConnectionFailedListenerRegistered(GoogleApiClient.OnConnectionFailedListener listener) Returns true if the specified listener is currently registered to receive connection failed events.","abstract void reconnect() Closes the current connection to Google Play services and creates a new connection.","abstract void registerConnectionCallbacks(GoogleApiClient.ConnectionCallbacks listener) Registers a listener to receive connection events from this GoogleApiClient.","abstract void registerConnectionFailedListener(GoogleApiClient.OnConnectionFailedListener listener) Registers a listener to receive connection failed events from this GoogleApiClient.","abstract void stopAutoManage(FragmentActivity lifecycleActivity) Disconnects the client and stops automatic lifecycle management.","abstract void unregisterConnectionCallbacks(GoogleApiClient.ConnectionCallbacks listener) Removes a connection listener from this GoogleApiClient.","abstract void unregisterConnectionFailedListener(GoogleApiClient.OnConnectionFailedListener listener) Removes a connection failed listener from the GoogleApiClient."],"package":"com.google.android.gms.common.api","constants":[],"class":"GoogleApiClient","constructors":[],"fields":[]}