{"methods":["static void clearToken(Context context, String token) Clear the specified token in local cache with respect to the Context.","static List<AccountChangeEvent> getAccountChangeEvents(Context ctx, int eventIndex, String accountName) Get a list of events for the given account.","static String getAccountId(Context ctx, String accountName) Gets a stable account id for the given account name.","static String getAppCert(Context context, String packageNameToCertify)","static String getToken(Context context, String accountName, String scope) See getToken(Context, String, String, Bundle).","static String getToken(Context context, String accountName, String scope, Bundle extras) Gets a token to be consumed by some specified services on behalf of a specified user account.","static String getTokenWithNotification(Context context, String accountName, String scope, Bundle extras) Authenticates the user and returns a valid Google authentication token, or throws an Exception if there was an error while getting the token.","static String getTokenWithNotification(Context context, String accountName, String scope, Bundle extras, Intent callback) Authenticates the user and returns a valid Google authentication token, or throws an Exception if there was an error while getting the token.","static String getTokenWithNotification(Context context, String accountName, String scope, Bundle extras, String authority, Bundle syncBundle) Authenticates the user and returns a valid Google authentication token, or throws an Exception if there was an error while getting the token.","static void invalidateToken(Context context, String token) This method is deprecated. Deprecated because this function needs permissions MANAGE_ACCOUNTS and USE_CREDENTIALS to run. Please call clearToken(Context, String) instead.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.auth","constants":["int CHANGE_TYPE_ACCOUNT_ADDED Change types that can be represented in an AccountChangeEvent.","int CHANGE_TYPE_ACCOUNT_REMOVED","int CHANGE_TYPE_ACCOUNT_RENAMED_FROM A rename event that will contain extra data indicating the original account name.","int CHANGE_TYPE_ACCOUNT_RENAMED_TO A rename event that will contain extra data indicating the new account name.","String GOOGLE_ACCOUNT_TYPE Google Account type string.","String KEY_REQUEST_ACTIONS Bundle key for specifying which user's app activity (moment) types can be written to Google.","String KEY_REQUEST_VISIBLE_ACTIVITIES See KEY_REQUEST_ACTIONS","String KEY_SUPPRESS_PROGRESS_SCREEN Adding KEY_SUPPRESS_PROGRESS will suppress the progress screen shown when getting a token when added as a boolean true option while calling getToken(Context, String, String, Bundle)."],"class":"GoogleAuthUtil","constructors":[],"fields":[]}