{"methods":["final Circle addCircle(CircleOptions options) Add a circle to this map.","final GroundOverlay addGroundOverlay(GroundOverlayOptions options) Adds an image to this map.","final Marker addMarker(MarkerOptions options) Adds a marker to this map.","final Polygon addPolygon(PolygonOptions options) Adds a polygon to this map.","final Polyline addPolyline(PolylineOptions options) Adds a polyline to this map.","final TileOverlay addTileOverlay(TileOverlayOptions options) Adds a tile overlay to this map.","final void animateCamera(CameraUpdate update, int durationMs, GoogleMap.CancelableCallback callback) Moves the map according to the update with an animation over a specified duration, and calls an optional callback on completion.","final void animateCamera(CameraUpdate update, GoogleMap.CancelableCallback callback) Animates the movement of the camera from the current position to the position defined in the update and calls an optional callback on completion.","final void animateCamera(CameraUpdate update) Animates the movement of the camera from the current position to the position defined in the update.","final void clear() Removes all markers, polylines, polygons, overlays, etc from the map.","final CameraPosition getCameraPosition() Gets the current position of the camera.","IndoorBuilding getFocusedBuilding() Gets the currently focused building.","final int getMapType() Gets the type of map that's currently displayed.","final float getMaxZoomLevel() Returns the maximum zoom level for the current camera position.","final float getMinZoomLevel() Returns the minimum zoom level.","final Location getMyLocation() This method is deprecated. use FusedLocationProviderApi instead. FusedLocationProviderApi provides improved location finding and power usage and is used by the \"My Location\" blue dot. See the MyLocationDemoActivity in the sample applications folder for example example code, or the Location Developer Guide.","final Projection getProjection() Returns a Projection object that you can use to convert between screen coordinates and latitude/longitude coordinates.","final UiSettings getUiSettings() Gets the user interface settings for the map.","final boolean isBuildingsEnabled() Returns whether 3D buildings layer is enabled.","final boolean isIndoorEnabled() Gets whether indoor maps are currently enabled.","final boolean isMyLocationEnabled() Gets the status of the my-location layer.","final boolean isTrafficEnabled() Checks whether the map is drawing traffic data.","final void moveCamera(CameraUpdate update) Repositions the camera according to the instructions defined in the update.","final void setBuildingsEnabled(boolean enabled) Turns the 3D buildings layer on or off.","final boolean setIndoorEnabled(boolean enabled) Sets whether indoor maps should be enabled.","final void setInfoWindowAdapter(GoogleMap.InfoWindowAdapter adapter) Sets a custom renderer for the contents of info windows.","final void setLocationSource(LocationSource source) Replaces the location source of the my-location layer.","final void setMapType(int type) Sets the type of map tiles that should be displayed.","final void setMyLocationEnabled(boolean enabled) Enables or disables the my-location layer.","final void setOnCameraChangeListener(GoogleMap.OnCameraChangeListener listener) Sets a callback that's invoked when the camera changes.","final void setOnIndoorStateChangeListener(GoogleMap.OnIndoorStateChangeListener listener) Sets or clears the listener for indoor events.","final void setOnInfoWindowClickListener(GoogleMap.OnInfoWindowClickListener listener) Sets a callback that's invoked when a marker info window is clicked.","final void setOnMapClickListener(GoogleMap.OnMapClickListener listener) Sets a callback that's invoked when the map is tapped.","void setOnMapLoadedCallback(GoogleMap.OnMapLoadedCallback callback) Sets a callback that is invoked when this map has finished rendering.","final void setOnMapLongClickListener(GoogleMap.OnMapLongClickListener listener) Sets a callback that's invoked when the map is long pressed.","final void setOnMarkerClickListener(GoogleMap.OnMarkerClickListener listener) Sets a callback that's invoked when a marker is clicked.","final void setOnMarkerDragListener(GoogleMap.OnMarkerDragListener listener) Sets a callback that's invoked when a marker is dragged.","final void setOnMyLocationButtonClickListener(GoogleMap.OnMyLocationButtonClickListener listener) Sets a callback that's invoked when the my location button is clicked.","final void setOnMyLocationChangeListener(GoogleMap.OnMyLocationChangeListener listener) This method is deprecated. use FusedLocationProviderApi instead. FusedLocationProviderApi provides improved location finding and power usage and is used by the \"My Location\" blue dot. See the MyLocationDemoActivity in the sample applications folder for example example code, or the Location Developer Guide.","final void setPadding(int left, int top, int right, int bottom) Sets padding on the map.","final void setTrafficEnabled(boolean enabled) Turns the traffic layer on or off.","final void snapshot(GoogleMap.SnapshotReadyCallback callback, Bitmap bitmap) Takes a snapshot of the map.","final void snapshot(GoogleMap.SnapshotReadyCallback callback) Takes a snapshot of the map.","final void stopAnimation() Stops the camera animation if there is one in progress.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.maps","constants":["int MAP_TYPE_HYBRID Satellite maps with a transparent layer of major streets.","int MAP_TYPE_NONE No base map tiles.","int MAP_TYPE_NORMAL Basic maps.","int MAP_TYPE_SATELLITE Satellite maps with no labels.","int MAP_TYPE_TERRAIN Terrain maps."],"class":"GoogleMap","constructors":[],"fields":[]}