{"methods":["void dispatchLocalHits() Dispatches queued hits (view, events, or transactions) to Google Analytics if a network connection is available, and the local dispatching service is in use.","void enableAutoActivityReports(Application application) On devices running API level 14 (ICE_CREAM_SANDWICH) or above, applications can call this method in lieu of making explicit calls to reportActivityStart(Activity) and reportActivityStop(Activity).","boolean getAppOptOut() Returns whether the state of the application-level opt is on.","static GoogleAnalytics getInstance(Context context) Get the instance of the GoogleAnalytics class, creating it if necessary.","Logger getLogger() Return the current Logger implementation in use.","boolean isDryRunEnabled() Returns whether dry run mode is on.","Tracker newTracker(String trackingId) Returns a Tracker instance with the given trackingId.","Tracker newTracker(int configResId) Returns a Tracker instance preconfigured with the values specified in configResId.","void reportActivityStart(Activity activity) Report the start of an Activity, so that it can be tracked by any Trackers that have enabled auto activity tracking (see enableAutoActivityTracking(boolean).) This will also start a new session if necessary.","void reportActivityStop(Activity activity) Report the end of an Activity.","void setAppOptOut(boolean optOut) Sets or resets the application-level opt out flag.","void setDryRun(boolean dryRun) Toggles dry run mode.","void setLocalDispatchPeriod(int dispatchPeriodInSeconds) Sets dispatch period for the local dispatcher.","void setLogger(Logger logger) Provide a custom implementation of Logger to use.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.analytics","constants":[],"class":"GoogleAnalytics","constructors":[],"fields":[]}