{"methods":["static Dialog getErrorDialog(int errorCode, Activity activity, int requestCode) Returns a dialog to address the provided errorCode.","static Dialog getErrorDialog(int errorCode, Activity activity, int requestCode, DialogInterface.OnCancelListener cancelListener) Returns a dialog to address the provided errorCode.","static PendingIntent getErrorPendingIntent(int errorCode, Context context, int requestCode) Returns a PendingIntent to address the provided errorCode.","static String getErrorString(int errorCode) Returns a human-readable string of the error code returned from isGooglePlayServicesAvailable(Context).","static String getOpenSourceSoftwareLicenseInfo(Context context) Returns the open source software license information for the Google Play services application, or null if Google Play services is not available on this device.","static Context getRemoteContext(Context context) This gets the Context object of the Buddy APK.","static Resources getRemoteResource(Context context) This gets the Resources object of the Buddy APK.","static int isGooglePlayServicesAvailable(Context context) Verifies that Google Play services is installed and enabled on this device, and that the version installed on this device is no older than the one required by this client.","static boolean isGoogleSignedUid(PackageManager packageManager, int uid) Throws SecurityException if uid does not belong to a Google signed app.","static boolean isUserRecoverableError(int errorCode) Determines whether an error is user-recoverable.","static boolean showErrorDialogFragment(int errorCode, Activity activity, int requestCode) Display a DialogFragment for an error code returned by isGooglePlayServicesAvailable(Context).","static boolean showErrorDialogFragment(int errorCode, Activity activity, Fragment fragment, int requestCode, DialogInterface.OnCancelListener cancelListener)","static boolean showErrorDialogFragment(int errorCode, Activity activity, int requestCode, DialogInterface.OnCancelListener cancelListener) Display a DialogFragment for an error code returned by isGooglePlayServicesAvailable(Context).","static void showErrorNotification(int errorCode, Context context) Displays a notification relevant to the provided error code.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.common","constants":["String GMS_ERROR_DIALOG","String GOOGLE_PLAY_SERVICES_PACKAGE Package name for Google Play services.","int GOOGLE_PLAY_SERVICES_VERSION_CODE Google Play services client library version (declared in library's AndroidManifest.xml android:versionCode).","String GOOGLE_PLAY_STORE_PACKAGE Package name for Google Play services."],"class":"GooglePlayServicesUtil","constructors":[],"fields":[]}