{"methods":["static void apply(int gravity, int w, int h, Rect container, Rect outRect, int layoutDirection) Apply a gravity constant to an object and take care if layout direction is RTL or not.","static void apply(int gravity, int w, int h, Rect container, int xAdj, int yAdj, Rect outRect) Apply a gravity constant to an object.","static void apply(int gravity, int w, int h, Rect container, Rect outRect) Apply a gravity constant to an object.","static void apply(int gravity, int w, int h, Rect container, int xAdj, int yAdj, Rect outRect, int layoutDirection) Apply a gravity constant to an object.","static void applyDisplay(int gravity, Rect display, Rect inoutObj) Apply additional gravity behavior based on the overall \"display\" that an object exists in.","static void applyDisplay(int gravity, Rect display, Rect inoutObj, int layoutDirection) Apply additional gravity behavior based on the overall \"display\" that an object exists in.","static int getAbsoluteGravity(int gravity, int layoutDirection) Convert script specific gravity to absolute horizontal value.","static boolean isHorizontal(int gravity) Indicate whether the supplied gravity has an horizontal pull.","static boolean isVertical(int gravity) Indicate whether the supplied gravity has a vertical pull.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":["int AXIS_CLIP Raw bit controlling whether the right/bottom edge is clipped to its container, based on the gravity direction being applied.","int AXIS_PULL_AFTER Raw bit controlling how the right/bottom edge is placed.","int AXIS_PULL_BEFORE Raw bit controlling how the left/top edge is placed.","int AXIS_SPECIFIED Raw bit indicating the gravity for an axis has been specified.","int AXIS_X_SHIFT Bits defining the horizontal axis.","int AXIS_Y_SHIFT Bits defining the vertical axis.","int BOTTOM Push object to the bottom of its container, not changing its size.","int CENTER Place the object in the center of its container in both the vertical and horizontal axis, not changing its size.","int CENTER_HORIZONTAL Place object in the horizontal center of its container, not changing its size.","int CENTER_VERTICAL Place object in the vertical center of its container, not changing its size.","int CLIP_HORIZONTAL Flag to clip the edges of the object to its container along the horizontal axis.","int CLIP_VERTICAL Flag to clip the edges of the object to its container along the vertical axis.","int DISPLAY_CLIP_HORIZONTAL Special constant to enable clipping to an overall display along the horizontal dimension.","int DISPLAY_CLIP_VERTICAL Special constant to enable clipping to an overall display along the vertical dimension.","int END Push object to x-axis position at the end of its container, not changing its size.","int FILL Grow the horizontal and vertical size of the object if needed so it completely fills its container.","int FILL_HORIZONTAL Grow the horizontal size of the object if needed so it completely fills its container.","int FILL_VERTICAL Grow the vertical size of the object if needed so it completely fills its container.","int HORIZONTAL_GRAVITY_MASK Binary mask to get the absolute horizontal gravity of a gravity.","int LEFT Push object to the left of its container, not changing its size.","int NO_GRAVITY Constant indicating that no gravity has been set","int RELATIVE_HORIZONTAL_GRAVITY_MASK Binary mask for the horizontal gravity and script specific direction bit.","int RELATIVE_LAYOUT_DIRECTION Raw bit controlling whether the layout direction is relative or not (START/END instead of absolute LEFT/RIGHT).","int RIGHT Push object to the right of its container, not changing its size.","int START Push object to x-axis position at the start of its container, not changing its size.","int TOP Push object to the top of its container, not changing its size.","int VERTICAL_GRAVITY_MASK Binary mask to get the vertical gravity of a gravity."],"class":"Gravity","constructors":[],"fields":[]}