{"methods":["int getSpanIndex(int position, int spanCount) Returns the final span index of the provided position.","int getSpanSize(int position) Returns the number of span occupied by the item at position.","[Expand] Inherited Methods","From class android.support.v7.widget.GridLayoutManager.SpanSizeLookup int getSpanGroupIndex(int adapterPosition, int spanCount) Returns the index of the group this position belongs. int getSpanIndex(int position, int spanCount) Returns the final span index of the provided position. abstract int getSpanSize(int position) Returns the number of span occupied by the item at position. void invalidateSpanIndexCache() Clears the span index cache. boolean isSpanIndexCacheEnabled() Returns whether results of getSpanIndex(int, int) method are cached or not. void setSpanIndexCacheEnabled(boolean cacheSpanIndices) Sets whether the results of getSpanIndex(int, int) method should be cached or not.","int getSpanGroupIndex(int adapterPosition, int spanCount) Returns the index of the group this position belongs.","int getSpanIndex(int position, int spanCount) Returns the final span index of the provided position.","abstract int getSpanSize(int position) Returns the number of span occupied by the item at position.","void invalidateSpanIndexCache() Clears the span index cache.","boolean isSpanIndexCacheEnabled() Returns whether results of getSpanIndex(int, int) method are cached or not.","void setSpanIndexCacheEnabled(boolean cacheSpanIndices) Sets whether the results of getSpanIndex(int, int) method should be cached or not.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.widget","constants":[],"class":"GridLayoutManager.DefaultSpanSizeLookup","constructors":[],"fields":[]}