{"methods":["void addHeader(Header header) Adds the given header to the group.","void clear() Removes any contained headers.","Object clone() Creates and returns a copy of this Object.","boolean containsHeader(String name) Tests if headers with the given name are contained within this group.","HeaderGroup copy() Returns a copy of this object","Header[] getAllHeaders() Gets all of the headers contained within this group.","Header getCondensedHeader(String name) Gets a header representing all of the header values with the given name.","Header getFirstHeader(String name) Gets the first header with the given name.","Header[] getHeaders(String name) Gets all of the headers with the given name.","Header getLastHeader(String name) Gets the last header with the given name.","HeaderIterator iterator() Returns an iterator over this group of headers.","HeaderIterator iterator(String name) Returns an iterator over the headers with a given name in this group.","void removeHeader(Header header) Removes the given header.","void setHeaders(Header[] headers) Sets all of the headers contained within this group overriding any existing headers.","void updateHeader(Header header) Replaces the first occurence of the header with the same name.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http.message","constants":[],"class":"HeaderGroup","constructors":[],"fields":[]}