{"methods":["abstract HttpEntity getEntity() Obtains the message entity of this response, if any.","abstract Locale getLocale() Obtains the locale of this response.","abstract StatusLine getStatusLine() Obtains the status line of this response.","abstract void setEntity(HttpEntity entity) Associates a response entity with this response.","abstract void setLocale(Locale loc) Changes the locale of this response.","abstract void setReasonPhrase(String reason) Updates the status line of this response with a new reason phrase.","abstract void setStatusCode(int code) Updates the status line of this response with a new status code.","abstract void setStatusLine(StatusLine statusline) Sets the status line of this response.","abstract void setStatusLine(ProtocolVersion ver, int code) Sets the status line of this response.","abstract void setStatusLine(ProtocolVersion ver, int code, String reason) Sets the status line of this response with a reason phrase.","[Expand] Inherited Methods","From interface org.apache.http.HttpMessage abstract void addHeader(Header header) Adds a header to this message. abstract void addHeader(String name, String value) Adds a header to this message. abstract boolean containsHeader(String name) Checks if a certain header is present in this message. abstract Header[] getAllHeaders() Returns all the headers of this message. abstract Header getFirstHeader(String name) Returns the first header with a specified name of this message. abstract Header[] getHeaders(String name) Returns all the headers with a specified name of this message. abstract Header getLastHeader(String name) Returns the last header with a specified name of this message. abstract HttpParams getParams() Returns the parameters effective for this message as set by setParams(HttpParams). abstract ProtocolVersion getProtocolVersion() Returns the protocol version this message is compatible with. abstract HeaderIterator headerIterator(String name) Returns an iterator of the headers with a given name. abstract HeaderIterator headerIterator() Returns an iterator of all the headers. abstract void removeHeader(Header header) Removes a header from this message. abstract void removeHeaders(String name) Removes all headers with a certain name from this message. abstract void setHeader(Header header) Overwrites the first header with the same name. abstract void setHeader(String name, String value) Overwrites the first header with the same name. abstract void setHeaders(Header[] headers) Overwrites all the headers in the message. abstract void setParams(HttpParams params) Provides parameters to be used for the processing of this message.","abstract void addHeader(Header header) Adds a header to this message.","abstract void addHeader(String name, String value) Adds a header to this message.","abstract boolean containsHeader(String name) Checks if a certain header is present in this message.","abstract Header[] getAllHeaders() Returns all the headers of this message.","abstract Header getFirstHeader(String name) Returns the first header with a specified name of this message.","abstract Header[] getHeaders(String name) Returns all the headers with a specified name of this message.","abstract Header getLastHeader(String name) Returns the last header with a specified name of this message.","abstract HttpParams getParams() Returns the parameters effective for this message as set by setParams(HttpParams).","abstract ProtocolVersion getProtocolVersion() Returns the protocol version this message is compatible with.","abstract HeaderIterator headerIterator(String name) Returns an iterator of the headers with a given name.","abstract HeaderIterator headerIterator() Returns an iterator of all the headers.","abstract void removeHeader(Header header) Removes a header from this message.","abstract void removeHeaders(String name) Removes all headers with a certain name from this message.","abstract void setHeader(Header header) Overwrites the first header with the same name.","abstract void setHeader(String name, String value) Overwrites the first header with the same name.","abstract void setHeaders(Header[] headers) Overwrites all the headers in the message.","abstract void setParams(HttpParams params) Provides parameters to be used for the processing of this message."],"package":"org.apache.http","constants":[],"class":"HttpResponse","constructors":[],"fields":[]}