{"methods":["static String getContentCharset(HttpParams params) Returns the default charset to be used for writing content body, when no charset explicitly specified.","static String getHttpElementCharset(HttpParams params) Returns the charset to be used for writing HTTP headers.","static String getUserAgent(HttpParams params)","static ProtocolVersion getVersion(HttpParams params) Returns protocol version to be used per default.","static void setContentCharset(HttpParams params, String charset) Sets the default charset to be used for writing content body, when no charset explicitly specified.","static void setHttpElementCharset(HttpParams params, String charset) Sets the charset to be used for writing HTTP headers.","static void setUseExpectContinue(HttpParams params, boolean b)","static void setUserAgent(HttpParams params, String useragent)","static void setVersion(HttpParams params, ProtocolVersion version) Assigns the protocol version to be used by the HTTP methods that this collection of parameters applies to.","static boolean useExpectContinue(HttpParams params)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http.params","constants":["[Expand] Inherited Constants","From interface org.apache.http.params.CoreProtocolPNames String HTTP_CONTENT_CHARSET Defines the charset to be used per default for encoding content body. String HTTP_ELEMENT_CHARSET Defines the charset to be used for encoding HTTP protocol elements. String ORIGIN_SERVER Defines the content of the Server header. String PROTOCOL_VERSION Defines the protocol version used per default. String STRICT_TRANSFER_ENCODING Defines whether responses with an invalid Transfer-Encoding header should be rejected. String USER_AGENT Defines the content of the User-Agent header. String USE_EXPECT_CONTINUE Activates 'Expect: 100-continue' handshake for the entity enclosing methods. String WAIT_FOR_CONTINUE Defines the maximum period of time in milliseconds the client should spend waiting for a 100-continue response.","String HTTP_CONTENT_CHARSET Defines the charset to be used per default for encoding content body.","String HTTP_ELEMENT_CHARSET Defines the charset to be used for encoding HTTP protocol elements.","String ORIGIN_SERVER Defines the content of the Server header.","String PROTOCOL_VERSION Defines the protocol version used per default.","String STRICT_TRANSFER_ENCODING Defines whether responses with an invalid Transfer-Encoding header should be rejected.","String USER_AGENT Defines the content of the User-Agent header.","String USE_EXPECT_CONTINUE Activates 'Expect: 100-continue' handshake for the entity enclosing methods.","String WAIT_FOR_CONTINUE Defines the maximum period of time in milliseconds the client should spend waiting for a 100-continue response."],"class":"HttpProtocolParams","constructors":[],"fields":[]}