{"methods":["void close() Uninstalls the cache and releases any active resources.","void delete() Uninstalls the cache and deletes all of its stored contents.","void flush() Force buffered operations to the filesystem.","CacheResponse get(URI uri, String requestMethod, Map<String, List<String>> requestHeaders) Returns the cached response corresponding to the given request.","int getHitCount() Returns the number of HTTP requests whose response was provided by the cache.","static HttpResponseCache getInstalled() Returns the currently-installed HttpResponseCache, or null if there is no cache installed or it is not a HttpResponseCache.","int getNetworkCount() Returns the number of HTTP requests that required the network to either supply a response or validate a locally cached response.","int getRequestCount() Returns the total number of HTTP requests that were made.","static HttpResponseCache install(File directory, long maxSize) Creates a new HTTP response cache and sets it as the system default cache.","long maxSize() Returns the maximum number of bytes that this cache should use to store its data.","CacheRequest put(URI uri, URLConnection urlConnection) Allows the protocol handler to cache data after retrieving resources.","long size() Returns the number of bytes currently being used to store the values in this cache.","[Expand] Inherited Methods","From class java.net.ResponseCache abstract CacheResponse get(URI uri, String requestMethod, Map<String, List<String>> requestHeaders) Returns the cached response corresponding to the given request. static ResponseCache getDefault() Returns the system's default response cache, or null. abstract CacheRequest put(URI uri, URLConnection connection) Allows the protocol handler to cache data after retrieving resources. static void setDefault(ResponseCache responseCache) Sets the system's default response cache.","abstract CacheResponse get(URI uri, String requestMethod, Map<String, List<String>> requestHeaders) Returns the cached response corresponding to the given request.","static ResponseCache getDefault() Returns the system's default response cache, or null.","abstract CacheRequest put(URI uri, URLConnection connection) Allows the protocol handler to cache data after retrieving resources.","static void setDefault(ResponseCache responseCache) Sets the system's default response cache.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"android.net.http","constants":[],"class":"HttpResponseCache","constructors":[],"fields":[]}