{"methods":["Object clone() Creates and returns a copy of this Object.","static boolean domainMatches(String domainPattern, String host) Returns true if host matches the domain pattern domain.","boolean equals(Object object) Returns true if object is a cookie with the same domain, name and path.","String getComment() Returns the Comment attribute.","String getCommentURL() Returns the value of CommentURL attribute.","boolean getDiscard() Returns the Discard attribute.","String getDomain() Returns the Domain attribute.","long getMaxAge() Returns the Max-Age attribute, in delta-seconds.","String getName() Returns the name of this cookie.","String getPath() Returns the Path attribute.","String getPortlist() Returns the Port attribute, usually containing comma-separated port numbers.","boolean getSecure() Returns the Secure attribute.","String getValue() Returns the value of this cookie.","int getVersion() Returns the version of this cookie.","boolean hasExpired() Returns true if this cookie's Max-Age is 0.","int hashCode() Returns the hash code of this HTTP cookie:    name.toLowerCase(Locale.US).hashCode()\n       + (domain == null ? 0 : domain.toLowerCase(Locale.US).hashCode())\n       + (path == null ? 0 : path.hashCode())","static List<HttpCookie> parse(String header) Constructs a cookie from a string.","void setComment(String comment) Set the Comment attribute of this cookie.","void setCommentURL(String commentURL) Set the CommentURL attribute of this cookie.","void setDiscard(boolean discard) Set the Discard attribute of this cookie.","void setDomain(String pattern) Set the Domain attribute of this cookie.","void setMaxAge(long deltaSeconds) Sets the Max-Age attribute of this cookie.","void setPath(String path) Set the Path attribute of this cookie.","void setPortlist(String portList) Set the Port attribute of this cookie.","void setSecure(boolean secure) Sets the Secure attribute of this cookie.","void setValue(String value) Sets the opaque value of this cookie.","void setVersion(int newVersion) Sets the Version attribute of the cookie.","String toString() Returns a string representing this cookie in the format used by the Cookie header line in an HTTP request as specified by RFC 2965 section 3.3.4.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"HttpCookie","constructors":[],"fields":[]}