{"methods":["abstract void dump(FileDescriptor fd, String[] args) Print the object's state into the given stream.","abstract void dumpAsync(FileDescriptor fd, String[] args) Like dump(FileDescriptor, String[]) but always executes asynchronously.","abstract String getInterfaceDescriptor() Get the canonical name of the interface supported by this binder.","abstract boolean isBinderAlive() Check to see if the process that the binder is in is still alive.","abstract void linkToDeath(IBinder.DeathRecipient recipient, int flags) Register the recipient for a notification if this binder goes away.","abstract boolean pingBinder() Check to see if the object still exists.","abstract IInterface queryLocalInterface(String descriptor) Attempt to retrieve a local implementation of an interface for this Binder object.","abstract boolean transact(int code, Parcel data, Parcel reply, int flags) Perform a generic operation with the object.","abstract boolean unlinkToDeath(IBinder.DeathRecipient recipient, int flags) Remove a previously registered death notification."],"package":"android.os","constants":["int DUMP_TRANSACTION IBinder protocol transaction code: dump internal state.","int FIRST_CALL_TRANSACTION The first transaction code available for user commands.","int FLAG_ONEWAY Flag to transact(int, Parcel, Parcel, int): this is a one-way call, meaning that the caller returns immediately, without waiting for a result from the callee.","int INTERFACE_TRANSACTION IBinder protocol transaction code: interrogate the recipient side of the transaction for its canonical interface descriptor.","int LAST_CALL_TRANSACTION The last transaction code available for user commands.","int LIKE_TRANSACTION IBinder protocol transaction code: tell an app asynchronously that the caller likes it.","int PING_TRANSACTION IBinder protocol transaction code: pingBinder().","int TWEET_TRANSACTION IBinder protocol transaction code: send a tweet to the target object."],"class":"IBinder","constructors":[],"fields":[]}