{"methods":["synchronized void end() Releases resources associated with this Inflater.","synchronized boolean finished() Indicates if the Inflater has inflated the entire deflated stream.","synchronized int getAdler() Returns the Adler32 checksum of the bytes inflated so far, or the checksum of the preset dictionary if needsDictionary() returns true.","synchronized long getBytesRead() Returns the total number of bytes read by the Inflater.","synchronized long getBytesWritten() Returns a the total number of bytes written by this Inflater.","synchronized int getRemaining() Returns the number of bytes of current input remaining to be read by this inflater.","synchronized int getTotalIn() Returns the total number of bytes of input read by this Inflater.","synchronized int getTotalOut() Returns the total number of bytes written to the output buffer by this Inflater.","synchronized int inflate(byte[] buf, int offset, int byteCount) Inflates up to byteCount bytes from the current input and stores them in buf starting at offset.","int inflate(byte[] buf) Inflates bytes from the current input and stores them in buf.","synchronized boolean needsDictionary() Returns true if the input bytes were compressed with a preset dictionary.","synchronized boolean needsInput() Returns true if setInput(byte[]) must be called before inflation can continue.","synchronized void reset() Resets this Inflater.","synchronized void setDictionary(byte[] dictionary, int offset, int byteCount) Sets the preset dictionary to be used for inflation to a subsequence of dictionary starting at offset and continuing for byteCount bytes.","synchronized void setDictionary(byte[] dictionary) Sets the preset dictionary to be used for inflation to dictionary.","synchronized void setInput(byte[] buf, int offset, int byteCount) Sets the current input to to be decompressed.","synchronized void setInput(byte[] buf) Sets the current input to to be decompressed.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.zip","constants":[],"class":"Inflater","constructors":[],"fields":[]}