{"methods":["final Iterator<String> actionsIterator() Return an iterator over the filter's actions.","final void addAction(String action) Add a new Intent action to match against.","final void addCategory(String category) Add a new Intent category to match against.","final void addDataAuthority(String host, String port) Add a new Intent data authority to match against.","final void addDataPath(String path, int type) Add a new Intent data path to match against.","final void addDataScheme(String scheme) Add a new Intent data scheme to match against.","final void addDataSchemeSpecificPart(String ssp, int type) Add a new Intent data \"scheme specific part\" to match against.","final void addDataType(String type) Add a new Intent data type to match against.","final Iterator<IntentFilter.AuthorityEntry> authoritiesIterator() Return an iterator over the filter's data authorities.","final Iterator<String> categoriesIterator() Return an iterator over the filter's categories.","final int countActions() Return the number of actions in the filter.","final int countCategories() Return the number of categories in the filter.","final int countDataAuthorities() Return the number of data authorities in the filter.","final int countDataPaths() Return the number of data paths in the filter.","final int countDataSchemeSpecificParts() Return the number of data scheme specific parts in the filter.","final int countDataSchemes() Return the number of data schemes in the filter.","final int countDataTypes() Return the number of data types in the filter.","static IntentFilter create(String action, String dataType) Create a new IntentFilter instance with a specified action and MIME type, where you know the MIME type is correctly formatted.","final int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","void dump(Printer du, String prefix)","final String getAction(int index) Return an action in the filter.","final String getCategory(int index) Return a category in the filter.","final IntentFilter.AuthorityEntry getDataAuthority(int index) Return a data authority in the filter.","final PatternMatcher getDataPath(int index) Return a data path in the filter.","final String getDataScheme(int index) Return a data scheme in the filter.","final PatternMatcher getDataSchemeSpecificPart(int index) Return a data scheme specific part in the filter.","final String getDataType(int index) Return a data type in the filter.","final int getPriority() Return the priority of this filter.","final boolean hasAction(String action) Is the given action included in the filter? Note that if the filter does not include any actions, false will always be returned.","final boolean hasCategory(String category) Is the given category included in the filter?","final boolean hasDataAuthority(Uri data) Is the given data authority included in the filter? Note that if the filter does not include any authorities, false will always be returned.","final boolean hasDataPath(String data) Is the given data path included in the filter? Note that if the filter does not include any paths, false will always be returned.","final boolean hasDataScheme(String scheme) Is the given data scheme included in the filter? Note that if the filter does not include any scheme, false will always be returned.","final boolean hasDataSchemeSpecificPart(String data) Is the given data scheme specific part included in the filter? Note that if the filter does not include any scheme specific parts, false will always be returned.","final boolean hasDataType(String type) Is the given data type included in the filter? Note that if the filter does not include any type, false will always be returned.","final int match(ContentResolver resolver, Intent intent, boolean resolve, String logTag) Test whether this filter matches the given intent.","final int match(String action, String type, String scheme, Uri data, Set<String> categories, String logTag) Test whether this filter matches the given intent data.","final boolean matchAction(String action) Match this filter against an Intent's action.","final String matchCategories(Set<String> categories) Match this filter against an Intent's categories.","final int matchData(String type, String scheme, Uri data) Match this filter against an Intent's data (type, scheme and path).","final int matchDataAuthority(Uri data) Match this intent filter against the given Intent data.","final Iterator<PatternMatcher> pathsIterator() Return an iterator over the filter's data paths.","void readFromXml(XmlPullParser parser)","final Iterator<PatternMatcher> schemeSpecificPartsIterator() Return an iterator over the filter's data scheme specific parts.","final Iterator<String> schemesIterator() Return an iterator over the filter's data schemes.","final void setPriority(int priority) Modify priority of this filter.","final Iterator<String> typesIterator() Return an iterator over the filter's data types.","final void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","void writeToXml(XmlSerializer serializer) Write the contents of the IntentFilter as an XML stream.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.content","constants":["int MATCH_ADJUSTMENT_MASK The part of a match constant that applies a quality adjustment to the basic category of match.","int MATCH_ADJUSTMENT_NORMAL Quality adjustment applied to the category of match that signifies the default, base value; higher numbers improve the quality while lower numbers reduce it.","int MATCH_CATEGORY_EMPTY The filter matched an intent that had no data specified.","int MATCH_CATEGORY_HOST The filter matched an intent with the same data URI scheme and authority host.","int MATCH_CATEGORY_MASK The part of a match constant that describes the category of match that occurred.","int MATCH_CATEGORY_PATH The filter matched an intent with the same data URI scheme, authority, and path.","int MATCH_CATEGORY_PORT The filter matched an intent with the same data URI scheme and authority host and port.","int MATCH_CATEGORY_SCHEME The filter matched an intent with the same data URI scheme.","int MATCH_CATEGORY_SCHEME_SPECIFIC_PART The filter matched an intent with the same data URI scheme and scheme specific part.","int MATCH_CATEGORY_TYPE The filter matched an intent with the same data MIME type.","int NO_MATCH_ACTION The filter didn't match due to different actions.","int NO_MATCH_CATEGORY The filter didn't match because it required one or more categories that were not in the Intent.","int NO_MATCH_DATA The filter didn't match due to different data URIs.","int NO_MATCH_TYPE The filter didn't match due to different MIME types.","int SYSTEM_HIGH_PRIORITY The filter setPriority(int) value at which system high-priority receivers are placed; that is, receivers that should execute before application code.","int SYSTEM_LOW_PRIORITY The filter setPriority(int) value at which system low-priority receivers are placed; that is, receivers that should execute after application code.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"IntentFilter","constructors":[],"fields":["public static final Creator<IntentFilter> CREATOR"]}