{"methods":["abstract ItemScope getAbout() The subject matter of the content.","abstract List<String> getAdditionalName() An additional name for a Person, can be used for a middle name.","abstract ItemScope getAddress() Postal address.","abstract String getAddressCountry() Address country.","abstract String getAddressLocality() Address locality.","abstract String getAddressRegion() Address region.","abstract List<ItemScope> getAssociated_media() The encoding.","abstract int getAttendeeCount() Number of attendees.","abstract List<ItemScope> getAttendees() A person attending the event.","abstract ItemScope getAudio() From http://schema.org/MusicRecording, the audio file.","abstract List<ItemScope> getAuthor() The person or persons who created this result.","abstract String getBestRating() Best possible rating value that a result might obtain.","abstract String getBirthDate() Date of birth.","abstract ItemScope getByArtist() From http://schema.org/MusicRecording, the artist that performed this recording.","abstract String getCaption() The caption for this object.","abstract String getContentSize() File size in (mega/kilo) bytes.","abstract String getContentUrl() Actual bytes of the media object, for example the image file or video file.","abstract List<ItemScope> getContributor() A list of contributors to this result.","abstract String getDateCreated() The date the result was created such as the date that a review was first created.","abstract String getDateModified() The date the result was last modified such as the date that a review was last edited.","abstract String getDatePublished() The initial date that the result was published.","abstract String getDescription() The string that describes the content of the result.","abstract String getDuration() The duration of the item (movie, audio recording, event, etc.) in ISO 8601 date format.","abstract String getEmbedUrl() A URL pointing to a player for a specific video.","abstract String getEndDate() The end date and time of the event (in ISO 8601 date format).","abstract String getFamilyName() Family name.","abstract String getGender() Gender of the person.","abstract ItemScope getGeo() Geo coordinates.","abstract String getGivenName() Given name.","abstract String getHeight() The height of the media object.","abstract String getId() An identifier for the target.","abstract String getImage() A URL to the image that represents this result.","abstract ItemScope getInAlbum() From http://schema.org/MusicRecording, which album a song is in.","abstract double getLatitude() Latitude.","abstract ItemScope getLocation() The location of the event or organization.","abstract double getLongitude() Longitude.","abstract String getName() The name of the result.","abstract ItemScope getPartOfTVSeries() Property of http://schema.org/TVEpisode indicating which series the episode belongs to.","abstract List<ItemScope> getPerformers() The main performer or performers of the event-for example, a presenter, musician, or actor.","abstract String getPlayerType() Player type that is required.","abstract String getPostOfficeBoxNumber() Post office box number.","abstract String getPostalCode() Postal code.","abstract String getRatingValue() Rating value.","abstract ItemScope getReviewRating() Review rating.","abstract String getStartDate() The start date and time of the event (in ISO 8601 date format).","abstract String getStreetAddress() Street address.","abstract String getText() The text that is the result of the app activity.","abstract ItemScope getThumbnail() Thumbnail image for an image or video.","abstract String getThumbnailUrl() A URL to a thumbnail image that represents this result.","abstract String getTickerSymbol() The exchange traded instrument associated with a Corporation object.","abstract String getType() The schema.org URL that best describes the referenced target and matches the type of moment.","abstract String getUrl() The URL that points to the result object.","abstract String getWidth() The width of the media object.","abstract String getWorstRating() Worst possible rating value that a result might obtain.","abstract boolean hasAbout() Indicates whether the \"about\" field is explicitly set to a value.","abstract boolean hasAdditionalName() Indicates whether the \"additionalName\" field is explicitly set to a value.","abstract boolean hasAddress() Indicates whether the \"address\" field is explicitly set to a value.","abstract boolean hasAddressCountry() Indicates whether the \"addressCountry\" field is explicitly set to a value.","abstract boolean hasAddressLocality() Indicates whether the \"addressLocality\" field is explicitly set to a value.","abstract boolean hasAddressRegion() Indicates whether the \"addressRegion\" field is explicitly set to a value.","abstract boolean hasAssociated_media() Indicates whether the \"associated_media\" field is explicitly set to a value.","abstract boolean hasAttendeeCount() Indicates whether the \"attendeeCount\" field is explicitly set to a value.","abstract boolean hasAttendees() Indicates whether the \"attendees\" field is explicitly set to a value.","abstract boolean hasAudio() Indicates whether the \"audio\" field is explicitly set to a value.","abstract boolean hasAuthor() Indicates whether the \"author\" field is explicitly set to a value.","abstract boolean hasBestRating() Indicates whether the \"bestRating\" field is explicitly set to a value.","abstract boolean hasBirthDate() Indicates whether the \"birthDate\" field is explicitly set to a value.","abstract boolean hasByArtist() Indicates whether the \"byArtist\" field is explicitly set to a value.","abstract boolean hasCaption() Indicates whether the \"caption\" field is explicitly set to a value.","abstract boolean hasContentSize() Indicates whether the \"contentSize\" field is explicitly set to a value.","abstract boolean hasContentUrl() Indicates whether the \"contentUrl\" field is explicitly set to a value.","abstract boolean hasContributor() Indicates whether the \"contributor\" field is explicitly set to a value.","abstract boolean hasDateCreated() Indicates whether the \"dateCreated\" field is explicitly set to a value.","abstract boolean hasDateModified() Indicates whether the \"dateModified\" field is explicitly set to a value.","abstract boolean hasDatePublished() Indicates whether the \"datePublished\" field is explicitly set to a value.","abstract boolean hasDescription() Indicates whether the \"description\" field is explicitly set to a value.","abstract boolean hasDuration() Indicates whether the \"duration\" field is explicitly set to a value.","abstract boolean hasEmbedUrl() Indicates whether the \"embedUrl\" field is explicitly set to a value.","abstract boolean hasEndDate() Indicates whether the \"endDate\" field is explicitly set to a value.","abstract boolean hasFamilyName() Indicates whether the \"familyName\" field is explicitly set to a value.","abstract boolean hasGender() Indicates whether the \"gender\" field is explicitly set to a value.","abstract boolean hasGeo() Indicates whether the \"geo\" field is explicitly set to a value.","abstract boolean hasGivenName() Indicates whether the \"givenName\" field is explicitly set to a value.","abstract boolean hasHeight() Indicates whether the \"height\" field is explicitly set to a value.","abstract boolean hasId() Indicates whether the \"id\" field is explicitly set to a value.","abstract boolean hasImage() Indicates whether the \"image\" field is explicitly set to a value.","abstract boolean hasInAlbum() Indicates whether the \"inAlbum\" field is explicitly set to a value.","abstract boolean hasLatitude() Indicates whether the \"latitude\" field is explicitly set to a value.","abstract boolean hasLocation() Indicates whether the \"location\" field is explicitly set to a value.","abstract boolean hasLongitude() Indicates whether the \"longitude\" field is explicitly set to a value.","abstract boolean hasName() Indicates whether the \"name\" field is explicitly set to a value.","abstract boolean hasPartOfTVSeries() Indicates whether the \"partOfTVSeries\" field is explicitly set to a value.","abstract boolean hasPerformers() Indicates whether the \"performers\" field is explicitly set to a value.","abstract boolean hasPlayerType() Indicates whether the \"playerType\" field is explicitly set to a value.","abstract boolean hasPostOfficeBoxNumber() Indicates whether the \"postOfficeBoxNumber\" field is explicitly set to a value.","abstract boolean hasPostalCode() Indicates whether the \"postalCode\" field is explicitly set to a value.","abstract boolean hasRatingValue() Indicates whether the \"ratingValue\" field is explicitly set to a value.","abstract boolean hasReviewRating() Indicates whether the \"reviewRating\" field is explicitly set to a value.","abstract boolean hasStartDate() Indicates whether the \"startDate\" field is explicitly set to a value.","abstract boolean hasStreetAddress() Indicates whether the \"streetAddress\" field is explicitly set to a value.","abstract boolean hasText() Indicates whether the \"text\" field is explicitly set to a value.","abstract boolean hasThumbnail() Indicates whether the \"thumbnail\" field is explicitly set to a value.","abstract boolean hasThumbnailUrl() Indicates whether the \"thumbnailUrl\" field is explicitly set to a value.","abstract boolean hasTickerSymbol() Indicates whether the \"tickerSymbol\" field is explicitly set to a value.","abstract boolean hasType() Indicates whether the \"type\" field is explicitly set to a value.","abstract boolean hasUrl() Indicates whether the \"url\" field is explicitly set to a value.","abstract boolean hasWidth() Indicates whether the \"width\" field is explicitly set to a value.","abstract boolean hasWorstRating() Indicates whether the \"worstRating\" field is explicitly set to a value.","[Expand] Inherited Methods","From interface com.google.android.gms.common.data.Freezable abstract T freeze() Freeze a volatile representation into an immutable representation. abstract boolean isDataValid() Check to see if this object is valid for use.","abstract T freeze() Freeze a volatile representation into an immutable representation.","abstract boolean isDataValid() Check to see if this object is valid for use."],"package":"com.google.android.gms.plus.model.moments","constants":[],"class":"ItemScope","constructors":[],"fields":[]}