{"methods":["void close() Closes this JarFile.","Enumeration<JarEntry> entries() Return an enumeration containing the JarEntrys contained in this JarFile.","ZipEntry getEntry(String name) Return the JarEntry specified by name or null if no such entry exists.","InputStream getInputStream(ZipEntry ze) Return an InputStream for reading the decompressed contents of ZIP entry.","JarEntry getJarEntry(String name) Return the JarEntry specified by its name or null if no such entry exists.","Manifest getManifest() Returns the Manifest object associated with this JarFile or null if no MANIFEST entry exists.","[Expand] Inherited Methods","From class java.util.zip.ZipFile void close() Closes this zip file. Enumeration<? extends ZipEntry> entries() Returns an enumeration of the entries. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. String getComment() Returns this file's comment, or null if it doesn't have one. ZipEntry getEntry(String entryName) Returns the zip entry with the given name, or null if there is no such entry. InputStream getInputStream(ZipEntry entry) Returns an input stream on the data of the specified ZipEntry. String getName() Gets the file name of this ZipFile. int size() Returns the number of ZipEntries in this ZipFile.","void close() Closes this zip file.","Enumeration<? extends ZipEntry> entries() Returns an enumeration of the entries.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","String getComment() Returns this file's comment, or null if it doesn't have one.","ZipEntry getEntry(String entryName) Returns the zip entry with the given name, or null if there is no such entry.","InputStream getInputStream(ZipEntry entry) Returns an input stream on the data of the specified ZipEntry.","String getName() Gets the file name of this ZipFile.","int size() Returns the number of ZipEntries in this ZipFile.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"java.util.jar","constants":["String MANIFEST_NAME The MANIFEST file name.","[Expand] Inherited Constants","From class java.util.zip.ZipFile int CENATT int CENATX int CENCOM int CENCRC int CENDSK int CENEXT int CENFLG int CENHDR int CENHOW int CENLEN int CENNAM int CENOFF long CENSIG int CENSIZ int CENTIM int CENVEM int CENVER int ENDCOM int ENDHDR int ENDOFF long ENDSIG int ENDSIZ int ENDSUB int ENDTOT int EXTCRC int EXTHDR int EXTLEN long EXTSIG int EXTSIZ int LOCCRC int LOCEXT int LOCFLG int LOCHDR int LOCHOW int LOCLEN int LOCNAM long LOCSIG int LOCSIZ int LOCTIM int LOCVER int OPEN_DELETE Delete zip file when closed. int OPEN_READ Open zip file for reading.","int CENATT","int CENATX","int CENCOM","int CENCRC","int CENDSK","int CENEXT","int CENFLG","int CENHDR","int CENHOW","int CENLEN","int CENNAM","int CENOFF","long CENSIG","int CENSIZ","int CENTIM","int CENVEM","int CENVER","int ENDCOM","int ENDHDR","int ENDOFF","long ENDSIG","int ENDSIZ","int ENDSUB","int ENDTOT","int EXTCRC","int EXTHDR","int EXTLEN","long EXTSIG","int EXTSIZ","int LOCCRC","int LOCEXT","int LOCFLG","int LOCHDR","int LOCHOW","int LOCLEN","int LOCNAM","long LOCSIG","int LOCSIZ","int LOCTIM","int LOCVER","int OPEN_DELETE Delete zip file when closed.","int OPEN_READ Open zip file for reading."],"class":"JarFile","constructors":[],"fields":[]}