{"methods":["boolean clearQueue() Empties the segment queue, and clears all clips that are scheduled for playback.","Object clone() Cloning a JetPlayer instance is not supported.","boolean closeJetFile() Closes the resource containing the JET content.","static JetPlayer getJetPlayer() Factory method for the JetPlayer class.","static int getMaxTracks() Returns the maximum number of simultaneous MIDI tracks supported by JetPlayer","boolean loadJetFile(AssetFileDescriptor afd) Loads a .jet file from an asset file descriptor.","boolean loadJetFile(String path) Loads a .jet file from a given path.","boolean pause() Pauses the playback of the JET segment queue.","boolean play() Starts playing the JET segment queue.","boolean queueJetSegment(int segmentNum, int libNum, int repeatCount, int transpose, int muteFlags, byte userID) Queues the specified segment in the JET queue.","boolean queueJetSegmentMuteArray(int segmentNum, int libNum, int repeatCount, int transpose, boolean[] muteArray, byte userID) Queues the specified segment in the JET queue.","void release() Stops the current JET playback, and releases all associated native resources.","void setEventListener(JetPlayer.OnJetEventListener listener, Handler handler) Sets the listener JetPlayer notifies when a JET event is generated by the rendering and playback engine.","void setEventListener(JetPlayer.OnJetEventListener listener) Sets the listener JetPlayer notifies when a JET event is generated by the rendering and playback engine.","boolean setMuteArray(boolean[] muteArray, boolean sync) Modifies the mute flags for the current active segment.","boolean setMuteFlag(int trackId, boolean muteFlag, boolean sync) Mutes or unmutes a single track.","boolean setMuteFlags(int muteFlags, boolean sync) Modifies the mute flags.","boolean triggerClip(int clipId) Schedules the playback of a clip.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media","constants":[],"class":"JetPlayer","constructors":[],"fields":[]}