{"methods":["JobInfo build()","JobInfo.Builder setBackoffCriteria(long initialBackoffMillis, int backoffPolicy) Set up the back-off/retry policy.","JobInfo.Builder setExtras(PersistableBundle extras) Set optional extras.","JobInfo.Builder setMinimumLatency(long minLatencyMillis) Specify that this job should be delayed by the provided amount of time.","JobInfo.Builder setOverrideDeadline(long maxExecutionDelayMillis) Set deadline which is the maximum scheduling latency.","JobInfo.Builder setPeriodic(long intervalMillis) Specify that this job should recur with the provided interval, not more than once per period.","JobInfo.Builder setPersisted(boolean isPersisted) Set whether or not to persist this job across device reboots.","JobInfo.Builder setRequiredNetworkType(int networkType) Set some description of the kind of network type your job needs to have.","JobInfo.Builder setRequiresCharging(boolean requiresCharging) Specify that to run this job, the device needs to be plugged in.","JobInfo.Builder setRequiresDeviceIdle(boolean requiresDeviceIdle) Specify that to run, the job needs the device to be in idle mode.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app.job","constants":[],"class":"JobInfo.Builder","constructors":[],"fields":[]}