{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","int getBackoffPolicy() One of either BACKOFF_POLICY_EXPONENTIAL, or BACKOFF_POLICY_LINEAR, depending on which criteria you set when creating this job.","PersistableBundle getExtras() Bundle of extras which are returned to your application at execution time.","int getId() Unique job id associated with this class.","long getInitialBackoffMillis() The amount of time the JobScheduler will wait before rescheduling a failed job.","long getIntervalMillis() Set to the interval between occurrences of this job.","long getMaxExecutionDelayMillis() See setOverrideDeadline(long).","long getMinLatencyMillis() Set for a job that does not recur periodically, to specify a delay after which the job will be eligible for execution.","int getNetworkType() One of NETWORK_TYPE_ANY, NETWORK_TYPE_NONE, or NETWORK_TYPE_UNMETERED.","ComponentName getService() Name of the service endpoint that will be called back into by the JobScheduler.","boolean isPeriodic() Track whether this job will repeat with a given period.","boolean isPersisted()","boolean isRequireCharging() Whether this job needs the device to be plugged in.","boolean isRequireDeviceIdle() Whether this job needs the device to be in an Idle maintenance window.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel out, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.app.job","constants":["int BACKOFF_POLICY_EXPONENTIAL Exponentially back-off a failed job.","int BACKOFF_POLICY_LINEAR Linearly back-off a failed job.","long DEFAULT_INITIAL_BACKOFF_MILLIS Amount of backoff a job has initially by default, in milliseconds.","long MAX_BACKOFF_DELAY_MILLIS Maximum backoff we allow for a job, in milliseconds.","int NETWORK_TYPE_ANY This job requires network connectivity.","int NETWORK_TYPE_NONE Default.","int NETWORK_TYPE_UNMETERED This job requires network connectivity that is unmetered.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"JobInfo","constructors":[],"fields":["public static final Creator<JobInfo> CREATOR"]}