{"methods":["void beginArray() Consumes the next token from the JSON stream and asserts that it is the beginning of a new array.","void beginObject() Consumes the next token from the JSON stream and asserts that it is the beginning of a new object.","void close() Closes this JSON reader and the underlying Reader.","void endArray() Consumes the next token from the JSON stream and asserts that it is the end of the current array.","void endObject() Consumes the next token from the JSON stream and asserts that it is the end of the current array.","boolean hasNext() Returns true if the current array or object has another element.","boolean isLenient() Returns true if this parser is liberal in what it accepts.","boolean nextBoolean() Returns the boolean value of the next token, consuming it.","double nextDouble() Returns the double value of the next token, consuming it.","int nextInt() Returns the int value of the next token, consuming it.","long nextLong() Returns the long value of the next token, consuming it.","String nextName() Returns the next token, a property name, and consumes it.","void nextNull() Consumes the next token from the JSON stream and asserts that it is a literal null.","String nextString() Returns the string value of the next token, consuming it.","JsonToken peek() Returns the type of the next token without consuming it.","void setLenient(boolean lenient) Configure this parser to be be liberal in what it accepts.","void skipValue() Skips the next value recursively.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"android.util","constants":[],"class":"JsonReader","constructors":[],"fields":[]}