{"methods":["void back() Unreads the most recent character of input.","static int dehexchar(char hex) Returns the integer [0..15] value for the given hex character, or -1 for non-hex input.","boolean more() Returns true until the input has been exhausted.","String next(int length) Returns the next length characters of the input.","char next() Returns the next available character, or the null character '\\0' if all input has been exhausted.","char next(char c) Returns the next available character if it equals c.","char nextClean() Returns the next character that is not whitespace and does not belong to a comment.","String nextString(char quote) Returns the string up to but not including quote, unescaping any character escape sequences encountered along the way.","String nextTo(char excluded) Equivalent to nextTo(String.valueOf(excluded)).","String nextTo(String excluded) Returns the trimmed string holding the characters up to but not including the first of: any character in excluded a newline character '\\n' a carriage return '\\r' The returned string shares its backing character array with this tokener's input string.","Object nextValue() Returns the next value from the input.","void skipPast(String thru) Advances past all input up to and including the next occurrence of thru.","char skipTo(char to) Advances past all input up to but not including the next occurrence of to.","JSONException syntaxError(String message) Returns an exception containing the given message plus the current position and the entire input string.","String toString() Returns the current position and the entire input string.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.json","constants":[],"class":"JSONTokener","constructors":[],"fields":[]}