{"methods":["final Key doPhase(Key key, boolean lastPhase) Does the next (or the last) phase of the key agreement, using the specified key.","final SecretKey generateSecret(String algorithm) Generates the shared secret.","final int generateSecret(byte[] sharedSecret, int offset) Generates the shared secret and stores it into the buffer sharedSecred at offset.","final byte[] generateSecret() Generates the shared secret.","final String getAlgorithm() Returns the name of the key agreement algorithm.","final static KeyAgreement getInstance(String algorithm, String provider) Creates a new KeyAgreement for the specified algorithm from the specified provider.","final static KeyAgreement getInstance(String algorithm, Provider provider) Create a new KeyAgreement for the specified algorithm from the specified provider.","final static KeyAgreement getInstance(String algorithm) Creates a new KeyAgreement for the specified algorithm.","final Provider getProvider() Returns the provider for this KeyAgreement instance.","final void init(Key key, SecureRandom random) Initializes this KeyAgreement with the specified key and the specified randomness source.","final void init(Key key, AlgorithmParameterSpec params) Initializes this KeyAgreement with the specified key and the algorithm parameters.","final void init(Key key, AlgorithmParameterSpec params, SecureRandom random) Initializes this KeyAgreement with the specified key, algorithm parameters and randomness source.","final void init(Key key) Initializes this KeyAgreement with the specified key.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.crypto","constants":[],"class":"KeyAgreement","constructors":[],"fields":[]}