{"methods":["static void choosePrivateKeyAlias(Activity activity, KeyChainAliasCallback response, String[] keyTypes, Principal[] issuers, String host, int port, String alias) Launches an Activity for the user to select the alias for a private key and certificate pair for authentication.","static Intent createInstallIntent() Returns an Intent that can be used for credential installation.","static X509Certificate[] getCertificateChain(Context context, String alias) Returns the X509Certificate chain for the requested alias, or null if no there is no result.","static PrivateKey getPrivateKey(Context context, String alias) Returns the PrivateKey for the requested alias, or null if no there is no result.","static boolean isBoundKeyAlgorithm(String algorithm) Returns true if the current device's KeyChain binds any PrivateKey of the given algorithm to the device once imported or generated.","static boolean isKeyAlgorithmSupported(String algorithm) Returns true if the current device's KeyChain supports a specific PrivateKey type indicated by algorithm (e.g., \"RSA\").","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.security","constants":["String ACTION_STORAGE_CHANGED Broadcast Action: Indicates the trusted storage has changed.","String EXTRA_CERTIFICATE Optional extra to specify an X.509 certificate to install on the Intent returned by createInstallIntent().","String EXTRA_NAME Optional extra to specify a String credential name on the Intent returned by createInstallIntent().","String EXTRA_PKCS12 Optional extra for use with the Intent returned by createInstallIntent() to specify a PKCS#12 key store to install."],"class":"KeyChain","constructors":[],"fields":[]}