{"methods":["abstract Keyframe clone() Creates and returns a copy of this Object.","float getFraction() Gets the time for this keyframe, as a fraction of the overall animation duration.","TimeInterpolator getInterpolator() Gets the optional interpolator for this Keyframe.","Class getType() Gets the type of keyframe.","abstract Object getValue() Gets the value for this Keyframe.","boolean hasValue() Indicates whether this keyframe has a valid value.","static Keyframe ofFloat(float fraction, float value) Constructs a Keyframe object with the given time and value.","static Keyframe ofFloat(float fraction) Constructs a Keyframe object with the given time.","static Keyframe ofInt(float fraction) Constructs a Keyframe object with the given time.","static Keyframe ofInt(float fraction, int value) Constructs a Keyframe object with the given time and value.","static Keyframe ofObject(float fraction) Constructs a Keyframe object with the given time.","static Keyframe ofObject(float fraction, Object value) Constructs a Keyframe object with the given time and value.","void setFraction(float fraction) Sets the time for this keyframe, as a fraction of the overall animation duration.","void setInterpolator(TimeInterpolator interpolator) Sets the optional interpolator for this Keyframe.","abstract void setValue(Object value) Sets the value for this Keyframe.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.animation","constants":[],"class":"Keyframe","constructors":[],"fields":[]}