{"methods":["final KeyPair genKeyPair() Computes and returns a new unique KeyPair each time this method is called.","KeyPair generateKeyPair() Computes and returns a new unique KeyPair each time this method is called.","String getAlgorithm() Returns the name of the algorithm of this KeyPairGenerator.","static KeyPairGenerator getInstance(String algorithm, String provider) Returns a new instance of KeyPairGenerator that utilizes the specified algorithm from the specified provider.","static KeyPairGenerator getInstance(String algorithm, Provider provider) Returns a new instance of KeyPairGenerator that utilizes the specified algorithm from the specified provider.","static KeyPairGenerator getInstance(String algorithm) Returns a new instance of KeyPairGenerator that utilizes the specified algorithm.","final Provider getProvider() Returns the provider associated with this KeyPairGenerator.","void initialize(AlgorithmParameterSpec param) Initializes this KeyPairGenerator with the given AlgorithmParameterSpec.","void initialize(AlgorithmParameterSpec param, SecureRandom random) Initializes this KeyPairGenerator with the given AlgorithmParameterSpec and the given SecureRandom.","void initialize(int keysize) Initializes this KeyPairGenerator with the given key size.","void initialize(int keysize, SecureRandom random) Initializes this KeyPairGenerator with the given key size and the given SecureRandom.","[Expand] Inherited Methods","From class java.security.KeyPairGeneratorSpi abstract KeyPair generateKeyPair() Computes and returns a new unique KeyPair each time this method is called. void initialize(AlgorithmParameterSpec params, SecureRandom random) Initializes this KeyPairGeneratorSpi with the given AlgorithmParameterSpec and the given SecureRandom. abstract void initialize(int keysize, SecureRandom random) Initializes this KeyPairGeneratorSpi with the given key size and the given SecureRandom.","abstract KeyPair generateKeyPair() Computes and returns a new unique KeyPair each time this method is called.","void initialize(AlgorithmParameterSpec params, SecureRandom random) Initializes this KeyPairGeneratorSpi with the given AlgorithmParameterSpec and the given SecureRandom.","abstract void initialize(int keysize, SecureRandom random) Initializes this KeyPairGeneratorSpi with the given key size and the given SecureRandom.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security","constants":[],"class":"KeyPairGenerator","constructors":[],"fields":[]}