{"methods":["KeyPairGeneratorSpec build() Builds the instance of the KeyPairGeneratorSpec.","KeyPairGeneratorSpec.Builder setAlgorithmParameterSpec(AlgorithmParameterSpec spec) Sets the underlying key type's parameters.","KeyPairGeneratorSpec.Builder setAlias(String alias) Sets the alias to be used to retrieve the key later from a KeyStore instance using the AndroidKeyStore provider.","KeyPairGeneratorSpec.Builder setEncryptionRequired() Indicates that this key must be encrypted at rest on storage.","KeyPairGeneratorSpec.Builder setEndDate(Date endDate) Sets the end of the validity period for the self-signed certificate of the generated key pair.","KeyPairGeneratorSpec.Builder setKeySize(int keySize) Sets the key size for the keypair to be created.","KeyPairGeneratorSpec.Builder setKeyType(String keyType) Sets the key type (e.g., RSA, DSA, EC) of the keypair to be created.","KeyPairGeneratorSpec.Builder setSerialNumber(BigInteger serialNumber) Sets the serial number used for the self-signed certificate of the generated key pair.","KeyPairGeneratorSpec.Builder setStartDate(Date startDate) Sets the start of the validity period for the self-signed certificate of the generated key pair.","KeyPairGeneratorSpec.Builder setSubject(X500Principal subject) Sets the subject used for the self-signed certificate of the generated key pair.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.security","constants":[],"class":"KeyPairGeneratorSpec.Builder","constructors":[],"fields":[]}