{"methods":["final Enumeration<String> aliases() Returns an Enumeration over all alias names stored in this KeyStore.","final boolean containsAlias(String alias) Indicates whether the given alias is present in this KeyStore.","final void deleteEntry(String alias) Deletes the entry identified with the given alias from this KeyStore.","final boolean entryInstanceOf(String alias, Class<? extends KeyStore.Entry> entryClass) Indicates whether the entry for the given alias is assignable to the provided Class.","final Certificate getCertificate(String alias) Returns the trusted certificate for the entry with the given alias.","final String getCertificateAlias(Certificate cert) Returns the alias associated with the first entry whose certificate matches the specified certificate.","final Certificate[] getCertificateChain(String alias) Returns the certificate chain for the entry with the given alias.","final Date getCreationDate(String alias) Returns the creation date of the entry with the given alias.","final static String getDefaultType() Returns the default type for KeyStore instances.","final KeyStore.Entry getEntry(String alias, KeyStore.ProtectionParameter param) Returns the Entry with the given alias, using the specified ProtectionParameter.","static KeyStore getInstance(String type, String provider) Returns a new instance of KeyStore from the specified provider with the given type.","static KeyStore getInstance(String type, Provider provider) Returns a new instance of KeyStore from the specified provider with the given type.","static KeyStore getInstance(String type) Returns a new instance of KeyStore with the specified type.","final Key getKey(String alias, char[] password) Returns the key with the given alias, using the password to recover the key from the store.","final Provider getProvider() Returns the provider associated with this KeyStore.","final String getType() Returns the type of this KeyStore.","final boolean isCertificateEntry(String alias) Indicates whether the specified alias is associated with a KeyStore.TrustedCertificateEntry.","final boolean isKeyEntry(String alias) Indicates whether the specified alias is associated with either a KeyStore.PrivateKeyEntry or a KeyStore.SecretKeyEntry.","final void load(InputStream stream, char[] password) Initializes this KeyStore from the provided InputStream.","final void load(KeyStore.LoadStoreParameter param) Loads this KeyStore using the specified LoadStoreParameter.","final void setCertificateEntry(String alias, Certificate cert) Associates the given alias with a certificate.","final void setEntry(String alias, KeyStore.Entry entry, KeyStore.ProtectionParameter param) Stores the given Entry in this KeyStore and associates the entry with the given alias.","final void setKeyEntry(String alias, Key key, char[] password, Certificate[] chain) Associates the given alias with the key, password and certificate chain.","final void setKeyEntry(String alias, byte[] key, Certificate[] chain) Associates the given alias with a key and a certificate chain.","final int size() Returns the number of entries stored in this KeyStore.","final void store(OutputStream stream, char[] password) Writes this KeyStore to the specified OutputStream.","final void store(KeyStore.LoadStoreParameter param) Stores this KeyStore using the specified LoadStoreParameter.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security","constants":[],"class":"KeyStore","constructors":[],"fields":[]}