{"methods":["List<LauncherActivityInfo> getActivityList(String packageName, UserHandle user) Retrieves a list of launchable activities that match ACTION_MAIN and CATEGORY_LAUNCHER, for a specified user.","boolean isActivityEnabled(ComponentName component, UserHandle user) Checks if the activity exists and it enabled for a profile.","boolean isPackageEnabled(String packageName, UserHandle user) Checks if the package is installed and enabled for a profile.","void registerCallback(LauncherApps.Callback callback) Registers a callback for changes to packages in current and managed profiles.","void registerCallback(LauncherApps.Callback callback, Handler handler) Registers a callback for changes to packages in current and managed profiles.","LauncherActivityInfo resolveActivity(Intent intent, UserHandle user) Returns the activity info for a given intent and user handle, if it resolves.","void startAppDetailsActivity(ComponentName component, UserHandle user, Rect sourceBounds, Bundle opts) Starts the settings activity to show the application details for a package in the specified profile.","void startMainActivity(ComponentName component, UserHandle user, Rect sourceBounds, Bundle opts) Starts a Main activity in the specified profile.","void unregisterCallback(LauncherApps.Callback callback) Unregisters a callback that was previously registered.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.content.pm","constants":[],"class":"LauncherApps","constructors":[],"fields":[]}