{"methods":["abstract LayoutInflater cloneInContext(Context newContext) Create a copy of the existing LayoutInflater object, with the copy pointing to a different Context than the original.","final View createView(String name, String prefix, AttributeSet attrs) Low-level function for instantiating a view by name.","static LayoutInflater from(Context context) Obtains the LayoutInflater from the given context.","Context getContext() Return the context we are running in, for access to resources, class loader, etc.","final LayoutInflater.Factory getFactory() Return the current LayoutInflater.Factory (or null).","final LayoutInflater.Factory2 getFactory2() Return the current LayoutInflater.Factory2.","LayoutInflater.Filter getFilter()","View inflate(int resource, ViewGroup root) Inflate a new view hierarchy from the specified xml resource.","View inflate(XmlPullParser parser, ViewGroup root) Inflate a new view hierarchy from the specified xml node.","View inflate(XmlPullParser parser, ViewGroup root, boolean attachToRoot) Inflate a new view hierarchy from the specified XML node.","View inflate(int resource, ViewGroup root, boolean attachToRoot) Inflate a new view hierarchy from the specified xml resource.","void setFactory(LayoutInflater.Factory factory) Attach a custom Factory interface for creating views while using this LayoutInflater.","void setFactory2(LayoutInflater.Factory2 factory) Like setFactory(LayoutInflater.Factory), but allows you to set a LayoutInflater.Factory2 interface.","void setFilter(LayoutInflater.Filter filter) Sets the LayoutInflater.Filter to by this LayoutInflater.","View onCreateView(String name, AttributeSet attrs) This routine is responsible for creating the correct subclass of View given the xml element name.","View onCreateView(View parent, String name, AttributeSet attrs) Version of onCreateView(String, AttributeSet) that also takes the future parent of the view being constructed.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"LayoutInflater","constructors":[],"fields":[]}