{"methods":["abstract Intent getAllLeaderboardsIntent(GoogleApiClient apiClient) Gets an intent to show the list of leaderboards for a game.","abstract Intent getLeaderboardIntent(GoogleApiClient apiClient, String leaderboardId) Gets an intent to show a leaderboard for a game.","abstract PendingResult<Leaderboards.LoadPlayerScoreResult> loadCurrentPlayerLeaderboardScore(GoogleApiClient apiClient, String leaderboardId, int span, int leaderboardCollection) Asynchronously load the currently signed in player's score for a given leaderboard.","abstract PendingResult<Leaderboards.LeaderboardMetadataResult> loadLeaderboardMetadata(GoogleApiClient apiClient, String leaderboardId, boolean forceReload) Asynchronously load a specific leaderboard's metadata for this game.","abstract PendingResult<Leaderboards.LeaderboardMetadataResult> loadLeaderboardMetadata(GoogleApiClient apiClient, boolean forceReload) Asynchronously load the list of leaderboard metadata for this game.","abstract PendingResult<Leaderboards.LoadScoresResult> loadMoreScores(GoogleApiClient apiClient, LeaderboardScoreBuffer buffer, int maxResults, int pageDirection) Asynchronously loads an additional page of score data for the given score buffer.","abstract PendingResult<Leaderboards.LoadScoresResult> loadPlayerCenteredScores(GoogleApiClient apiClient, String leaderboardId, int span, int leaderboardCollection, int maxResults) Asynchronously load the player-centered page of scores for a given leaderboard.","abstract PendingResult<Leaderboards.LoadScoresResult> loadPlayerCenteredScores(GoogleApiClient apiClient, String leaderboardId, int span, int leaderboardCollection, int maxResults, boolean forceReload) Asynchronously load the player-centered page of scores for a given leaderboard.","abstract PendingResult<Leaderboards.LoadScoresResult> loadTopScores(GoogleApiClient apiClient, String leaderboardId, int span, int leaderboardCollection, int maxResults, boolean forceReload) Asynchronously load the top page of scores for a given leaderboard.","abstract PendingResult<Leaderboards.LoadScoresResult> loadTopScores(GoogleApiClient apiClient, String leaderboardId, int span, int leaderboardCollection, int maxResults) Asynchronously load the top page of scores for a given leaderboard.","abstract void submitScore(GoogleApiClient apiClient, String leaderboardId, long score, String scoreTag) Submit a score to a leaderboard for the currently signed in player.","abstract void submitScore(GoogleApiClient apiClient, String leaderboardId, long score) Submit a score to a leaderboard for the currently signed in player.","abstract PendingResult<Leaderboards.SubmitScoreResult> submitScoreImmediate(GoogleApiClient apiClient, String leaderboardId, long score) Submit a score to a leaderboard for the currently signed in player.","abstract PendingResult<Leaderboards.SubmitScoreResult> submitScoreImmediate(GoogleApiClient apiClient, String leaderboardId, long score, String scoreTag) Submit a score to a leaderboard for the currently signed in player."],"package":"com.google.android.gms.games.leaderboard","constants":[],"class":"Leaderboards","constructors":[],"fields":[]}