{"methods":["abstract void getDisplayRank(CharArrayBuffer dataOut) Load the formatted display rank into the given CharArrayBuffer.","abstract String getDisplayRank() Retrieves a formatted string to display for this rank.","abstract String getDisplayScore() Retrieves a formatted string to display for this score.","abstract void getDisplayScore(CharArrayBuffer dataOut) Loads the formatted display score into the given CharArrayBuffer.","abstract long getRank() Retrieves the rank returned from the server for this score.","abstract long getRawScore() Retrieves the raw score value.","abstract Player getScoreHolder() Retrieves the player that scored this particular score.","abstract void getScoreHolderDisplayName(CharArrayBuffer dataOut) Load the display name of the player who scored this score into the provided CharArrayBuffer.","abstract String getScoreHolderDisplayName() Retrieves the name to display for the player who scored this score.","abstract Uri getScoreHolderHiResImageUri() Retrieves the URI of the hi-res image to display for the player who scored this score.","abstract Uri getScoreHolderIconImageUri() Retrieves the URI of the icon image to display for the player who scored this score.","abstract String getScoreTag() Retrieve the optional score tag associated with this score, if any.","abstract long getTimestampMillis() Retrieves the timestamp (in milliseconds from epoch) at which this score was achieved.","[Expand] Inherited Methods","From interface com.google.android.gms.common.data.Freezable abstract T freeze() Freeze a volatile representation into an immutable representation. abstract boolean isDataValid() Check to see if this object is valid for use.","abstract T freeze() Freeze a volatile representation into an immutable representation.","abstract boolean isDataValid() Check to see if this object is valid for use."],"package":"com.google.android.gms.games.leaderboard","constants":["int LEADERBOARD_RANK_UNKNOWN Constant indicating that the score holder's rank was not known."],"class":"LeaderboardScore","constructors":[],"fields":[]}