{"methods":["boolean equals(Object o) Compares two Level objects for equality.","String getLocalizedName() Gets the localized name of this level.","String getName() Gets the name of this level.","String getResourceBundleName() Gets the name of the resource bundle associated with this level.","int hashCode() Returns the hash code of this Level object.","final int intValue() Gets the integer value indicating this level.","static Level parse(String name) Parses a level name into a Level object.","final String toString() Returns the string representation of this Level object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.logging","constants":[],"class":"Level","constructors":[],"fields":["public static final Level ALL The ALL level provides all logging messages.","public static final Level CONFIG The CONFIG level provides static configuration messages.","public static final Level FINE The FINE level provides tracing messages.","public static final Level FINER The FINER level provides more detailed tracing messages.","public static final Level FINEST The FINEST level provides highly detailed tracing messages.","public static final Level INFO The INFO level provides informative messages.","public static final Level OFF The OFF level provides no logging messages.","public static final Level SEVERE The SEVERE level provides severe failure messages.","public static final Level WARNING The WARNING level provides warnings."]}