{"methods":["final static boolean addLinks(TextView text, int mask) Scans the text of the provided TextView and turns all occurrences of the link types indicated in the mask into clickable links.","final static void addLinks(TextView text, Pattern p, String scheme, Linkify.MatchFilter matchFilter, Linkify.TransformFilter transformFilter) Applies a regex to the text of a TextView turning the matches into links.","final static boolean addLinks(Spannable text, int mask) Scans the text of the provided Spannable and turns all occurrences of the link types indicated in the mask into clickable links.","final static boolean addLinks(Spannable s, Pattern p, String scheme, Linkify.MatchFilter matchFilter, Linkify.TransformFilter transformFilter) Applies a regex to a Spannable turning the matches into links.","final static boolean addLinks(Spannable text, Pattern pattern, String scheme) Applies a regex to a Spannable turning the matches into links.","final static void addLinks(TextView text, Pattern pattern, String scheme) Applies a regex to the text of a TextView turning the matches into links.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.text.util","constants":["int ALL Bit mask indicating that all available patterns should be matched in methods that take an options mask","int EMAIL_ADDRESSES Bit field indicating that email addresses should be matched in methods that take an options mask","int MAP_ADDRESSES Bit field indicating that street addresses should be matched in methods that take an options mask","int PHONE_NUMBERS Bit field indicating that phone numbers should be matched in methods that take an options mask","int WEB_URLS Bit field indicating that web URLs should be matched in methods that take an options mask"],"class":"Linkify","constructors":[],"fields":["public static final Linkify.MatchFilter sPhoneNumberMatchFilter Filters out URL matches that don't have enough digits to be a phone number.","public static final Linkify.TransformFilter sPhoneNumberTransformFilter Transforms matched phone number text into something suitable to be used in a tel: URL.","public static final Linkify.MatchFilter sUrlMatchFilter Filters out web URL matches that occur after an at-sign (@)."]}