{"methods":["String getEncoding() Returns the current value of the encoding property.","String getXMLVersion() Returns the current value of the version property.","void setEncoding(String encoding) Assigns the current value of the encoding property.","void setXMLVersion(String version) Assigns the current value of the version property.","[Expand] Inherited Methods","From class org.xml.sax.helpers.LocatorImpl int getColumnNumber() Return the saved column number (1-based). int getLineNumber() Return the saved line number (1-based). String getPublicId() Return the saved public identifier. String getSystemId() Return the saved system identifier. void setColumnNumber(int columnNumber) Set the column number for this locator (1-based). void setLineNumber(int lineNumber) Set the line number for this locator (1-based). void setPublicId(String publicId) Set the public identifier for this locator. void setSystemId(String systemId) Set the system identifier for this locator.","int getColumnNumber() Return the saved column number (1-based).","int getLineNumber() Return the saved line number (1-based).","String getPublicId() Return the saved public identifier.","String getSystemId() Return the saved system identifier.","void setColumnNumber(int columnNumber) Set the column number for this locator (1-based).","void setLineNumber(int lineNumber) Set the line number for this locator (1-based).","void setPublicId(String publicId) Set the public identifier for this locator.","void setSystemId(String systemId) Set the system identifier for this locator.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.Locator abstract int getColumnNumber() Return the column number where the current document event ends. abstract int getLineNumber() Return the line number where the current document event ends. abstract String getPublicId() Return the public identifier for the current document event. abstract String getSystemId() Return the system identifier for the current document event.","abstract int getColumnNumber() Return the column number where the current document event ends.","abstract int getLineNumber() Return the line number where the current document event ends.","abstract String getPublicId() Return the public identifier for the current document event.","abstract String getSystemId() Return the system identifier for the current document event.","From interface org.xml.sax.ext.Locator2 abstract String getEncoding() Returns the name of the character encoding for the entity. abstract String getXMLVersion() Returns the version of XML used for the entity.","abstract String getEncoding() Returns the name of the character encoding for the entity.","abstract String getXMLVersion() Returns the version of XML used for the entity."],"package":"org.xml.sax.ext","constants":[],"class":"Locator2Impl","constructors":[],"fields":[]}