{"methods":["Locale.Builder addUnicodeLocaleAttribute(String attribute) Adds the specified attribute to the list of attributes in the unicode locale extension.","Locale build() Constructs a locale from the existing state of the builder.","Locale.Builder clear() Clears all existing state from this builder.","Locale.Builder clearExtensions() Clears all extensions from this builder.","Locale.Builder removeUnicodeLocaleAttribute(String attribute) Removes an attribute from the list of attributes in the unicode locale extension.","Locale.Builder setExtension(char key, String value) Sets the extension identified by key to value.","Locale.Builder setLanguage(String language) Sets the locale language.","Locale.Builder setLanguageTag(String languageTag) Set the state of this builder to the parsed contents of the BCP-47 language tag languageTag.","Locale.Builder setLocale(Locale locale) Sets the state of the builder to the Locale represented by locale.","Locale.Builder setRegion(String region) Sets the locale region.","Locale.Builder setScript(String script) Sets the locale script.","Locale.Builder setUnicodeLocaleKeyword(String key, String type) Adds a key / type pair to the list of unicode locale extension keys.","Locale.Builder setVariant(String variant) Sets the locale variant.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util","constants":[],"class":"Locale.Builder","constructors":[],"fields":[]}