{"methods":["Window destroyActivity(String id, boolean finish) Destroy the activity associated with a particular id.","void dispatchCreate(Bundle state) Restore a state that was previously returned by saveInstanceState().","void dispatchDestroy(boolean finishing) Called by the container activity in its onDestroy() so that LocalActivityManager can perform the corresponding action on the activities it holds.","void dispatchPause(boolean finishing) Called by the container activity in its onPause() so that LocalActivityManager can perform the corresponding action on the activities it holds.","void dispatchResume() Called by the container activity in its onResume() so that LocalActivityManager can perform the corresponding action on the activities it holds.","void dispatchStop() Called by the container activity in its onStop() so that LocalActivityManager can perform the corresponding action on the activities it holds.","Activity getActivity(String id) Return the Activity object associated with a string ID.","Activity getCurrentActivity() Retrieve the Activity that is currently running.","String getCurrentId() Retrieve the ID of the activity that is currently running.","void removeAllActivities() Remove all activities from this LocalActivityManager, performing an onDestroy() on any that are currently instantiated.","Bundle saveInstanceState() Retrieve the state of all activities known by the group.","Window startActivity(String id, Intent intent) Start a new activity running in the group.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":[],"class":"LocalActivityManager","constructors":[],"fields":[]}