{"methods":["Object clone() Creates and returns a copy of this Object.","boolean equals(Object object) Returns true if object is a locale with the same language, country and variant.","static Locale forLanguageTag(String languageTag) Returns a locale for a given BCP-47 language tag.","static Locale[] getAvailableLocales() Returns the system's installed locales.","String getCountry() Returns the country code for this locale, or \"\" if this locale doesn't correspond to a specific country.","static Locale getDefault() Returns the user's preferred locale.","String getDisplayCountry(Locale locale) Returns the name of this locale's country, localized to locale.","final String getDisplayCountry() Equivalent to getDisplayCountry(Locale.getDefault()).","String getDisplayLanguage(Locale locale) Returns the name of this locale's language, localized to locale.","final String getDisplayLanguage() Equivalent to getDisplayLanguage(Locale.getDefault()).","final String getDisplayName() Equivalent to getDisplayName(Locale.getDefault()).","String getDisplayName(Locale locale) Returns this locale's language name, country name, and variant, localized to locale.","String getDisplayScript() Equivalent to getDisplayScript(Locale.getDefault()))","String getDisplayScript(Locale locale) Returns the name of this locale's script code, localized to Locale.","final String getDisplayVariant() Returns the full variant name in the default Locale for the variant code of this Locale.","String getDisplayVariant(Locale locale) Returns the full variant name in the specified Locale for the variant code of this Locale.","String getExtension(char extensionKey) Returns the BCP-47 extension whose key is extensionKey, or null if this locale does not contain the extension.","Set<Character> getExtensionKeys() Returns the set of BCP-47 extensions this locale contains.","String getISO3Country() Returns the three-letter ISO 3166 country code which corresponds to the country code for this Locale.","String getISO3Language() Returns the three-letter ISO 639-2/T language code which corresponds to the language code for this Locale.","static String[] getISOCountries() Returns an array of strings containing all the two-letter ISO 3166 country codes that can be used as the country code when constructing a Locale.","static String[] getISOLanguages() Returns an array of strings containing all the two-letter ISO 639-1 language codes that can be used as the language code when constructing a Locale.","String getLanguage() Returns the language code for this Locale or the empty string if no language was set.","String getScript() Returns the script code for this Locale or an empty String if no script was set.","Set<String> getUnicodeLocaleAttributes() Returns the set of unicode locale extension attributes this locale contains.","Set<String> getUnicodeLocaleKeys() Returns the set of unicode locale extension keywords this locale contains.","String getUnicodeLocaleType(String keyWord) Returns the type for the specified unicode locale extension key.","String getVariant() Returns the variant code for this Locale or an empty String if no variant was set.","synchronized int hashCode() Returns an integer hash code for this object.","synchronized static void setDefault(Locale locale) Overrides the default locale.","String toLanguageTag() Returns a well formed BCP-47 language tag that identifies this locale.","final String toString() Returns the string representation of this Locale.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util","constants":["char PRIVATE_USE_EXTENSION BCP-47 extension identifier (or \"singleton\") for the private use extension.","char UNICODE_LOCALE_EXTENSION BCP-47 extension identifier (or \"singleton\") for the unicode locale extension."],"class":"Locale","constructors":[],"fields":["public static final Locale CANADA Locale constant for en_CA.","public static final Locale CANADA_FRENCH Locale constant for fr_CA.","public static final Locale CHINA Locale constant for zh_CN.","public static final Locale CHINESE Locale constant for zh.","public static final Locale ENGLISH Locale constant for en.","public static final Locale FRANCE Locale constant for fr_FR.","public static final Locale FRENCH Locale constant for fr.","public static final Locale GERMAN Locale constant for de.","public static final Locale GERMANY Locale constant for de_DE.","public static final Locale ITALIAN Locale constant for it.","public static final Locale ITALY Locale constant for it_IT.","public static final Locale JAPAN Locale constant for ja_JP.","public static final Locale JAPANESE Locale constant for ja.","public static final Locale KOREA Locale constant for ko_KR.","public static final Locale KOREAN Locale constant for ko.","public static final Locale PRC Locale constant for zh_CN.","public static final Locale ROOT Locale constant for the root locale.","public static final Locale SIMPLIFIED_CHINESE Locale constant for zh_CN.","public static final Locale TAIWAN Locale constant for zh_TW.","public static final Locale TRADITIONAL_CHINESE Locale constant for zh_TW.","public static final Locale UK Locale constant for en_GB.","public static final Locale US Locale constant for en_US."]}