{"methods":["int getAccuracy() Returns a constant describing horizontal accuracy of this provider.","String getName() Returns the name of this provider.","int getPowerRequirement() Returns the power requirement for this provider.","boolean hasMonetaryCost() Returns true if the use of this provider may result in a monetary charge to the user, false if use is free.","boolean meetsCriteria(Criteria criteria) Returns true if this provider meets the given criteria, false otherwise.","boolean requiresCell() Returns true if the provider requires access to an appropriate cellular network (e.g., to make use of cell tower IDs), false otherwise.","boolean requiresNetwork() Returns true if the provider requires access to a data network (e.g., the Internet), false otherwise.","boolean requiresSatellite() Returns true if the provider requires access to a satellite-based positioning system (e.g., GPS), false otherwise.","boolean supportsAltitude() Returns true if the provider is able to provide altitude information, false otherwise.","boolean supportsBearing() Returns true if the provider is able to provide bearing information, false otherwise.","boolean supportsSpeed() Returns true if the provider is able to provide speed information, false otherwise.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.location","constants":["int AVAILABLE","int OUT_OF_SERVICE","int TEMPORARILY_UNAVAILABLE"],"class":"LocationProvider","constructors":[],"fields":[]}