{"methods":["static int d(String tag, String msg) Send a DEBUG log message.","static int d(String tag, String msg, Throwable tr) Send a DEBUG log message and log the exception.","static int e(String tag, String msg) Send an ERROR log message.","static int e(String tag, String msg, Throwable tr) Send a ERROR log message and log the exception.","static String getStackTraceString(Throwable tr) Handy function to get a loggable stack trace from a Throwable","static int i(String tag, String msg) Send an INFO log message.","static int i(String tag, String msg, Throwable tr) Send a INFO log message and log the exception.","static boolean isLoggable(String tag, int level) Checks to see whether or not a log for the specified tag is loggable at the specified level.","static int println(int priority, String tag, String msg) Low-level logging call.","static int v(String tag, String msg, Throwable tr) Send a VERBOSE log message and log the exception.","static int v(String tag, String msg) Send a VERBOSE log message.","static int w(String tag, Throwable tr)","static int w(String tag, String msg, Throwable tr) Send a WARN log message and log the exception.","static int w(String tag, String msg) Send a WARN log message.","static int wtf(String tag, Throwable tr) What a Terrible Failure: Report an exception that should never happen.","static int wtf(String tag, String msg, Throwable tr) What a Terrible Failure: Report an exception that should never happen.","static int wtf(String tag, String msg) What a Terrible Failure: Report a condition that should never happen.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.util","constants":["int ASSERT Priority constant for the println method.","int DEBUG Priority constant for the println method; use Log.d.","int ERROR Priority constant for the println method; use Log.e.","int INFO Priority constant for the println method; use Log.i.","int VERBOSE Priority constant for the println method; use Log.v.","int WARN Priority constant for the println method; use Log.w."],"class":"Log","constructors":[],"fields":[]}