{"methods":["Level getLevel() Gets the logging level.","String getLoggerName() Gets the name of the logger.","String getMessage() Gets the raw message.","long getMillis() Gets the time when this event occurred, in milliseconds since 1970.","Object[] getParameters() Gets the parameters.","ResourceBundle getResourceBundle() Gets the resource bundle used to localize the raw message during formatting.","String getResourceBundleName() Gets the name of the resource bundle.","long getSequenceNumber() Gets the sequence number.","String getSourceClassName() Gets the name of the class that is the source of this log record.","String getSourceMethodName() Gets the name of the method that is the source of this log record.","int getThreadID() Gets a unique ID of the thread originating the log record.","Throwable getThrown() Gets the Throwable object associated with this log record.","void setLevel(Level level) Sets the logging level.","void setLoggerName(String loggerName) Sets the name of the logger.","void setMessage(String message) Sets the raw message.","void setMillis(long millis) Sets the time when this event occurred, in milliseconds since 1970.","void setParameters(Object[] parameters) Sets the parameters.","void setResourceBundle(ResourceBundle resourceBundle) Sets the resource bundle used to localize the raw message during formatting.","void setResourceBundleName(String resourceBundleName) Sets the name of the resource bundle.","void setSequenceNumber(long sequenceNumber) Sets the sequence number.","void setSourceClassName(String sourceClassName) Sets the name of the class that is the source of this log record.","void setSourceMethodName(String sourceMethodName) Sets the name of the method that is the source of this log record.","void setThreadID(int threadID) Sets the ID of the thread originating this log record.","void setThrown(Throwable thrown) Sets the Throwable object associated with this log record.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.logging","constants":[],"class":"LogRecord","constructors":[],"fields":[]}