{"methods":["static int bitCount(long v) Counts the number of 1 bits in the specified long value; this is also referred to as population count.","byte byteValue() Returns this object's value as a byte.","static int compare(long lhs, long rhs) Compares two long values.","int compareTo(Long object) Compares this object to the specified long object to determine their relative order.","static Long decode(String string) Parses the specified string and returns a Long instance if the string can be decoded into a long value.","double doubleValue() Returns this object's value as a double.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","float floatValue() Returns this object's value as a float.","static Long getLong(String string, Long defaultValue) Returns the Long value of the system property identified by string.","static Long getLong(String string, long defaultValue) Returns the Long value of the system property identified by string.","static Long getLong(String string) Returns the Long value of the system property identified by string.","int hashCode() Returns an integer hash code for this object.","static long highestOneBit(long v) Determines the highest (leftmost) bit of the specified long value that is 1 and returns the bit mask value for that bit.","int intValue() Returns this object's value as an int.","long longValue() Gets the primitive value of this long.","static long lowestOneBit(long v) Determines the lowest (rightmost) bit of the specified long value that is 1 and returns the bit mask value for that bit.","static int numberOfLeadingZeros(long v) Determines the number of leading zeros in the specified long value prior to the highest one bit.","static int numberOfTrailingZeros(long v) Determines the number of trailing zeros in the specified long value after the lowest one bit.","static long parseLong(String string, int radix) Parses the specified string as a signed long value using the specified radix.","static long parseLong(String string) Parses the specified string as a signed decimal long value.","static long reverse(long v) Reverses the order of the bits of the specified long value.","static long reverseBytes(long v) Reverses the order of the bytes of the specified long value.","static long rotateLeft(long v, int distance) Rotates the bits of the specified long value to the left by the specified number of bits.","static long rotateRight(long v, int distance) Rotates the bits of the specified long value to the right by the specified number of bits.","short shortValue() Returns this object's value as a short.","static int signum(long v) Returns the value of the signum function for the specified long value.","static String toBinaryString(long v) Converts the specified long value into its binary string representation.","static String toHexString(long v) Converts the specified long value into its hexadecimal string representation.","static String toOctalString(long v) Converts the specified long value into its octal string representation.","String toString() Returns a string containing a concise, human-readable description of this object.","static String toString(long n) Converts the specified long value into its decimal string representation.","static String toString(long v, int radix) Converts the specified signed long value into a string representation based on the specified radix.","static Long valueOf(String string, int radix) Parses the specified string as a signed long value using the specified radix.","static Long valueOf(long v) Returns a Long instance for the specified long value.","static Long valueOf(String string) Parses the specified string as a signed decimal long value.","[Expand] Inherited Methods","From class java.lang.Number byte byteValue() Returns this object's value as a byte. abstract double doubleValue() Returns this object's value as a double. abstract float floatValue() Returns this object's value as a float. abstract int intValue() Returns this object's value as an int. abstract long longValue() Returns this object's value as a long. short shortValue() Returns this object's value as a short.","byte byteValue() Returns this object's value as a byte.","abstract double doubleValue() Returns this object's value as a double.","abstract float floatValue() Returns this object's value as a float.","abstract int intValue() Returns this object's value as an int.","abstract long longValue() Returns this object's value as a long.","short shortValue() Returns this object's value as a short.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.lang","constants":["long MAX_VALUE Constant for the maximum long value, 263-1.","long MIN_VALUE Constant for the minimum long value, -263.","int SIZE Constant for the number of bits needed to represent a long in two's complement form."],"class":"Long","constructors":[],"fields":["public static final Class<Long> TYPE The Class object that represents the primitive type long."]}