{"methods":["synchronized final int createCount() Returns the number of times create(Object) returned a value.","final void evictAll() Clear the cache, calling entryRemoved(boolean, K, V, V) on each removed entry.","synchronized final int evictionCount() Returns the number of values that have been evicted.","final V get(K key) Returns the value for key if it exists in the cache or can be created by #create.","synchronized final int hitCount() Returns the number of times get(K) returned a value that was already present in the cache.","synchronized final int maxSize() For caches that do not override sizeOf(K, V), this returns the maximum number of entries in the cache.","synchronized final int missCount() Returns the number of times get(K) returned null or required a new value to be created.","final V put(K key, V value) Caches value for key.","synchronized final int putCount() Returns the number of times put(K, V) was called.","final V remove(K key) Removes the entry for key if it exists.","void resize(int maxSize) Sets the size of the cache.","synchronized final int size() For caches that do not override sizeOf(K, V), this returns the number of entries in the cache.","synchronized final Map<K, V> snapshot() Returns a copy of the current contents of the cache, ordered from least recently accessed to most recently accessed.","synchronized final String toString() Returns a string containing a concise, human-readable description of this object.","void trimToSize(int maxSize) Remove the eldest entries until the total of remaining entries is at or below the requested size.","V create(K key) Called after a cache miss to compute a value for the corresponding key.","void entryRemoved(boolean evicted, K key, V oldValue, V newValue) Called for entries that have been evicted or removed.","int sizeOf(K key, V value) Returns the size of the entry for key and value in user-defined units.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.util","constants":[],"class":"LruCache","constructors":[],"fields":[]}