{"methods":["final Object clone() Clones this Mac instance and the underlying implementation.","final void doFinal(byte[] output, int outOffset) Computes the digest of this MAC based on the data previously specified in update(byte) calls and stores the digest in the specified output buffer at offset outOffset.","final byte[] doFinal(byte[] input) Computes the digest of this MAC based on the data previously specified on update(byte) calls and on the final bytes specified by input (or based on those bytes only).","final byte[] doFinal() Computes the digest of this MAC based on the data previously specified in update(byte) calls.","final String getAlgorithm() Returns the name of the MAC algorithm.","final static Mac getInstance(String algorithm, String provider) Creates a new Mac instance that provides the specified MAC algorithm from the specified provider.","final static Mac getInstance(String algorithm, Provider provider) Creates a new Mac instance that provides the specified MAC algorithm from the specified provider.","final static Mac getInstance(String algorithm) Creates a new Mac instance that provides the specified MAC algorithm.","final int getMacLength() Returns the length of this MAC (in bytes).","final Provider getProvider() Returns the provider of this Mac instance.","final void init(Key key, AlgorithmParameterSpec params) Initializes this Mac instance with the specified key and algorithm parameters.","final void init(Key key) Initializes this Mac instance with the specified key.","final void reset() Resets this Mac instance to its initial state.","final void update(ByteBuffer input) Updates this Mac instance with the data from the specified buffer, starting at position(), including the next remaining() bytes.","final void update(byte[] input, int offset, int len) Updates this Mac instance with the data from the specified buffer input from the specified offset and length len.","final void update(byte input) Updates this Mac instance with the specified byte.","final void update(byte[] input) Copies the buffer provided as input for further processing.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.crypto","constants":[],"class":"Mac","constructors":[],"fields":[]}