{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android","constants":["String ACCESSIBILITY_FEATURES Used for permissions that allow requesting certain accessibility features.","String ACCOUNTS Permissions for direct access to the accounts managed by the Account Manager.","String AFFECTS_BATTERY Used for permissions that provide direct access to the hardware on the device that has an effect on battery life.","String APP_INFO Group of permissions that are related to the other applications installed on the system.","String AUDIO_SETTINGS Used for permissions that provide direct access to speaker settings the device.","String BLUETOOTH_NETWORK Used for permissions that provide access to other devices through Bluetooth.","String BOOKMARKS Used for permissions that provide access to the user bookmarks and browser history.","String CALENDAR Used for permissions that provide access to the device calendar to create / view events.","String CAMERA Used for permissions that are associated with accessing camera or capturing images/video from the device.","String COST_MONEY Used for permissions that can be used to make the user spend money without their direct involvement.","String DEVELOPMENT_TOOLS Group of permissions that are related to development features.","String DEVICE_ALARMS Used for permissions that provide access to device alarms.","String DISPLAY Group of permissions that allow manipulation of how another application displays UI to the user.","String HARDWARE_CONTROLS Used for permissions that provide direct access to the hardware on the device.","String LOCATION Used for permissions that allow access to the user's current location.","String MESSAGES Used for permissions that allow an application to send messages on behalf of the user or intercept messages being received by the user.","String MICROPHONE Used for permissions that are associated with accessing microphone audio from the device.","String NETWORK Used for permissions that provide access to networking services.","String PERSONAL_INFO Used for permissions that provide access to information about the device user such as profile information.","String PHONE_CALLS Used for permissions that are associated with accessing and modifying telephony state: placing calls, intercepting outgoing calls, reading and modifying the phone state.","String SCREENLOCK Group of permissions that are related to the screenlock.","String SOCIAL_INFO Used for permissions that provide access to the user's social connections, such as contacts, call logs, social stream, etc.","String STATUS_BAR Used for permissions that change the status bar","String STORAGE Group of permissions that are related to SD card access.","String SYNC_SETTINGS Used for permissions that access the sync settings or sync related information.","String SYSTEM_CLOCK Group of permissions that are related to system clock.","String SYSTEM_TOOLS Group of permissions that are related to system APIs.","String USER_DICTIONARY Used for permissions that provide access to the user calendar to create / view events.","String VOICEMAIL Used for permissions that provide access to the user voicemail box.","String WALLPAPER Group of permissions that allow manipulation of how another application displays UI to the user.","String WRITE_USER_DICTIONARY Used for permissions that provide access to the user calendar to create / view events."],"class":"Manifest.permission_group","constructors":[],"fields":[]}