{"methods":["Matcher appendReplacement(StringBuffer buffer, String replacement) Appends a literal part of the input plus a replacement for the current match to a given StringBuffer.","StringBuffer appendTail(StringBuffer buffer) Appends the (unmatched) remainder of the input to the given StringBuffer.","int end() Returns the index of the first character following the text that matched the whole regular expression.","int end(int group) Returns the index of the first character following the text that matched a given group.","boolean find() Moves to the next occurrence of the pattern in the input.","boolean find(int start) Returns true if there is another match in the input, starting from the given position.","String group() Returns the text that matched the whole regular expression.","String group(int group) Returns the text that matched a given group of the regular expression.","int groupCount() Returns the number of groups in the results, which is always equal to the number of groups in the original regular expression.","boolean hasAnchoringBounds() Returns true if this matcher has anchoring bounds enabled.","boolean hasTransparentBounds() Returns true if this matcher has transparent bounds enabled.","boolean hitEnd() Returns true if the most recent matching operation attempted to access additional text beyond the available input, meaning that additional input could change the results of the match.","boolean lookingAt() Tries to match the Pattern, starting from the beginning of the region (or the beginning of the input, if no region has been set).","boolean matches() Tries to match the Pattern against the entire region (or the entire input, if no region has been set).","Pattern pattern() Returns the Pattern instance used inside this matcher.","static String quoteReplacement(String s) Returns a replacement string for the given one that has all backslashes and dollar signs escaped.","Matcher region(int start, int end) Resets this matcher and sets a region.","int regionEnd() Returns this matcher's region end, that is, the index of the first character that is not considered for a match.","int regionStart() Returns this matcher's region start, that is, the index of the first character that is considered for a match.","String replaceAll(String replacement) Replaces all occurrences of this matcher's pattern in the input with a given string.","String replaceFirst(String replacement) Replaces the first occurrence of this matcher's pattern in the input with a given string.","boolean requireEnd() Returns true if the most recent match succeeded and additional input could cause it to fail.","Matcher reset() Resets the Matcher.","Matcher reset(CharSequence input) Provides a new input and resets the Matcher.","int start() Returns the index of the first character of the text that matched the whole regular expression.","int start(int group) Returns the index of the first character of the text that matched a given group.","MatchResult toMatchResult() Converts the current match into a separate MatchResult instance that is independent from this matcher.","String toString() Returns a string representing this Matcher.","Matcher useAnchoringBounds(boolean value) Determines whether this matcher has anchoring bounds enabled or not.","Matcher usePattern(Pattern pattern) Sets a new pattern for the Matcher.","Matcher useTransparentBounds(boolean value) Determines whether this matcher has transparent bounds enabled or not.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.regex.MatchResult abstract int end() Returns the index of the first character following the text that matched the whole regular expression. abstract int end(int group) Returns the index of the first character following the text that matched a given group. abstract String group() Returns the text that matched the whole regular expression. abstract String group(int group) Returns the text that matched a given group of the regular expression. abstract int groupCount() Returns the number of groups in the results, which is always equal to the number of groups in the original regular expression. abstract int start() Returns the index of the first character of the text that matched the whole regular expression. abstract int start(int group) Returns the index of the first character of the text that matched a given group.","abstract int end() Returns the index of the first character following the text that matched the whole regular expression.","abstract int end(int group) Returns the index of the first character following the text that matched a given group.","abstract String group() Returns the text that matched the whole regular expression.","abstract String group(int group) Returns the text that matched a given group of the regular expression.","abstract int groupCount() Returns the number of groups in the results, which is always equal to the number of groups in the original regular expression.","abstract int start() Returns the index of the first character of the text that matched the whole regular expression.","abstract int start(int group) Returns the index of the first character of the text that matched a given group."],"package":"java.util.regex","constants":[],"class":"Matcher","constructors":[],"fields":[]}