{"methods":["float get(int x, int y) Returns the value for a given row and column","float[] getArray() Return a reference to the internal array representing matrix values.","boolean inverse() Sets the current matrix to its inverse","boolean inverseTranspose() Sets the current matrix to its inverse transpose","void load(Matrix4f src) Sets the values of the matrix to those of the parameter","void loadFrustum(float l, float r, float b, float t, float n, float f) Sets current values to be a perspective projection matrix","void loadIdentity() Sets the matrix values to identity","void loadMultiply(Matrix4f lhs, Matrix4f rhs) Sets current values to be the result of multiplying two given matrices","void loadOrtho(float l, float r, float b, float t, float n, float f) Set current values to be an orthographic projection matrix","void loadOrthoWindow(int w, int h) Set current values to be an orthographic projection matrix with the right and bottom clipping planes set to the given values.","void loadPerspective(float fovy, float aspect, float near, float far) Sets current values to be a perspective projection matrix","void loadProjectionNormalized(int w, int h) Helper function to set the current values to a perspective projection matrix with aspect ratio defined by the parameters and (near, far), (bottom, top) mapping to (-1, 1) at z = 0","void loadRotate(float rot, float x, float y, float z) Sets current values to be a rotation matrix of certain angle about a given axis","void loadScale(float x, float y, float z) Sets current values to be a scale matrix of given dimensions","void loadTranslate(float x, float y, float z) Sets current values to be a translation matrix of given dimensions","void multiply(Matrix4f rhs) Post-multiplies the current matrix by a given parameter","void rotate(float rot, float x, float y, float z) Modifies the current matrix by post-multiplying it with a rotation matrix of certain angle about a given axis","void scale(float x, float y, float z) Modifies the current matrix by post-multiplying it with a scale matrix of given dimensions","void set(int x, int y, float v) Sets the value for a given row and column","void translate(float x, float y, float z) Modifies the current matrix by post-multiplying it with a translation matrix of given dimensions","void transpose() Sets the current matrix to its transpose","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v8.renderscript","constants":[],"class":"Matrix4f","constructors":[],"fields":[]}