{"methods":["final Context getContext() Gets the context of the media route provider.","final MediaRouteProviderDescriptor getDescriptor() Gets the provider's descriptor.","final MediaRouteDiscoveryRequest getDiscoveryRequest() Gets the current discovery request which informs the provider about the kinds of routes to discover and whether to perform active scanning.","final Handler getHandler() Gets the provider's handler which is associated with the main thread.","final MediaRouteProvider.ProviderMetadata getMetadata() Gets some metadata about the provider's implementation.","MediaRouteProvider.RouteController onCreateRouteController(String routeId) Called by the media router to obtain a route controller for a particular route.","void onDiscoveryRequestChanged(MediaRouteDiscoveryRequest request) Called by the media router when the discovery request has changed.","final void setCallback(MediaRouteProvider.Callback callback) Sets a callback to invoke when the provider's descriptor changes.","final void setDescriptor(MediaRouteProviderDescriptor descriptor) Sets the provider's descriptor.","final void setDiscoveryRequest(MediaRouteDiscoveryRequest request) Sets a discovery request to inform the provider about the kinds of routes that its clients would like to discover and whether to perform active scanning.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.media","constants":[],"class":"MediaRouteProvider","constructors":[],"fields":[]}