{"methods":["final boolean containsKey(String name) Returns true iff a key of the given name exists in the format.","final static MediaFormat createAudioFormat(String mime, int sampleRate, int channelCount) Creates a minimal audio format.","final static MediaFormat createSubtitleFormat(String mime, String language) Creates a minimal subtitle format.","final static MediaFormat createVideoFormat(String mime, int width, int height) Creates a minimal video format.","final ByteBuffer getByteBuffer(String name) Returns the value of a ByteBuffer key.","boolean getFeatureEnabled(String feature) Returns whether a feature is to be enabled (true) or disabled (false).","final float getFloat(String name) Returns the value of a float key.","final int getInteger(String name) Returns the value of an integer key.","final long getLong(String name) Returns the value of a long key.","final String getString(String name) Returns the value of a string key.","final void setByteBuffer(String name, ByteBuffer bytes) Sets the value of a ByteBuffer key.","void setFeatureEnabled(String feature, boolean enabled) Sets whether a feature is to be enabled (true) or disabled (false).","final void setFloat(String name, float value) Sets the value of a float key.","final void setInteger(String name, int value) Sets the value of an integer key.","final void setLong(String name, long value) Sets the value of a long key.","final void setString(String name, String value) Sets the value of a string key.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media","constants":["String KEY_AAC_DRC_ATTENUATION_FACTOR A key describing the attenuation factor allowing to adapt the dynamics of the output to the actual listening requirements.","String KEY_AAC_DRC_BOOST_FACTOR A key describing the boost factor allowing to adapt the dynamics of the output to the actual listening requirements.","String KEY_AAC_DRC_HEAVY_COMPRESSION A key describing the selection of the heavy compression profile for DRC.","String KEY_AAC_DRC_TARGET_REFERENCE_LEVEL A key describing a gain to be applied so that the output loudness matches the Target Reference Level.","String KEY_AAC_ENCODED_TARGET_LEVEL A key describing the target reference level that was assumed at the encoder for calculation of attenuation gains for clipping prevention.","String KEY_AAC_MAX_OUTPUT_CHANNEL_COUNT A key describing the maximum number of channels that can be output by the AAC decoder.","String KEY_AAC_PROFILE A key describing the AAC profile to be used (AAC audio formats only).","String KEY_AAC_SBR_MODE A key describing the AAC SBR mode to be used (AAC audio formats only).","String KEY_AUDIO_SESSION_ID A key describing the audio session ID of the AudioTrack associated to a tunneled video codec.","String KEY_BITRATE_MODE A key describing the desired bitrate mode to be used by an encoder.","String KEY_BIT_RATE A key describing the bitrate in bits/sec.","String KEY_CAPTURE_RATE A key describing the capture rate of a video format in frames/sec.","String KEY_CHANNEL_COUNT A key describing the number of channels in an audio format.","String KEY_CHANNEL_MASK A key describing the channel composition of audio content.","String KEY_COLOR_FORMAT A key describing the color format of the content in a video format.","String KEY_COMPLEXITY A key describing the encoding complexity.","String KEY_DURATION A key describing the duration (in microseconds) of the content.","String KEY_FLAC_COMPRESSION_LEVEL A key describing the FLAC compression level to be used (FLAC audio format only).","String KEY_FRAME_RATE A key describing the frame rate of a video format in frames/sec.","String KEY_HEIGHT A key describing the height of the content in a video format.","String KEY_IS_ADTS A key mapping to a value of 1 if the content is AAC audio and audio frames are prefixed with an ADTS header.","String KEY_IS_AUTOSELECT A key for boolean AUTOSELECT behavior for the track.","String KEY_IS_DEFAULT A key for boolean DEFAULT behavior for the track.","String KEY_IS_FORCED_SUBTITLE A key for the FORCED field for subtitle tracks.","String KEY_I_FRAME_INTERVAL A key describing the frequency of I frames expressed in secs between I frames.","String KEY_LANGUAGE A key describing the language of the content, using either ISO 639-1 or 639-2/T codes.","String KEY_MAX_HEIGHT A key describing the maximum expected height of the content in a video decoder format, in case there are resolution changes in the video content.","String KEY_MAX_INPUT_SIZE A key describing the maximum size in bytes of a buffer of data described by this MediaFormat.","String KEY_MAX_WIDTH A key describing the maximum expected width of the content in a video decoder format, in case there are resolution changes in the video content.","String KEY_MIME A key describing the mime type of the MediaFormat.","String KEY_PROFILE A key describing the desired profile to be used by an encoder.","String KEY_PUSH_BLANK_BUFFERS_ON_STOP If specified when configuring a video decoder rendering to a surface, causes the decoder to output \"blank\", i.e.","String KEY_REPEAT_PREVIOUS_FRAME_AFTER Applies only when configuring a video encoder in \"surface-input\" mode.","String KEY_SAMPLE_RATE A key describing the sample rate of an audio format.","String KEY_TEMPORAL_LAYERING A key describing the temporal layering schema.","String KEY_WIDTH A key describing the width of the content in a video format.","String MIMETYPE_AUDIO_AAC","String MIMETYPE_AUDIO_AC3","String MIMETYPE_AUDIO_AMR_NB","String MIMETYPE_AUDIO_AMR_WB","String MIMETYPE_AUDIO_FLAC","String MIMETYPE_AUDIO_G711_ALAW","String MIMETYPE_AUDIO_G711_MLAW","String MIMETYPE_AUDIO_MPEG","String MIMETYPE_AUDIO_MSGSM","String MIMETYPE_AUDIO_OPUS","String MIMETYPE_AUDIO_QCELP","String MIMETYPE_AUDIO_RAW","String MIMETYPE_AUDIO_VORBIS","String MIMETYPE_TEXT_CEA_608 MIME type for CEA-608 closed caption data.","String MIMETYPE_TEXT_VTT MIME type for WebVTT subtitle data.","String MIMETYPE_VIDEO_AVC","String MIMETYPE_VIDEO_H263","String MIMETYPE_VIDEO_HEVC","String MIMETYPE_VIDEO_MPEG2","String MIMETYPE_VIDEO_MPEG4","String MIMETYPE_VIDEO_RAW","String MIMETYPE_VIDEO_VP8","String MIMETYPE_VIDEO_VP9"],"class":"MediaFormat","constructors":[],"fields":[]}