{"methods":["boolean areSizeAndRateSupported(int width, int height, double frameRate) Returns whether a given video size (width and height) and frameRate combination is supported.","Range<Integer> getBitrateRange() Returns the range of supported bitrates in bits/second.","int getHeightAlignment() Returns the alignment requirement for video height (in pixels).","Range<Integer> getSupportedFrameRates() Returns the range of supported frame rates.","Range<Double> getSupportedFrameRatesFor(int width, int height) Returns the range of supported video frame rates for a video size.","Range<Integer> getSupportedHeights() Returns the range of supported video heights.","Range<Integer> getSupportedHeightsFor(int width) Returns the range of supported video heights for a video width","Range<Integer> getSupportedWidths() Returns the range of supported video widths.","Range<Integer> getSupportedWidthsFor(int height) Returns the range of supported video widths for a video height.","int getWidthAlignment() Returns the alignment requirement for video width (in pixels).","boolean isSizeSupported(int width, int height) Returns whether a given video size (width and height) is supported.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media","constants":[],"class":"MediaCodecInfo.VideoCapabilities","constructors":[],"fields":[]}