{"methods":[],"package":"android.provider","constants":["String MEDIA_TYPE The media type (audio, video, image or playlist) of the file, or 0 for not a media file Type: TEXT","int MEDIA_TYPE_AUDIO Constant for the MEDIA_TYPE column indicating that file is an audio file.","int MEDIA_TYPE_IMAGE Constant for the MEDIA_TYPE column indicating that file is an image file.","int MEDIA_TYPE_NONE Constant for the MEDIA_TYPE column indicating that file is not an audio, image, video or playlist file.","int MEDIA_TYPE_PLAYLIST Constant for the MEDIA_TYPE column indicating that file is a playlist file.","int MEDIA_TYPE_VIDEO Constant for the MEDIA_TYPE column indicating that file is a video file.","String MIME_TYPE The MIME type of the file Type: TEXT","String PARENT The index of the parent directory of the file Type: INTEGER","String TITLE The title of the content Type: TEXT","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.MediaStore.MediaColumns String DATA The data stream for the file Type: DATA STREAM String DATE_ADDED The time the file was added to the media provider Units are seconds since 1970. String DATE_MODIFIED The time the file was last modified Units are seconds since 1970. String DISPLAY_NAME The display name of the file Type: TEXT String HEIGHT The height of the image/video in pixels. String MIME_TYPE The MIME type of the file Type: TEXT String SIZE The size of the file in bytes Type: INTEGER (long) String TITLE The title of the content Type: TEXT String WIDTH The width of the image/video in pixels.","String DATA The data stream for the file Type: DATA STREAM","String DATE_ADDED The time the file was added to the media provider Units are seconds since 1970.","String DATE_MODIFIED The time the file was last modified Units are seconds since 1970.","String DISPLAY_NAME The display name of the file Type: TEXT","String HEIGHT The height of the image/video in pixels.","String MIME_TYPE The MIME type of the file Type: TEXT","String SIZE The size of the file in bytes Type: INTEGER (long)","String TITLE The title of the content Type: TEXT","String WIDTH The width of the image/video in pixels."],"class":"MediaStore.Files.FileColumns","constructors":[],"fields":[]}