{"methods":["final static int getAudioSourceMax() Gets the maximum value for audio sources.","int getMaxAmplitude() Returns the maximum absolute amplitude that was sampled since the last call to this method.","Surface getSurface() Gets the surface to record from when using SURFACE video source.","void prepare() Prepares the recorder to begin capturing and encoding data.","void release() Releases resources associated with this MediaRecorder object.","void reset() Restarts the MediaRecorder to its idle state.","void setAudioChannels(int numChannels) Sets the number of audio channels for recording.","void setAudioEncoder(int audio_encoder) Sets the audio encoder to be used for recording.","void setAudioEncodingBitRate(int bitRate) Sets the audio encoding bit rate for recording.","void setAudioSamplingRate(int samplingRate) Sets the audio sampling rate for recording.","void setAudioSource(int audio_source) Sets the audio source to be used for recording.","void setCamera(Camera c) This method was deprecated in API level 21. Use getSurface() and the android.hardware.camera2 API instead.","void setCaptureRate(double fps) Set video frame capture rate.","void setLocation(float latitude, float longitude) Set and store the geodata (latitude and longitude) in the output file.","void setMaxDuration(int max_duration_ms) Sets the maximum duration (in ms) of the recording session.","void setMaxFileSize(long max_filesize_bytes) Sets the maximum filesize (in bytes) of the recording session.","void setOnErrorListener(MediaRecorder.OnErrorListener l) Register a callback to be invoked when an error occurs while recording.","void setOnInfoListener(MediaRecorder.OnInfoListener listener) Register a callback to be invoked when an informational event occurs while recording.","void setOrientationHint(int degrees) Sets the orientation hint for output video playback.","void setOutputFile(FileDescriptor fd) Pass in the file descriptor of the file to be written.","void setOutputFile(String path) Sets the path of the output file to be produced.","void setOutputFormat(int output_format) Sets the format of the output file produced during recording.","void setPreviewDisplay(Surface sv) Sets a Surface to show a preview of recorded media (video).","void setProfile(CamcorderProfile profile) Uses the settings from a CamcorderProfile object for recording.","void setVideoEncoder(int video_encoder) Sets the video encoder to be used for recording.","void setVideoEncodingBitRate(int bitRate) Sets the video encoding bit rate for recording.","void setVideoFrameRate(int rate) Sets the frame rate of the video to be captured.","void setVideoSize(int width, int height) Sets the width and height of the video to be captured.","void setVideoSource(int video_source) Sets the video source to be used for recording.","void start() Begins capturing and encoding data to the file specified with setOutputFile().","void stop() Stops recording.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media","constants":["int MEDIA_ERROR_SERVER_DIED Media server died.","int MEDIA_RECORDER_ERROR_UNKNOWN Unspecified media recorder error.","int MEDIA_RECORDER_INFO_MAX_DURATION_REACHED A maximum duration had been setup and has now been reached.","int MEDIA_RECORDER_INFO_MAX_FILESIZE_REACHED A maximum filesize had been setup and has now been reached.","int MEDIA_RECORDER_INFO_UNKNOWN Unspecified media recorder error."],"class":"MediaRecorder","constructors":[],"fields":[]}