{"methods":["MediaController getController() Get a controller for this session.","MediaSession.Token getSessionToken() Retrieve a token object that can be used by apps to create a MediaController for interacting with this session.","boolean isActive() Get the current active state of this session.","void release() This must be called when an app has finished performing playback.","void sendSessionEvent(String event, Bundle extras) Send a proprietary event to all MediaControllers listening to this Session.","void setActive(boolean active) Set if this session is currently active and ready to receive commands.","void setCallback(MediaSession.Callback callback) Set the callback to receive updates for the MediaSession.","void setCallback(MediaSession.Callback callback, Handler handler) Set the callback to receive updates for the MediaSession.","void setExtras(Bundle extras) Set some extras that can be associated with the MediaSession.","void setFlags(int flags) Set any flags for the session.","void setMediaButtonReceiver(PendingIntent mbr) Set a pending intent for your media button receiver to allow restarting playback after the session has been stopped.","void setMetadata(MediaMetadata metadata) Update the current metadata.","void setPlaybackState(PlaybackState state) Update the current playback state.","void setPlaybackToLocal(AudioAttributes attributes) Set the attributes for this session's audio.","void setPlaybackToRemote(VolumeProvider volumeProvider) Configure this session to use remote volume handling.","void setQueue(List<MediaSession.QueueItem> queue) Update the list of items in the play queue.","void setQueueTitle(CharSequence title) Set the title of the play queue.","void setSessionActivity(PendingIntent pi) Set an intent for launching UI for this Session.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.session","constants":["int FLAG_HANDLES_MEDIA_BUTTONS Set this flag on the session to indicate that it can handle media button events.","int FLAG_HANDLES_TRANSPORT_CONTROLS Set this flag on the session to indicate that it handles transport control commands through its MediaSession.Callback."],"class":"MediaSession","constructors":[],"fields":[]}