{"methods":["void onCommand(String command, Bundle args, ResultReceiver cb) Called when a controller has sent a command to this session.","void onCustomAction(String action, Bundle extras) Called when a MediaController wants a PlaybackState.CustomAction to be performed.","void onFastForward() Override to handle requests to fast forward.","boolean onMediaButtonEvent(Intent mediaButtonIntent) Called when a media button is pressed and this session has the highest priority or a controller sends a media button event to the session.","void onPause() Override to handle requests to pause playback.","void onPlay() Override to handle requests to begin playback.","void onPlayFromMediaId(String mediaId, Bundle extras) Override to handle requests to play a specific mediaId that was provided by your app's MediaBrowserService.","void onPlayFromSearch(String query, Bundle extras) Override to handle requests to begin playback from a search query.","void onRewind() Override to handle requests to rewind.","void onSeekTo(long pos) Override to handle requests to seek to a specific position in ms.","void onSetRating(Rating rating) Override to handle the item being rated.","void onSkipToNext() Override to handle requests to skip to the next media item.","void onSkipToPrevious() Override to handle requests to skip to the previous media item.","void onSkipToQueueItem(long id) Override to handle requests to play an item with a given id from the play queue.","void onStop() Override to handle requests to stop playback.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.session","constants":[],"class":"MediaSession.Callback","constructors":[],"fields":[]}