{"methods":["void connect() Initiates a connection to the media scanner service.","void disconnect() Releases the connection to the media scanner service.","synchronized boolean isConnected() Returns whether we are connected to the media scanner service","void onServiceConnected(ComponentName className, IBinder service) Part of the ServiceConnection interface.","void onServiceDisconnected(ComponentName className) Part of the ServiceConnection interface.","static void scanFile(Context context, String[] paths, String[] mimeTypes, MediaScannerConnection.OnScanCompletedListener callback) Convenience for constructing a MediaScannerConnection, calling connect() on it, and calling scanFile(Context, String[], String[], MediaScannerConnection.OnScanCompletedListener) with the given path and mimeType when the connection is established.","void scanFile(String path, String mimeType) Requests the media scanner to scan a file.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.content.ServiceConnection abstract void onServiceConnected(ComponentName name, IBinder service) Called when a connection to the Service has been established, with the IBinder of the communication channel to the Service. abstract void onServiceDisconnected(ComponentName name) Called when a connection to the Service has been lost.","abstract void onServiceConnected(ComponentName name, IBinder service) Called when a connection to the Service has been established, with the IBinder of the communication channel to the Service.","abstract void onServiceDisconnected(ComponentName name) Called when a connection to the Service has been lost."],"package":"android.media","constants":[],"class":"MediaScannerConnection","constructors":[],"fields":[]}