{"methods":["final static Uri getContentUri(String volumeName, long artistId)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["[Expand] Inherited Constants","From interface android.provider.MediaStore.Audio.AlbumColumns String ALBUM The album on which the audio file appears, if any Type: TEXT String ALBUM_ART Cached album art. String ALBUM_ID The id for the album Type: INTEGER String ALBUM_KEY A non human readable key calculated from the ALBUM, used for searching, sorting and grouping Type: TEXT String ARTIST The artist whose songs appear on this album Type: TEXT String FIRST_YEAR The year in which the earliest songs on this album were released. String LAST_YEAR The year in which the latest songs on this album were released. String NUMBER_OF_SONGS The number of songs on this album Type: INTEGER String NUMBER_OF_SONGS_FOR_ARTIST This column is available when getting album info via artist, and indicates the number of songs on the album by the given artist.","String ALBUM The album on which the audio file appears, if any Type: TEXT","String ALBUM_ART Cached album art.","String ALBUM_ID The id for the album Type: INTEGER","String ALBUM_KEY A non human readable key calculated from the ALBUM, used for searching, sorting and grouping Type: TEXT","String ARTIST The artist whose songs appear on this album Type: TEXT","String FIRST_YEAR The year in which the earliest songs on this album were released.","String LAST_YEAR The year in which the latest songs on this album were released.","String NUMBER_OF_SONGS The number of songs on this album Type: INTEGER","String NUMBER_OF_SONGS_FOR_ARTIST This column is available when getting album info via artist, and indicates the number of songs on the album by the given artist."],"class":"MediaStore.Audio.Artists.Albums","constructors":[],"fields":[]}