{"methods":["boolean equals(Object other)","String getContentId() Returns the content ID of the media track.","String getContentType() Returns the content type (MIME type) of the media track, or null if none was specified.","JSONObject getCustomData() Returns the custom data object for this media track, or null if none was specified.","long getId() Returns the unique ID of the media track.","String getLanguage() Returns the language of this media track in RFC-5464 format, or null if none was specified.","String getName() Returns the name of the media track, or null if none was specified.","int getSubtype() Returns the subtype of this media track; one of the SUBTYPE_ constants.","int getType() Returns the type of the track; one of the TYPE_ constants.","int hashCode()","void setContentId(String contentId) Sets the content ID for the media track.","void setContentType(String contentType) Sets the content type (MIME type) of the media track.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.cast","constants":["int SUBTYPE_CAPTIONS A media track subtype indicating closed captions.","int SUBTYPE_CHAPTERS A media track subtype indicating chapters.","int SUBTYPE_DESCRIPTIONS A media track subtype indicating descriptions.","int SUBTYPE_METADATA A media track subtype indicating metadata.","int SUBTYPE_NONE A media track subtype indicating no subtype.","int SUBTYPE_SUBTITLES A media track subtype indicating subtitles.","int SUBTYPE_UNKNOWN A media track subtype indicating an unknown subtype.","int TYPE_AUDIO A media track type indicating an audio track.","int TYPE_TEXT A media track type indicating a text track.","int TYPE_UNKNOWN A media track type indicating an unknown track type.","int TYPE_VIDEO A media track type indicating a video track."],"class":"MediaTrack","constructors":[],"fields":[]}