{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.media","constants":["String ACTION_END_SESSION Remote playback media control action: End session.","String ACTION_ENQUEUE Remote playback media control action: Enqueue media item.","String ACTION_GET_SESSION_STATUS Remote playback media control action: Get media session status information.","String ACTION_GET_STATUS Remote playback media control action: Get media item playback status and progress information.","String ACTION_PAUSE Remote playback media control action: Pause media playback.","String ACTION_PLAY Remote playback media control action: Play media item.","String ACTION_REMOVE Remote playback media control action: Remove media item from session's queue.","String ACTION_RESUME Remote playback media control action: Resume media playback (unpause).","String ACTION_SEEK Remote playback media control action: Seek media item to a new playback position.","String ACTION_START_SESSION Remote playback media control action: Start session.","String ACTION_STOP Remote playback media control action: Stop media playback (clear queue and unpause).","String CATEGORY_LIVE_AUDIO Media control category: Live audio.","String CATEGORY_LIVE_VIDEO Media control category: Live video.","String CATEGORY_REMOTE_PLAYBACK Media control category: Remote playback.","int ERROR_INVALID_ITEM_ID Error code: The item id specified in the request was invalid.","int ERROR_INVALID_SESSION_ID Error code: The session id specified in the request was invalid.","int ERROR_UNKNOWN Error code: An unknown error occurred.","int ERROR_UNSUPPORTED_OPERATION Error code: The operation is not supported.","String EXTRA_ERROR_CODE Integer extra: Error code.","String EXTRA_ITEM_CONTENT_POSITION Long extra: Media item content position.","String EXTRA_ITEM_HTTP_HEADERS Bundle extra: HTTP request headers.","String EXTRA_ITEM_ID Bundle extra: Media item id.","String EXTRA_ITEM_METADATA Bundle extra: Media item metadata.","String EXTRA_ITEM_STATUS Bundle extra: Media item status.","String EXTRA_ITEM_STATUS_UPDATE_RECEIVER Bundle extra: Media item status update receiver.","String EXTRA_SESSION_ID Bundle extra: Media session id.","String EXTRA_SESSION_STATUS Bundle extra: Media session status.","String EXTRA_SESSION_STATUS_UPDATE_RECEIVER Bundle extra: Media item status update receiver."],"class":"MediaControlIntent","constructors":[],"fields":[]}