{"methods":["void fastForward() Start fast forwarding.","void pause() Request that the player pause its playback and stay at its current position.","void play() Request that the player start its playback at its current position.","void playFromMediaId(String mediaId, Bundle extras) Request that the player start playback for a specific Uri.","void playFromSearch(String query, Bundle extras) Request that the player start playback for a specific search query.","void rewind() Start rewinding.","void seekTo(long pos) Move to a new location in the media stream.","void sendCustomAction(String action, Bundle args) Send the id and args from a custom action back for the MediaSession to perform.","void sendCustomAction(PlaybackState.CustomAction customAction, Bundle args) Send a custom action back for the MediaSession to perform.","void setRating(Rating rating) Rate the current content.","void skipToNext() Skip to the next item.","void skipToPrevious() Skip to the previous item.","void skipToQueueItem(long id) Play an item with a specific id in the play queue.","void stop() Request that the player stop its playback; it may clear its state in whatever way is appropriate.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.session","constants":[],"class":"MediaController.TransportControls","constructors":[],"fields":[]}