{"methods":["MediaRouteDescriptor.Builder addControlFilter(IntentFilter filter) Adds a media control intent filter for the route.","MediaRouteDescriptor.Builder addControlFilters(Collection<IntentFilter> filters) Adds a list of media control intent filters for the route.","MediaRouteDescriptor build() Builds the media route descriptor.","MediaRouteDescriptor.Builder setConnecting(boolean connecting) Sets whether the route is in the process of connecting and is not yet ready for use.","MediaRouteDescriptor.Builder setDescription(String description) Sets the user-visible description of the route.","MediaRouteDescriptor.Builder setEnabled(boolean enabled) Sets whether the route is enabled.","MediaRouteDescriptor.Builder setExtras(Bundle extras) Sets a bundle of extras for this route descriptor.","MediaRouteDescriptor.Builder setId(String id) Sets the unique id of the route.","MediaRouteDescriptor.Builder setName(String name) Sets the user-visible name of the route.","MediaRouteDescriptor.Builder setPlaybackStream(int playbackStream) Sets the route's playback stream.","MediaRouteDescriptor.Builder setPlaybackType(int playbackType) Sets the route's playback type.","MediaRouteDescriptor.Builder setPresentationDisplayId(int presentationDisplayId) Sets the route's presentation display id, or -1 if none.","MediaRouteDescriptor.Builder setVolume(int volume) Sets the route's current volume, or 0 if unknown.","MediaRouteDescriptor.Builder setVolumeHandling(int volumeHandling) Sets the route's volume handling.","MediaRouteDescriptor.Builder setVolumeMax(int volumeMax) Sets the route's maximum volume, or 0 if unknown.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.media","constants":[],"class":"MediaRouteDescriptor.Builder","constructors":[],"fields":[]}