{"methods":["static void cancelThumbnailRequest(ContentResolver cr, long origId) This method cancels the thumbnail request so clients waiting for getThumbnail will be interrupted and return immediately.","static void cancelThumbnailRequest(ContentResolver cr, long origId, long groupId) This method cancels the thumbnail request so clients waiting for getThumbnail will be interrupted and return immediately.","static Uri getContentUri(String volumeName) Get the content:// style URI for the image media table on the given volume.","static Bitmap getThumbnail(ContentResolver cr, long origId, long groupId, int kind, BitmapFactory.Options options) This method checks if the thumbnails of the specified image (origId) has been created.","static Bitmap getThumbnail(ContentResolver cr, long origId, int kind, BitmapFactory.Options options) This method checks if the thumbnails of the specified image (origId) has been created.","final static Cursor query(ContentResolver cr, Uri uri, String[] projection)","final static Cursor queryMiniThumbnail(ContentResolver cr, long origId, int kind, String[] projection)","final static Cursor queryMiniThumbnails(ContentResolver cr, Uri uri, int kind, String[] projection)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String DATA The data stream for the thumbnail Type: DATA STREAM","String DEFAULT_SORT_ORDER The default sort order for this table","int FULL_SCREEN_KIND","String HEIGHT The height of the thumbnail Type: INTEGER (long)","String IMAGE_ID The original image for the thumbnal Type: INTEGER (ID from Images table)","String KIND The kind of the thumbnail Type: INTEGER (One of the values below)","int MICRO_KIND","int MINI_KIND","String THUMB_DATA The blob raw data of thumbnail Type: DATA STREAM","String WIDTH The width of the thumbnal Type: INTEGER (long)","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"MediaStore.Images.Thumbnails","constructors":[],"fields":["public static final Uri EXTERNAL_CONTENT_URI The content:// style URI for the \"primary\" external storage volume.","public static final Uri INTERNAL_CONTENT_URI The content:// style URI for the internal storage."]}