{"methods":["abstract boolean collapseActionView() Collapse the action view associated with this menu item.","abstract boolean expandActionView() Expand the action view associated with this menu item.","abstract ActionProvider getActionProvider() Gets the ActionProvider.","abstract View getActionView() Returns the currently set action view for this menu item.","abstract char getAlphabeticShortcut() Return the char for this menu item's alphabetic shortcut.","abstract int getGroupId() Return the group identifier that this menu item is part of.","abstract Drawable getIcon() Returns the icon for this item as a Drawable (getting it from resources if it hasn't been loaded before).","abstract Intent getIntent() Return the Intent associated with this item.","abstract int getItemId() Return the identifier for this menu item.","abstract ContextMenu.ContextMenuInfo getMenuInfo() Gets the extra information linked to this menu item.","abstract char getNumericShortcut() Return the char for this menu item's numeric (12-key) shortcut.","abstract int getOrder() Return the category and order within the category of this item.","abstract SubMenu getSubMenu() Get the sub-menu to be invoked when this item is selected, if it has one.","abstract CharSequence getTitle() Retrieve the current title of the item.","abstract CharSequence getTitleCondensed() Retrieve the current condensed title of the item.","abstract boolean hasSubMenu() Check whether this item has an associated sub-menu.","abstract boolean isActionViewExpanded() Returns true if this menu item's action view has been expanded.","abstract boolean isCheckable() Return whether the item can currently display a check mark.","abstract boolean isChecked() Return whether the item is currently displaying a check mark.","abstract boolean isEnabled() Return the enabled state of the menu item.","abstract boolean isVisible() Return the visibility of the menu item.","abstract MenuItem setActionProvider(ActionProvider actionProvider) Sets the ActionProvider responsible for creating an action view if the item is placed on the action bar.","abstract MenuItem setActionView(int resId) Set an action view for this menu item.","abstract MenuItem setActionView(View view) Set an action view for this menu item.","abstract MenuItem setAlphabeticShortcut(char alphaChar) Change the alphabetic shortcut associated with this item.","abstract MenuItem setCheckable(boolean checkable) Control whether this item can display a check mark.","abstract MenuItem setChecked(boolean checked) Control whether this item is shown with a check mark.","abstract MenuItem setEnabled(boolean enabled) Sets whether the menu item is enabled.","abstract MenuItem setIcon(Drawable icon) Change the icon associated with this item.","abstract MenuItem setIcon(int iconRes) Change the icon associated with this item.","abstract MenuItem setIntent(Intent intent) Change the Intent associated with this item.","abstract MenuItem setNumericShortcut(char numericChar) Change the numeric shortcut associated with this item.","abstract MenuItem setOnActionExpandListener(MenuItem.OnActionExpandListener listener) Set an MenuItem.OnActionExpandListener on this menu item to be notified when the associated action view is expanded or collapsed.","abstract MenuItem setOnMenuItemClickListener(MenuItem.OnMenuItemClickListener menuItemClickListener) Set a custom listener for invocation of this menu item.","abstract MenuItem setShortcut(char numericChar, char alphaChar) Change both the numeric and alphabetic shortcut associated with this item.","abstract void setShowAsAction(int actionEnum) Sets how this item should display in the presence of an Action Bar.","abstract MenuItem setShowAsActionFlags(int actionEnum) Sets how this item should display in the presence of an Action Bar.","abstract MenuItem setTitle(CharSequence title) Change the title associated with this item.","abstract MenuItem setTitle(int title) Change the title associated with this item.","abstract MenuItem setTitleCondensed(CharSequence title) Change the condensed title associated with this item.","abstract MenuItem setVisible(boolean visible) Sets the visibility of the menu item."],"package":"android.view","constants":["int SHOW_AS_ACTION_ALWAYS Always show this item as a button in an Action Bar.","int SHOW_AS_ACTION_COLLAPSE_ACTION_VIEW This item's action view collapses to a normal menu item.","int SHOW_AS_ACTION_IF_ROOM Show this item as a button in an Action Bar if the system decides there is room for it.","int SHOW_AS_ACTION_NEVER Never show this item as a button in an Action Bar.","int SHOW_AS_ACTION_WITH_TEXT When this item is in the action bar, always show it with a text label even if it also has an icon specified."],"class":"MenuItem","constructors":[],"fields":[]}