{"methods":["static boolean collapseActionView(MenuItem item) Collapse the action view associated with this menu item.","static boolean expandActionView(MenuItem item) Expand the action view associated with this menu item.","static ActionProvider getActionProvider(MenuItem item) Gets the ActionProvider.","static View getActionView(MenuItem item) Returns the currently set action view for this menu item.","static boolean isActionViewExpanded(MenuItem item) Returns true if this menu item's action view has been expanded.","static MenuItem setActionProvider(MenuItem item, ActionProvider provider) Sets the ActionProvider responsible for creating an action view if the item is placed on the action bar.","static MenuItem setActionView(MenuItem item, int resId) Set an action view for this menu item.","static MenuItem setActionView(MenuItem item, View view) Set an action view for this menu item.","static MenuItem setOnActionExpandListener(MenuItem item, MenuItemCompat.OnActionExpandListener listener) Set an MenuItemCompat.OnActionExpandListener on this menu item to be notified when the associated action view is expanded or collapsed.","static void setShowAsAction(MenuItem item, int actionEnum) Sets how this item should display in the presence of a compatible Action Bar.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.view","constants":["int SHOW_AS_ACTION_ALWAYS Always show this item as a button in an Action Bar.","int SHOW_AS_ACTION_COLLAPSE_ACTION_VIEW This item's action view collapses to a normal menu item.","int SHOW_AS_ACTION_IF_ROOM Show this item as a button in an Action Bar if the system decides there is room for it.","int SHOW_AS_ACTION_NEVER Never show this item as a button in an Action Bar.","int SHOW_AS_ACTION_WITH_TEXT When this item is in the action bar, always show it with a text label even if it also has an icon specified."],"class":"MenuItemCompat","constructors":[],"fields":[]}