{"methods":["void applyPattern(String template) Changes this MessageFormat to use the specified pattern.","Object clone() Returns a new instance of MessageFormat with the same pattern and formats as this MessageFormat.","boolean equals(Object object) Compares the specified object to this MessageFormat and indicates if they are equal.","final StringBuffer format(Object[] objects, StringBuffer buffer, FieldPosition field) Converts the specified objects into a string which it appends to the specified string buffer using the pattern of this message format.","static String format(String format, Object... args) Formats the supplied objects using the specified message format pattern.","final StringBuffer format(Object object, StringBuffer buffer, FieldPosition field) Converts the specified objects into a string which it appends to the specified string buffer using the pattern of this message format.","AttributedCharacterIterator formatToCharacterIterator(Object object) Formats the specified object using the rules of this message format and returns an AttributedCharacterIterator with the formatted message and attributes.","Format[] getFormats() Returns the Format instances used by this message format.","Format[] getFormatsByArgumentIndex() Returns the formats used for each argument index.","Locale getLocale() Returns the locale used when creating formats.","int hashCode() Returns an integer hash code for this object.","Object[] parse(String string) Parses the message arguments from the specified string using the rules of this message format.","Object[] parse(String string, ParsePosition position) Parses the message argument from the specified string starting at the index specified by position.","Object parseObject(String string, ParsePosition position) Parses the message argument from the specified string starting at the index specified by position.","void setFormat(int offset, Format format) Sets the specified format used by this message format.","void setFormatByArgumentIndex(int argIndex, Format format) Sets the format used for the argument at index argIndex to format.","void setFormats(Format[] formats) Sets the formats used by this message format.","void setFormatsByArgumentIndex(Format[] formats) Sets the formats used for each argument.","void setLocale(Locale locale) Sets the locale to use when creating Format instances.","String toPattern() Returns the pattern of this message format.","[Expand] Inherited Methods","From class java.text.Format Object clone() Returns a copy of this Format instance. final String format(Object object) Formats the specified object using the rules of this format. abstract StringBuffer format(Object object, StringBuffer buffer, FieldPosition field) Appends the specified object to the specified string buffer using the rules of this format. AttributedCharacterIterator formatToCharacterIterator(Object object) Formats the specified object using the rules of this format and returns an AttributedCharacterIterator with the formatted string and no attributes. Object parseObject(String string) Parses the specified string using the rules of this format. abstract Object parseObject(String string, ParsePosition position) Parses the specified string starting at the index specified by position.","Object clone() Returns a copy of this Format instance.","final String format(Object object) Formats the specified object using the rules of this format.","abstract StringBuffer format(Object object, StringBuffer buffer, FieldPosition field) Appends the specified object to the specified string buffer using the rules of this format.","AttributedCharacterIterator formatToCharacterIterator(Object object) Formats the specified object using the rules of this format and returns an AttributedCharacterIterator with the formatted string and no attributes.","Object parseObject(String string) Parses the specified string using the rules of this format.","abstract Object parseObject(String string, ParsePosition position) Parses the specified string starting at the index specified by position.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.text","constants":[],"class":"MessageFormat","constructors":[],"fields":[]}