{"methods":["static int classModifiers() Returns a mask of all the modifiers that may be applied to classes.","static int constructorModifiers() Returns a mask of all the modifiers that may be applied to constructors.","static int fieldModifiers() Returns a mask of all the modifiers that may be applied to fields.","static int interfaceModifiers() Returns a mask of all the modifiers that may be applied to interfaces.","static boolean isAbstract(int modifiers) Returns true if the given modifiers contain ABSTRACT.","static boolean isFinal(int modifiers) Returns true if the given modifiers contain FINAL.","static boolean isInterface(int modifiers) Returns true if the given modifiers contain INTERFACE.","static boolean isNative(int modifiers) Returns true if the given modifiers contain NATIVE.","static boolean isPrivate(int modifiers) Returns true if the given modifiers contain PRIVATE.","static boolean isProtected(int modifiers) Returns true if the given modifiers contain PROTECTED.","static boolean isPublic(int modifiers) Returns true if the given modifiers contain PUBLIC.","static boolean isStatic(int modifiers) Returns true if the given modifiers contain STATIC.","static boolean isStrict(int modifiers) Returns true if the given modifiers contain STRICT.","static boolean isSynchronized(int modifiers) Returns true if the given modifiers contain SYNCHRONIZED.","static boolean isTransient(int modifiers) Returns true if the given modifiers contain TRANSIENT.","static boolean isVolatile(int modifiers) Returns true if the given modifiers contain VOLATILE.","static int methodModifiers() Returns a mask of all the modifiers that may be applied to methods.","static String toString(int modifiers) Returns a string containing the string representation of all modifiers present in the specified modifiers.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.lang.reflect","constants":["int ABSTRACT The int value representing the abstract modifier.","int FINAL The int value representing the final modifier.","int INTERFACE The int value representing the interface modifier.","int NATIVE The int value representing the native modifier.","int PRIVATE The int value representing the private modifier.","int PROTECTED The int value representing the protected modifier.","int PUBLIC The int value representing the public modifier.","int STATIC The int value representing the static modifier.","int STRICT The int value representing the strictfp modifier.","int SYNCHRONIZED The int value representing the synchronized modifier.","int TRANSIENT The int value representing the transient modifier.","int VOLATILE The int value representing the volatile modifier."],"class":"Modifier","constructors":[],"fields":[]}