{"methods":["static void assertAssignableFrom(Class<?> expected, Class<?> actual) Asserts that class expected is assignable from the class actual.","static void assertAssignableFrom(Class<?> expected, Object actual) Asserts that the class expected is assignable from the object actual.","static MatchResult assertContainsRegex(String expectedRegex, String actual) Variant of assertContainsRegex(String, String, String) using a generic message.","static MatchResult assertContainsRegex(String message, String expectedRegex, String actual) Asserts that expectedRegex matches any substring of actual and fails with message if it does not.","static void assertContentsInAnyOrder(Iterable<?> actual, Object... expected) Variant of assertContentsInAnyOrder(String, Iterable, Object...) using a generic message.","static void assertContentsInAnyOrder(String message, Iterable<?> actual, Object... expected) Asserts that actual contains precisely the elements expected, but in any order.","static void assertContentsInOrder(Iterable<?> actual, Object... expected) Variant of assertContentsInOrder(String, Iterable, Object...) using a generic message.","static void assertContentsInOrder(String message, Iterable<?> actual, Object... expected) Asserts that actual contains precisely the elements expected, and in the same order.","static void assertEmpty(Iterable<?> iterable) Variant of assertEmpty(String, Iterable) using a generic message.","static void assertEmpty(String message, Map<?, ?> map) Asserts that map is empty.","static void assertEmpty(String message, Iterable<?> iterable) Asserts that iterable is empty.","static void assertEmpty(Map<?, ?> map) Variant of assertEmpty(String, Map) using a generic message.","static void assertEquals(int[] expected, int[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static void assertEquals(Set<? extends Object> expected, Set<? extends Object> actual) Asserts that two sets contain the same elements.","static void assertEquals(byte[] expected, byte[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static void assertEquals(String message, Object[] expected, Object[] actual) Asserts that array actual is the same size and every element is the same as those in array expected.","static void assertEquals(String message, Set<? extends Object> expected, Set<? extends Object> actual) Asserts that two sets contain the same elements.","static void assertEquals(Object[] expected, Object[] actual) Asserts that array actual is the same size and every element is the same as those in array expected.","static void assertEquals(double[] expected, double[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static void assertEquals(String message, int[] expected, int[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static void assertEquals(String message, double[] expected, double[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static void assertEquals(String message, byte[] expected, byte[] actual) Asserts that array actual is the same size and every element equals those in array expected.","static MatchResult assertMatchesRegex(String message, String expectedRegex, String actual) Asserts that expectedRegex exactly matches actual and fails with message if it does not.","static MatchResult assertMatchesRegex(String expectedRegex, String actual) Variant of assertMatchesRegex(String, String, String) using a generic message.","static void assertNotContainsRegex(String message, String expectedRegex, String actual) Asserts that expectedRegex does not match any substring of actual, and fails with message if it does.","static void assertNotContainsRegex(String expectedRegex, String actual) Variant of assertNotContainsRegex(String, String, String) using a generic message.","static void assertNotEmpty(Iterable<?> iterable) Variant of assertNotEmpty(String, Iterable) using a generic message.","static void assertNotEmpty(Map<?, ?> map) Variant of assertNotEmpty(String, Map) using a generic message.","static void assertNotEmpty(String message, Map<?, ?> map) Asserts that map is not empty.","static void assertNotEmpty(String message, Iterable<?> iterable) Asserts that iterable is not empty.","static void assertNotEqual(Object unexpected, Object actual) Variant of assertNotEqual(String, Object, Object) using a generic message.","static void assertNotEqual(String message, Object unexpected, Object actual) Asserts that actual is not equal unexpected, according to both == and equals(Object).","static void assertNotMatchesRegex(String expectedRegex, String actual) Variant of assertNotMatchesRegex(String, String, String) using a generic message.","static void assertNotMatchesRegex(String message, String expectedRegex, String actual) Asserts that expectedRegex does not exactly match actual, and fails with message if it does.","static void checkEqualsAndHashCodeMethods(String message, Object lhs, Object rhs, boolean expectedResult) Utility for testing equals() and hashCode() results at once.","static void checkEqualsAndHashCodeMethods(Object lhs, Object rhs, boolean expectedResult) Variant of checkEqualsAndHashCodeMethods(String,Object,Object,boolean...)} using a generic message.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.test","constants":[],"class":"MoreAsserts","constructors":[],"fields":[]}