{"methods":["void clear() Clears the contents of this object.","void copyFrom(MotionEvent.PointerCoords other) Copies the contents of another pointer coords object.","float getAxisValue(int axis) Gets the value associated with the specified axis.","void setAxisValue(int axis, float value) Sets the value associated with the specified axis.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"MotionEvent.PointerCoords","constructors":[],"fields":["public float orientation The orientation of the touch area and tool area in radians clockwise from vertical.","public float pressure A normalized value that describes the pressure applied to the device by a finger or other tool.","public float size A normalized value that describes the approximate size of the pointer touch area in relation to the maximum detectable size of the device.","public float toolMajor The length of the major axis of an ellipse that describes the size of the approaching tool.","public float toolMinor The length of the minor axis of an ellipse that describes the size of the approaching tool.","public float touchMajor The length of the major axis of an ellipse that describes the touch area at the point of contact.","public float touchMinor The length of the minor axis of an ellipse that describes the touch area at the point of contact.","public float x The X component of the pointer movement.","public float y The Y component of the pointer movement."]}