{"methods":["static boolean isAbstractObject(int format) Returns true if the object is abstract (that is, it has no representation in the underlying file system).","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.mtp","constants":["int ASSOCIATION_TYPE_GENERIC_FOLDER Association type for objects representing file system directories.","int FORMAT_3GP_CONTAINER Format code for 3GP files","int FORMAT_AAC Format code for AAC audio files","int FORMAT_ABSTRACT_AUDIO_ALBUM Format code for audio albums","int FORMAT_ABSTRACT_AUDIO_PLAYLIST Format code for abstract audio playlists","int FORMAT_ABSTRACT_AV_PLAYLIST Format code for abstract AV playlists","int FORMAT_ABSTRACT_DOCUMENT Format code for abstract documents","int FORMAT_ABSTRACT_IMAGE_ALBUM Format code for image albums","int FORMAT_ABSTRACT_MEDIACAST Format code for abstract mediacasts","int FORMAT_ABSTRACT_MULTIMEDIA_ALBUM Format code for multimedia albums","int FORMAT_ABSTRACT_VIDEO_ALBUM Format code for video albums","int FORMAT_ABSTRACT_VIDEO_PLAYLIST Format code for abstract video playlists","int FORMAT_AIFF Format code for AIFF audio files","int FORMAT_ASF Format code for ASF files","int FORMAT_ASSOCIATION Format code for associations (folders and directories)","int FORMAT_ASX_PLAYLIST Format code for ASX playlist files","int FORMAT_AUDIBLE Format code for Audible audio files","int FORMAT_AVI Format code for AVI video files","int FORMAT_BMP Format code for BMP image files","int FORMAT_DPOF Format code for DPOF files","int FORMAT_EXECUTABLE Format code for executable files","int FORMAT_EXIF_JPEG Format code for JPEG image files","int FORMAT_FLAC Format code for FLAC audio files","int FORMAT_GIF Format code for GIF image files","int FORMAT_HTML Format code for HTML files","int FORMAT_JFIF Format code for JFIF image files","int FORMAT_JP2 Format code for JP2 files","int FORMAT_JPX Format code for JPX files","int FORMAT_M3U_PLAYLIST Format code for M3u playlist files","int FORMAT_MP2 Format code for MP2 files","int FORMAT_MP3 Format code for MP3 audio files","int FORMAT_MP4_CONTAINER Format code for MP4 files","int FORMAT_MPEG Format code for MPEG video files","int FORMAT_MPL_PLAYLIST Format code for MPL playlist files","int FORMAT_MS_EXCEL_SPREADSHEET Format code for MS Excel spreadsheets","int FORMAT_MS_POWERPOINT_PRESENTATION Format code for MS PowerPoint presentatiosn","int FORMAT_MS_WORD_DOCUMENT Format code for MS Word documents","int FORMAT_OGG Format code for OGG audio files","int FORMAT_PICT Format code for PICT image files","int FORMAT_PLS_PLAYLIST Format code for PLS playlist files","int FORMAT_PNG Format code for PNG image files","int FORMAT_SCRIPT Format code for script files","int FORMAT_TEXT Format code for text files","int FORMAT_TIFF Format code for TIFF image files","int FORMAT_TIFF_EP Format code for TIFF EP image files","int FORMAT_UNDEFINED Undefined format code","int FORMAT_UNDEFINED_AUDIO Format code for undefined audio files files","int FORMAT_UNDEFINED_COLLECTION Format code for undefined collections","int FORMAT_UNDEFINED_DOCUMENT Format code for undefined document files","int FORMAT_UNDEFINED_FIRMWARE Format code for firmware files","int FORMAT_UNDEFINED_VIDEO Format code for undefined video files","int FORMAT_WAV Format code for WAV audio files","int FORMAT_WINDOWS_IMAGE_FORMAT Format code for Windows image files","int FORMAT_WMA Format code for WMA audio files","int FORMAT_WMV Format code for WMV video files","int FORMAT_WPL_PLAYLIST Format code for WPL playlist files","int FORMAT_XML_DOCUMENT Format code for XML documents","int PROTECTION_STATUS_NONE Object is not protected.","int PROTECTION_STATUS_NON_TRANSFERABLE_DATA Object's contents can not be transfered from the device, but the object may be moved or deleted and its properties may be modified.","int PROTECTION_STATUS_READ_ONLY Object can not be modified or deleted and its properties can not be modified.","int PROTECTION_STATUS_READ_ONLY_DATA Object can not be modified or deleted but its properties are modifiable."],"class":"MtpConstants","constructors":[],"fields":[]}