{"methods":["void close() Closes all resources related to the MtpDevice object.","boolean deleteObject(int objectHandle) Deletes an object on the device.","int getDeviceId() Returns the USB ID of the USB device.","MtpDeviceInfo getDeviceInfo() Returns the MtpDeviceInfo for this device","String getDeviceName() Returns the name of the USB device This returns the same value as getDeviceName() for the device's UsbDevice","byte[] getObject(int objectHandle, int objectSize) Returns the data for an object as a byte array.","int[] getObjectHandles(int storageId, int format, int objectHandle) Returns the list of object handles for all objects on the given storage unit, with the given format and parent.","MtpObjectInfo getObjectInfo(int objectHandle) Retrieves the MtpObjectInfo for an object.","long getParent(int objectHandle) Retrieves the object handle for the parent of an object on the device.","long getStorageId(int objectHandle) Retrieves the ID of the storage unit containing the given object on the device.","int[] getStorageIds() Returns the list of IDs for all storage units on this device Information about each storage unit can be accessed via getStorageInfo(int).","MtpStorageInfo getStorageInfo(int storageId) Retrieves the MtpStorageInfo for a storage unit.","byte[] getThumbnail(int objectHandle) Returns the thumbnail data for an object as a byte array.","boolean importFile(int objectHandle, String destPath) Copies the data for an object to a file in external storage.","boolean open(UsbDeviceConnection connection) Opens the MTP device.","String toString() Returns a string containing a concise, human-readable description of this object.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.mtp","constants":[],"class":"MtpDevice","constructors":[],"fields":[]}