{"methods":["final int getAssociationDesc() Returns the association description for the MTP object Will be zero objects that are not of format FORMAT_ASSOCIATION","final int getAssociationType() Returns the association type for the MTP object Will be zero objects that are not of format FORMAT_ASSOCIATION For directories the association type is typically ASSOCIATION_TYPE_GENERIC_FOLDER","final int getCompressedSize() Returns the size of the MTP object","final long getDateCreated() Returns the creation date of the MTP object The value is represented as milliseconds since January 1, 1970","final long getDateModified() Returns the modification date of the MTP object The value is represented as milliseconds since January 1, 1970","final int getFormat() Returns the format code for the MTP object","final int getImagePixDepth() Returns the depth of the MTP object in bits per pixel Will be zero for non-image objects","final int getImagePixHeight() Returns the height of the MTP object in pixels Will be zero for non-image objects","final int getImagePixWidth() Returns the width of the MTP object in pixels Will be zero for non-image objects","final String getKeywords() Returns a comma separated list of keywords for the MTP object","final String getName() Returns the name of the MTP object","final int getObjectHandle() Returns the object handle for the MTP object","final int getParent() Returns the object handle for the object's parent Will be zero for the root directory of a storage unit","final int getProtectionStatus() Returns the protection status for the MTP object Possible values are: PROTECTION_STATUS_NONE PROTECTION_STATUS_READ_ONLY PROTECTION_STATUS_NON_TRANSFERABLE_DATA","final int getSequenceNumber() Returns the sequence number for the MTP object This field is typically not used for MTP devices, but is sometimes used to define a sequence of photos on PTP cameras.","final int getStorageId() Returns the storage ID for the MTP object's storage unit","final int getThumbCompressedSize() Returns the size of the MTP object's thumbnail Will be zero for objects with no thumbnail","final int getThumbFormat() Returns the format code for the MTP object's thumbnail Will be zero for objects with no thumbnail","final int getThumbPixHeight() Returns the height of the MTP object's thumbnail in pixels Will be zero for objects with no thumbnail","final int getThumbPixWidth() Returns the width of the MTP object's thumbnail in pixels Will be zero for objects with no thumbnail","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.mtp","constants":[],"class":"MtpObjectInfo","constructors":[],"fields":[]}