{"methods":["boolean declarePrefix(String prefix, String uri) Declare a Namespace prefix.","Enumeration getDeclaredPrefixes() Return an enumeration of all prefixes declared in this context.","String getPrefix(String uri) Return one of the prefixes mapped to a Namespace URI.","Enumeration getPrefixes(String uri) Return an enumeration of all prefixes for a given URI whose declarations are active in the current context.","Enumeration getPrefixes() Return an enumeration of all prefixes whose declarations are active in the current context.","String getURI(String prefix) Look up a prefix and get the currently-mapped Namespace URI.","boolean isNamespaceDeclUris() Returns true if namespace declaration attributes are placed into a namespace.","void popContext() Revert to the previous Namespace context.","String[] processName(String qName, String[] parts, boolean isAttribute) Process a raw XML qualified name, after all declarations in the current context have been handled by declarePrefix().","void pushContext() Start a new Namespace context.","void reset() Reset this Namespace support object for reuse.","void setNamespaceDeclUris(boolean value) Controls whether namespace declaration attributes are placed into the NSDECL namespace by processName().","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.xml.sax.helpers","constants":["String NSDECL The namespace declaration URI as a constant.","String XMLNS The XML Namespace URI as a constant."],"class":"NamespaceSupport","constructors":[],"fields":[]}