{"methods":["boolean equals(Object obj) Compares the specified object to this NetworkInterface and returns whether they are equal or not.","static NetworkInterface getByIndex(int index) Returns the NetworkInterface corresponding to the given interface index, or null if no interface has this index.","static NetworkInterface getByInetAddress(InetAddress address) Returns the NetworkInterface corresponding to the given address, or null if no interface has this address.","static NetworkInterface getByName(String interfaceName) Returns the NetworkInterface corresponding to the named network interface, or null if no interface has this name.","String getDisplayName() Returns a human-readable name for this network interface.","byte[] getHardwareAddress() Returns the hardware address of the interface, if it has one, or null otherwise.","int getIndex() Returns the index for the network interface, or -1 if unknown.","Enumeration<InetAddress> getInetAddresses() Returns an enumeration of the addresses bound to this network interface.","List<InterfaceAddress> getInterfaceAddresses() Returns a List of the InterfaceAddresses for this network interface.","int getMTU() Returns the Maximum Transmission Unit (MTU) of this interface.","String getName() Returns the name of this network interface (such as \"eth0\" or \"lo\").","static Enumeration<NetworkInterface> getNetworkInterfaces() Gets a list of all network interfaces available on the local system or null if no interface is available.","NetworkInterface getParent() Returns the parent NetworkInterface of this interface if this is a sub-interface, or null if it's a physical (non virtual) interface.","Enumeration<NetworkInterface> getSubInterfaces() Returns an enumeration of all the sub-interfaces of this network interface.","int hashCode() Returns the hash code for this NetworkInterface.","boolean isLoopback() Returns true if this network interface is a loopback interface.","boolean isPointToPoint() Returns true if this network interface is a point-to-point interface.","boolean isUp() Returns true if this network interface is up.","boolean isVirtual() Returns true if this interface is a virtual interface (also called a sub-interface).","boolean supportsMulticast() Returns true if this network interface supports multicast.","String toString() Returns a string containing details of this network interface.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"NetworkInterface","constructors":[],"fields":[]}