{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","int getLinkDownstreamBandwidthKbps() Retrieves the downstream bandwidth for this network in Kbps.","int getLinkUpstreamBandwidthKbps() Retrieves the upstream bandwidth for this network in Kbps.","boolean hasCapability(int capability) Tests for the presence of a capabilitity on this instance.","boolean hasTransport(int transportType) Tests for the presence of a transport on this instance.","int hashCode() Returns an integer hash code for this object.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.net","constants":["int NET_CAPABILITY_CBS Indicates this is a network that has the ability to reach the carrier's CBS servers, used for carrier specific services.","int NET_CAPABILITY_DUN Indicates this is a network that has the ability to reach the carrier's DUN or tethering gateway.","int NET_CAPABILITY_EIMS Indicates this is a network that has the ability to reach a carrier's Emergency IMS servers, used for network signaling during emergency calls.","int NET_CAPABILITY_FOTA Indicates this is a network that has the ability to reach the carrier's FOTA portal, used for over the air updates.","int NET_CAPABILITY_IA Indicates this is a network that has the ability to reach a carrier's Initial Attach servers.","int NET_CAPABILITY_IMS Indicates this is a network that has the ability to reach the carrier's IMS servers, used for network registration and signaling.","int NET_CAPABILITY_INTERNET Indicates that this network should be able to reach the internet.","int NET_CAPABILITY_MMS Indicates this is a network that has the ability to reach the carrier's MMSC for sending and receiving MMS messages.","int NET_CAPABILITY_NOT_METERED Indicates that this network is unmetered.","int NET_CAPABILITY_NOT_RESTRICTED Indicates that this network is available for general use.","int NET_CAPABILITY_NOT_VPN","int NET_CAPABILITY_RCS Indicates this is a network that has the ability to reach a carrier's RCS servers, used for Rich Communication Services.","int NET_CAPABILITY_SUPL Indicates this is a network that has the ability to reach the carrier's SUPL server, used to retrieve GPS information.","int NET_CAPABILITY_TRUSTED Indicates that the user has indicated implicit trust of this network.","int NET_CAPABILITY_WIFI_P2P Indicates this is a network that has the ability to reach a Wi-Fi direct peer.","int NET_CAPABILITY_XCAP Indicates this is a network that has the ability to reach a carrier's XCAP servers, used for configuration and control.","int TRANSPORT_BLUETOOTH Indicates this network uses a Bluetooth transport.","int TRANSPORT_CELLULAR Indicates this network uses a Cellular transport.","int TRANSPORT_ETHERNET Indicates this network uses an Ethernet transport.","int TRANSPORT_VPN Indicates this network uses a VPN transport.","int TRANSPORT_WIFI Indicates this network uses a Wi-Fi transport.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"NetworkCapabilities","constructors":[],"fields":["public static final Creator<NetworkCapabilities> CREATOR"]}