{"methods":["void draw(Canvas canvas, Rect location) Draws the NinePatch.","void draw(Canvas canvas, RectF location) Draws the NinePatch.","void draw(Canvas canvas, Rect location, Paint paint) Draws the NinePatch.","Bitmap getBitmap() Returns the bitmap used to draw this NinePatch.","int getDensity() Return the underlying bitmap's density, as per Bitmap.getDensity().","int getHeight() Returns the intrinsic height, in pixels, of this NinePatch.","String getName() Returns the name of this NinePatch object if one was specified when calling the constructor.","Paint getPaint() Returns the paint used to draw this NinePatch.","final Region getTransparentRegion(Rect bounds) Returns a Region representing the parts of the NinePatch that are completely transparent.","int getWidth() Returns the intrinsic width, in pixels, of this NinePatch.","final boolean hasAlpha() Indicates whether this NinePatch contains transparent or translucent pixels.","static boolean isNinePatchChunk(byte[] chunk) Verifies that the specified byte array is a valid 9-patch data chunk.","void setPaint(Paint p) Sets the paint to use when drawing the NinePatch.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics","constants":[],"class":"NinePatch","constructors":[],"fields":[]}