{"methods":["NotificationCompat.Builder addAction(NotificationCompat.Action action) Add an action to this notification.","NotificationCompat.Builder addAction(int icon, CharSequence title, PendingIntent intent) Add an action to this notification.","NotificationCompat.Builder addExtras(Bundle extras) Merge additional metadata into this notification.","NotificationCompat.Builder addPerson(String uri) Add a person that is relevant to this notification.","Notification build() Combine all of the options that have been set and return a new Notification object.","NotificationCompat.Builder extend(NotificationCompat.Extender extender) Apply an extender to this notification builder.","Bundle getExtras() Get the current metadata Bundle used by this notification Builder.","Notification getNotification() This method is deprecated. Use build() instead.","NotificationCompat.Builder setAutoCancel(boolean autoCancel) Setting this flag will make it so the notification is automatically canceled when the user clicks it in the panel.","NotificationCompat.Builder setCategory(String category) Set the notification category.","NotificationCompat.Builder setColor(int argb) Sets color.","NotificationCompat.Builder setContent(RemoteViews views) Supply a custom RemoteViews to use instead of the standard one.","NotificationCompat.Builder setContentInfo(CharSequence info) Set the large text at the right-hand side of the notification.","NotificationCompat.Builder setContentIntent(PendingIntent intent) Supply a PendingIntent to send when the notification is clicked.","NotificationCompat.Builder setContentText(CharSequence text) Set the text (second row) of the notification, in a standard notification.","NotificationCompat.Builder setContentTitle(CharSequence title) Set the title (first row) of the notification, in a standard notification.","NotificationCompat.Builder setDefaults(int defaults) Set the default notification options that will be used.","NotificationCompat.Builder setDeleteIntent(PendingIntent intent) Supply a PendingIntent to send when the notification is cleared by the user directly from the notification panel.","NotificationCompat.Builder setExtras(Bundle extras) Set metadata for this notification.","NotificationCompat.Builder setFullScreenIntent(PendingIntent intent, boolean highPriority) An intent to launch instead of posting the notification to the status bar.","NotificationCompat.Builder setGroup(String groupKey) Set this notification to be part of a group of notifications sharing the same key.","NotificationCompat.Builder setGroupSummary(boolean isGroupSummary) Set this notification to be the group summary for a group of notifications.","NotificationCompat.Builder setLargeIcon(Bitmap icon) Set the large icon that is shown in the ticker and notification.","NotificationCompat.Builder setLights(int argb, int onMs, int offMs) Set the argb value that you would like the LED on the device to blnk, as well as the rate.","NotificationCompat.Builder setLocalOnly(boolean b) Set whether or not this notification is only relevant to the current device.","NotificationCompat.Builder setNumber(int number) Set the large number at the right-hand side of the notification.","NotificationCompat.Builder setOngoing(boolean ongoing) Set whether this is an ongoing notification.","NotificationCompat.Builder setOnlyAlertOnce(boolean onlyAlertOnce) Set this flag if you would only like the sound, vibrate and ticker to be played if the notification is not already showing.","NotificationCompat.Builder setPriority(int pri) Set the relative priority for this notification.","NotificationCompat.Builder setProgress(int max, int progress, boolean indeterminate) Set the progress this notification represents, which may be represented as a ProgressBar.","NotificationCompat.Builder setPublicVersion(Notification n) Supply a replacement Notification whose contents should be shown in insecure contexts (i.e.","NotificationCompat.Builder setShowWhen(boolean show) Control whether the timestamp set with setWhen is shown in the content view.","NotificationCompat.Builder setSmallIcon(int icon, int level) A variant of setSmallIcon(int) that takes an additional level parameter for when the icon is a LevelListDrawable.","NotificationCompat.Builder setSmallIcon(int icon) Set the small icon to use in the notification layouts.","NotificationCompat.Builder setSortKey(String sortKey) Set a sort key that orders this notification among other notifications from the same package.","NotificationCompat.Builder setSound(Uri sound) Set the sound to play.","NotificationCompat.Builder setSound(Uri sound, int streamType) Set the sound to play.","NotificationCompat.Builder setStyle(NotificationCompat.Style style) Add a rich notification style to be applied at build time.","NotificationCompat.Builder setSubText(CharSequence text) Set the third line of text in the platform notification template.","NotificationCompat.Builder setTicker(CharSequence tickerText, RemoteViews views) Set the text that is displayed in the status bar when the notification first arrives, and also a RemoteViews object that may be displayed instead on some devices.","NotificationCompat.Builder setTicker(CharSequence tickerText) Set the text that is displayed in the status bar when the notification first arrives.","NotificationCompat.Builder setUsesChronometer(boolean b) Show the when field as a stopwatch.","NotificationCompat.Builder setVibrate(long[] pattern) Set the vibration pattern to use.","NotificationCompat.Builder setVisibility(int visibility) Sets visibility.","NotificationCompat.Builder setWhen(long when) Set the time that the event occurred.","static CharSequence limitCharSequenceLength(CharSequence cs)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":[],"class":"NotificationCompat.Builder","constructors":[],"fields":["public ArrayList<String> mPeople"]}