{"methods":["void discoverServices(String serviceType, int protocolType, NsdManager.DiscoveryListener listener) Initiate service discovery to browse for instances of a service type.","void registerService(NsdServiceInfo serviceInfo, int protocolType, NsdManager.RegistrationListener listener) Register a service to be discovered by other services.","void resolveService(NsdServiceInfo serviceInfo, NsdManager.ResolveListener listener) Resolve a discovered service.","void stopServiceDiscovery(NsdManager.DiscoveryListener listener) Stop service discovery initiated with discoverServices(String, int, NsdManager.DiscoveryListener).","void unregisterService(NsdManager.RegistrationListener listener) Unregister a service registered through registerService(NsdServiceInfo, int, NsdManager.RegistrationListener).","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.nsd","constants":["String ACTION_NSD_STATE_CHANGED Broadcast intent action to indicate whether network service discovery is enabled or disabled.","String EXTRA_NSD_STATE The lookup key for an int that indicates whether network service discovery is enabled or disabled.","int FAILURE_ALREADY_ACTIVE Indicates that the operation failed because it is already active.","int FAILURE_INTERNAL_ERROR Failures are passed with onRegistrationFailed(NsdServiceInfo, int), onUnregistrationFailed(NsdServiceInfo, int), onStartDiscoveryFailed(String, int), onStopDiscoveryFailed(String, int) or onResolveFailed(NsdServiceInfo, int).","int FAILURE_MAX_LIMIT Indicates that the operation failed because the maximum outstanding requests from the applications have reached.","int NSD_STATE_DISABLED Network service discovery is disabled","int NSD_STATE_ENABLED Network service discovery is enabled","int PROTOCOL_DNS_SD Dns based service discovery protocol"],"class":"NsdManager","constructors":[],"fields":[]}