{"methods":["[Expand] Inherited Methods","From class java.text.AttributedCharacterIterator.Attribute final boolean equals(Object object) Compares this attribute with the specified object. String getName() Returns the name of this attribute. final int hashCode() Calculates the hash code for objects of type Attribute. Object readResolve() Resolves a deserialized instance to the correct constant attribute. String toString() Returns the name of the class followed by a \"(\", the name of the attribute, and a \")\".","final boolean equals(Object object) Compares this attribute with the specified object.","String getName() Returns the name of this attribute.","final int hashCode() Calculates the hash code for objects of type Attribute.","Object readResolve() Resolves a deserialized instance to the correct constant attribute.","String toString() Returns the name of the class followed by a \"(\", the name of the attribute, and a \")\".","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.text","constants":[],"class":"NumberFormat.Field","constructors":[],"fields":["public static final NumberFormat.Field CURRENCY This constant stands for the currency symbol.","public static final NumberFormat.Field DECIMAL_SEPARATOR This constant stands for the decimal separator.","public static final NumberFormat.Field EXPONENT This constant stands for the exponent part of the number.","public static final NumberFormat.Field EXPONENT_SIGN This constant stands for the exponent sign symbol.","public static final NumberFormat.Field EXPONENT_SYMBOL This constant stands for the exponent symbol.","public static final NumberFormat.Field FRACTION This constant stands for the fraction part of the number.","public static final NumberFormat.Field GROUPING_SEPARATOR This constant stands for the grouping separator.","public static final NumberFormat.Field INTEGER This constant stands for the integer part of the number.","public static final NumberFormat.Field PERCENT This constant stands for the percent symbol.","public static final NumberFormat.Field PERMILLE This constant stands for the permille symbol.","public static final NumberFormat.Field SIGN This constant stands for the number sign."]}