{"methods":["boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","static NumericShaper getContextualShaper(int ranges) Gets the NumericShaper for the specified unicode ranges.","static NumericShaper getContextualShaper(int ranges, int defaultContext) Gets the NumericShaper for the specified unicode ranges and default unicode range.","int getRanges() Gets the masks for all of the ranges supported by this NumericShaper, packed into an int value using the logical OR logical operation for multiple ranges: NumericShaper.DEVANAGARI | NumericShaper.BENGALI.","static NumericShaper getShaper(int singleRange) Gets a NumericShaper for the specified unicode range.","int hashCode() Returns an integer hash code for this object.","boolean isContextual() Checks if this NumericShaper is contextual (supporting multiple script ranges) or not.","void shape(char[] text, int start, int count, int context) Transforms the encoding of the text, starting from the character at index start and transforming count characters, using the specified context.","void shape(char[] text, int start, int count) Transforms the encoding of the text, starting from the character at index start and transforming count characters.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.awt.font","constants":["int ALL_RANGES The Constant ALL_RANGES indicates all ranges.","int ARABIC The Constant ARABIC indicates the ARABIC range and decimal base.","int BENGALI The Constant BENGALI indicates the BENGALI range and decimal base.","int DEVANAGARI The Constant DEVANAGARI indicates the DEVANAGARI range and decimal base.","int EASTERN_ARABIC The Constant EASTERN_ARABIC indicates the ARABIC range and ARABIC_EXTENDED decimal base.","int ETHIOPIC The Constant ETHIOPIC indicates the ETHIOPIC range and decimal base.","int EUROPEAN The Constant EUROPEAN indicates the latin and extended range, and latin decimal base.","int GUJARATI The Constant GUJARATI indicates the GUJARATI range and decimal base.","int GURMUKHI The Constant GURMUKHI indicates the GURMUKHI range and decimal base.","int KANNADA The Constant KANNADA indicates the KANNADA range and decimal base.","int KHMER The Constant KHMER indicates the KHMER range and decimal base.","int LAO The Constant LAO indicates the LAO range and decimal base.","int MALAYALAM The Constant MALAYALAM indicates the MALAYALAM range and decimal base.","int MONGOLIAN The Constant MONGOLIAN indicates the MONGOLIAN range and decimal base.","int MYANMAR The Constant MYANMAR indicates the MYANMAR range and decimal base.","int ORIYA The Constant ORIYA indicates the ORIYA range and decimal base.","int TAMIL The Constant TAMIL indicates the TAMIL range and decimal base.","int TELUGU The Constant TELUGU indicates the TELUGU range and decimal base.","int THAI The Constant THAI indicates the THAI range and decimal base.","int TIBETAN The Constant TIBETAN indicates the TIBETAN range and decimal base."],"class":"NumericShaper","constructors":[],"fields":[]}