{"methods":["abstract void put(String name, Object value) Puts the value of the Object field identified by name to the persistent field.","abstract void put(String name, int value) Puts the value of the integer field identified by name to the persistent field.","abstract void put(String name, float value) Puts the value of the float field identified by name to the persistent field.","abstract void put(String name, boolean value) Puts the value of the boolean field identified by name to the persistent field.","abstract void put(String name, byte value) Puts the value of the byte field identified by name to the persistent field.","abstract void put(String name, short value) Puts the value of the short field identified by name to the persistent field.","abstract void put(String name, long value) Puts the value of the long field identified by name to the persistent field.","abstract void put(String name, char value) Puts the value of the character field identified by name to the persistent field.","abstract void put(String name, double value) Puts the value of the double field identified by name to the persistent field.","abstract void write(ObjectOutput out) This method was deprecated in API level 1. This method is unsafe and may corrupt the target stream. Use ObjectOutputStream#writeFields() instead.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.io","constants":[],"class":"ObjectOutputStream.PutField","constructors":[],"fields":[]}