{"methods":["abstract Object get(int position) Returns the item for the given position.","long getId(int position) Returns id for the given position.","final Presenter getPresenter(Object item) Returns the Presenter for the given item from the adapter.","final PresenterSelector getPresenterSelector() Returns the presenter selector for this ObjectAdapter.","final boolean hasStableIds() Indicates whether the item ids are stable across changes to the underlying data.","final void registerObserver(ObjectAdapter.DataObserver observer) Register a DataObserver for data change notifications.","final void setHasStableIds(boolean hasStableIds) Sets whether the item ids are stable across changes to the underlying data.","final void setPresenterSelector(PresenterSelector presenterSelector) Set the presenter selector.","abstract int size() Returns the number of items in the adapter.","final void unregisterAllObservers() Unregister all DataObservers for this ObjectAdapter.","final void unregisterObserver(ObjectAdapter.DataObserver observer) Unregister a DataObserver for data change notifications.","final void notifyChanged()","final void notifyItemRangeChanged(int positionStart, int itemCount)","final void notifyItemRangeInserted(int positionStart, int itemCount)","final void notifyItemRangeRemoved(int positionStart, int itemCount)","void onHasStableIdsChanged() Called when setHasStableIds(boolean) is called and the status of stable ids has changed.","void onPresenterSelectorChanged() Called when setPresenterSelector(PresenterSelector) is called and the PresenterSelector differs from the previous one.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v17.leanback.widget","constants":["int NO_ID Indicates that an id has not been set."],"class":"ObjectAdapter","constructors":[],"fields":[]}