{"methods":["static OrientationHelper createHorizontalHelper(RecyclerView.LayoutManager layoutManager) Creates a horizontal OrientationHelper for the given LayoutManager.","static OrientationHelper createOrientationHelper(RecyclerView.LayoutManager layoutManager, int orientation) Creates an OrientationHelper for the given LayoutManager and orientation.","static OrientationHelper createVerticalHelper(RecyclerView.LayoutManager layoutManager) Creates a vertical OrientationHelper for the given LayoutManager.","abstract int getDecoratedEnd(View view) Returns the end of the view including its decoration and margin.","abstract int getDecoratedMeasurement(View view) Returns the space occupied by this View in the current orientation including decorations and margins.","abstract int getDecoratedMeasurementInOther(View view) Returns the space occupied by this View in the perpendicular orientation including decorations and margins.","abstract int getDecoratedStart(View view) Returns the start of the view including its decoration and margin.","abstract int getEnd() Returns the end position of the layout without taking padding into account.","abstract int getEndAfterPadding() Returns the end position of the layout after the end padding is removed.","abstract int getEndPadding() Returns the padding at the end of the layout.","abstract int getStartAfterPadding() Returns the start position of the layout after the start padding is added.","abstract int getTotalSpace() Returns the total space to layout.","int getTotalSpaceChange() Returns the layout space change between the previous layout pass and current layout pass.","abstract void offsetChild(View view, int offset) Offsets the child in this orientation.","abstract void offsetChildren(int amount) Offsets all children's positions by the given amount.","void onLayoutComplete() Call this method after onLayout method is complete if state is NOT pre-layout.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.widget","constants":["int HORIZONTAL","int VERTICAL"],"class":"OrientationHelper","constructors":[],"fields":["protected final RecyclerView.LayoutManager mLayoutManager"]}