{"methods":["boolean canClip() Returns whether the outline can be used to clip a View.","float getAlpha() Returns the alpha represented by the Outline.","boolean isEmpty() Returns whether the Outline is empty.","void set(Outline src) Replace the contents of this Outline with the contents of src.","void setAlpha(float alpha) Sets the alpha represented by the Outline - the degree to which the producer is guaranteed to be opaque over the Outline's shape.","void setConvexPath(Path convexPath) Sets the Constructs an Outline from a convex path.","void setEmpty() Sets the outline to be empty.","void setOval(Rect rect) Convenience for setOval(int, int, int, int)","void setOval(int left, int top, int right, int bottom) Sets the outline to the oval defined by input rect.","void setRect(Rect rect) Convenience for setRect(int, int, int, int)","void setRect(int left, int top, int right, int bottom) Sets the Outline to the rounded rect defined by the input rect, and corner radius.","void setRoundRect(Rect rect, float radius) Convenience for setRoundRect(int, int, int, int, float)","void setRoundRect(int left, int top, int right, int bottom, float radius) Sets the Outline to the rounded rect defined by the input rect, and corner radius.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics","constants":[],"class":"Outline","constructors":[],"fields":[]}