{"methods":["void draw(Canvas canvas, Paint paint) Draw this shape into the provided Canvas, with the provided Paint.","void getOutline(Outline outline) Compute the Outline of the shape and return it in the supplied Outline parameter.","[Expand] Inherited Methods","From class android.graphics.drawable.shapes.RectShape RectShape clone() Creates and returns a copy of this Object. void draw(Canvas canvas, Paint paint) Draw this shape into the provided Canvas, with the provided Paint. void getOutline(Outline outline) Compute the Outline of the shape and return it in the supplied Outline parameter. void onResize(float width, float height) Callback method called when resize(float, float) is executed. final RectF rect() Returns the RectF that defines this rectangle's bounds.","RectShape clone() Creates and returns a copy of this Object.","void draw(Canvas canvas, Paint paint) Draw this shape into the provided Canvas, with the provided Paint.","void getOutline(Outline outline) Compute the Outline of the shape and return it in the supplied Outline parameter.","void onResize(float width, float height) Callback method called when resize(float, float) is executed.","final RectF rect() Returns the RectF that defines this rectangle's bounds.","From class android.graphics.drawable.shapes.Shape Shape clone() Creates and returns a copy of this Object. abstract void draw(Canvas canvas, Paint paint) Draw this shape into the provided Canvas, with the provided Paint. final float getHeight() Returns the height of the Shape. void getOutline(Outline outline) Compute the Outline of the shape and return it in the supplied Outline parameter. final float getWidth() Returns the width of the Shape. boolean hasAlpha() Checks whether the Shape is opaque. void onResize(float width, float height) Callback method called when resize(float, float) is executed. final void resize(float width, float height) Resizes the dimensions of this shape.","Shape clone() Creates and returns a copy of this Object.","abstract void draw(Canvas canvas, Paint paint) Draw this shape into the provided Canvas, with the provided Paint.","final float getHeight() Returns the height of the Shape.","void getOutline(Outline outline) Compute the Outline of the shape and return it in the supplied Outline parameter.","final float getWidth() Returns the width of the Shape.","boolean hasAlpha() Checks whether the Shape is opaque.","void onResize(float width, float height) Callback method called when resize(float, float) is executed.","final void resize(float width, float height) Resizes the dimensions of this shape.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics.drawable.shapes","constants":[],"class":"OvalShape","constructors":[],"fields":[]}