{"methods":["void abortAnimation() Stops the animation.","boolean computeScrollOffset() Call this when you want to know the new location.","void fling(int startX, int startY, int velocityX, int velocityY, int minX, int maxX, int minY, int maxY)","void fling(int startX, int startY, int velocityX, int velocityY, int minX, int maxX, int minY, int maxY, int overX, int overY) Start scrolling based on a fling gesture.","final void forceFinished(boolean finished) Force the finished field to a particular value.","float getCurrVelocity() Returns the absolute value of the current velocity.","final int getCurrX() Returns the current X offset in the scroll.","final int getCurrY() Returns the current Y offset in the scroll.","final int getFinalX() Returns where the scroll will end.","final int getFinalY() Returns where the scroll will end.","final int getStartX() Returns the start X offset in the scroll.","final int getStartY() Returns the start Y offset in the scroll.","final boolean isFinished() Returns whether the scroller has finished scrolling.","boolean isOverScrolled() Returns whether the current Scroller is currently returning to a valid position.","void notifyHorizontalEdgeReached(int startX, int finalX, int overX) Notify the scroller that we've reached a horizontal boundary.","void notifyVerticalEdgeReached(int startY, int finalY, int overY) Notify the scroller that we've reached a vertical boundary.","final void setFriction(float friction) The amount of friction applied to flings.","boolean springBack(int startX, int startY, int minX, int maxX, int minY, int maxY) Call this when you want to 'spring back' into a valid coordinate range.","void startScroll(int startX, int startY, int dx, int dy) Start scrolling by providing a starting point and the distance to travel.","void startScroll(int startX, int startY, int dx, int dy, int duration) Start scrolling by providing a starting point and the distance to travel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.widget","constants":[],"class":"OverScroller","constructors":[],"fields":[]}