{"methods":["Drawable loadBanner(PackageManager pm) Retrieve the current graphical banner associated with this item.","Drawable loadIcon(PackageManager pm) Retrieve the current graphical icon associated with this item.","CharSequence loadLabel(PackageManager pm) Retrieve the current textual label associated with this item.","Drawable loadLogo(PackageManager pm) Retrieve the current graphical logo associated with this item.","XmlResourceParser loadXmlMetaData(PackageManager pm, String name) Load an XML resource attached to the meta-data of this item.","void writeToParcel(Parcel dest, int parcelableFlags)","void dumpBack(Printer pw, String prefix)","void dumpFront(Printer pw, String prefix)","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.content.pm","constants":[],"class":"PackageItemInfo","constructors":[],"fields":["public int banner A drawable resource identifier (in the package's resources) of this component's banner.","public int icon A drawable resource identifier (in the package's resources) of this component's icon.","public int labelRes A string resource identifier (in the package's resources) of this component's label.","public int logo A drawable resource identifier (in the package's resources) of this component's logo.","public Bundle metaData Additional meta-data associated with this component.","public String name Public name of this item.","public CharSequence nonLocalizedLabel The string provided in the AndroidManifest file, if any.","public String packageName Name of the package that this item is in."]}