{"methods":["void abandonSession(int sessionId) Completely abandon the given session, destroying all staged data and rendering it invalid.","int createSession(PackageInstaller.SessionParams params) Create a new session using the given parameters, returning a unique ID that represents the session.","List<PackageInstaller.SessionInfo> getAllSessions() Return list of all known install sessions, regardless of the installer.","List<PackageInstaller.SessionInfo> getMySessions() Return list of all known install sessions owned by the calling app.","PackageInstaller.SessionInfo getSessionInfo(int sessionId) Return details for a specific session.","PackageInstaller.Session openSession(int sessionId) Open an existing session to actively perform work.","void registerSessionCallback(PackageInstaller.SessionCallback callback, Handler handler) Register to watch for session lifecycle events.","void registerSessionCallback(PackageInstaller.SessionCallback callback) Register to watch for session lifecycle events.","void uninstall(String packageName, IntentSender statusReceiver) Uninstall the given package, removing it completely from the device.","void unregisterSessionCallback(PackageInstaller.SessionCallback callback) Unregister a previously registered callback.","void updateSessionAppIcon(int sessionId, Bitmap appIcon) Update the icon representing the app being installed in a specific session.","void updateSessionAppLabel(int sessionId, CharSequence appLabel) Update the label representing the app being installed in a specific session.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.content.pm","constants":["String ACTION_SESSION_DETAILS Activity Action: Show details about a particular install session.","String EXTRA_OTHER_PACKAGE_NAME Another package name relevant to a status.","String EXTRA_PACKAGE_NAME Package name that an operation is working with.","String EXTRA_SESSION_ID An integer session ID that an operation is working with.","String EXTRA_STATUS Current status of an operation.","String EXTRA_STATUS_MESSAGE Detailed string representation of the status, including raw details that are useful for debugging.","String EXTRA_STORAGE_PATH Storage path relevant to a status.","int STATUS_FAILURE The operation failed in a generic way.","int STATUS_FAILURE_ABORTED The operation failed because it was actively aborted.","int STATUS_FAILURE_BLOCKED The operation failed because it was blocked.","int STATUS_FAILURE_CONFLICT The operation failed because it conflicts (or is inconsistent with) with another package already installed on the device.","int STATUS_FAILURE_INCOMPATIBLE The operation failed because it is fundamentally incompatible with this device.","int STATUS_FAILURE_INVALID The operation failed because one or more of the APKs was invalid.","int STATUS_FAILURE_STORAGE The operation failed because of storage issues.","int STATUS_PENDING_USER_ACTION User action is currently required to proceed.","int STATUS_SUCCESS The operation succeeded."],"class":"PackageInstaller","constructors":[],"fields":[]}