{"methods":["boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","static Palette generate(Bitmap bitmap) Generate a Palette from a Bitmap using the default number of colors.","static Palette generate(Bitmap bitmap, int numColors) Generate a Palette from a Bitmap using the specified numColors.","static AsyncTask<Bitmap, Void, Palette> generateAsync(Bitmap bitmap, int numColors, Palette.PaletteAsyncListener listener) Generate a Palette asynchronously.","static AsyncTask<Bitmap, Void, Palette> generateAsync(Bitmap bitmap, Palette.PaletteAsyncListener listener) Generate a Palette asynchronously.","int getDarkMutedColor(int defaultColor) Returns a muted and dark color from the palette as an RGB packed int.","Palette.Swatch getDarkMutedSwatch() Returns a muted and dark swatch from the palette.","int getDarkVibrantColor(int defaultColor) Returns a dark and vibrant color from the palette as an RGB packed int.","Palette.Swatch getDarkVibrantSwatch() Returns a dark and vibrant swatch from the palette.","int getLightMutedColor(int defaultColor) Returns a muted and light color from the palette as an RGB packed int.","Palette.Swatch getLightMutedSwatch() Returns a muted and light swatch from the palette.","int getLightVibrantColor(int defaultColor) Returns a light and vibrant color from the palette as an RGB packed int.","Palette.Swatch getLightVibrantSwatch() Returns a light and vibrant swatch from the palette.","int getMutedColor(int defaultColor) Returns a muted color from the palette as an RGB packed int.","Palette.Swatch getMutedSwatch() Returns a muted swatch from the palette.","List<Palette.Swatch> getSwatches() Returns all of the swatches which make up the palette.","int getVibrantColor(int defaultColor) Returns the most vibrant color in the palette as an RGB packed int.","Palette.Swatch getVibrantSwatch() Returns the most vibrant swatch in the palette.","int hashCode() Returns an integer hash code for this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.graphics","constants":[],"class":"Palette","constructors":[],"fields":[]}