{"methods":["int arrive() Arrives at this phaser, without waiting for others to arrive.","int arriveAndAwaitAdvance() Arrives at this phaser and awaits others.","int arriveAndDeregister() Arrives at this phaser and deregisters from it without waiting for others to arrive.","int awaitAdvance(int phase) Awaits the phase of this phaser to advance from the given phase value, returning immediately if the current phase is not equal to the given phase value or this phaser is terminated.","int awaitAdvanceInterruptibly(int phase, long timeout, TimeUnit unit) Awaits the phase of this phaser to advance from the given phase value or the given timeout to elapse, throwing InterruptedException if interrupted while waiting, or returning immediately if the current phase is not equal to the given phase value or this phaser is terminated.","int awaitAdvanceInterruptibly(int phase) Awaits the phase of this phaser to advance from the given phase value, throwing InterruptedException if interrupted while waiting, or returning immediately if the current phase is not equal to the given phase value or this phaser is terminated.","int bulkRegister(int parties) Adds the given number of new unarrived parties to this phaser.","void forceTermination() Forces this phaser to enter termination state.","int getArrivedParties() Returns the number of registered parties that have arrived at the current phase of this phaser.","Phaser getParent() Returns the parent of this phaser, or null if none.","final int getPhase() Returns the current phase number.","int getRegisteredParties() Returns the number of parties registered at this phaser.","Phaser getRoot() Returns the root ancestor of this phaser, which is the same as this phaser if it has no parent.","int getUnarrivedParties() Returns the number of registered parties that have not yet arrived at the current phase of this phaser.","boolean isTerminated() Returns true if this phaser has been terminated.","int register() Adds a new unarrived party to this phaser.","String toString() Returns a string identifying this phaser, as well as its state.","boolean onAdvance(int phase, int registeredParties) Overridable method to perform an action upon impending phase advance, and to control termination.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.concurrent","constants":[],"class":"Phaser","constructors":[],"fields":[]}