{"methods":["void onCallForwardingIndicatorChanged(boolean cfi) Callback invoked when the call-forwarding indicator changes.","void onCallStateChanged(int state, String incomingNumber) Callback invoked when device call state changes.","void onCellInfoChanged(List<CellInfo> cellInfo) Callback invoked when a observed cell info has changed, or new cells have been added or removed.","void onCellLocationChanged(CellLocation location) Callback invoked when device cell location changes.","void onDataActivity(int direction) Callback invoked when data activity state changes.","void onDataConnectionStateChanged(int state) Callback invoked when connection state changes.","void onDataConnectionStateChanged(int state, int networkType) same as above, but with the network type.","void onMessageWaitingIndicatorChanged(boolean mwi) Callback invoked when the message-waiting indicator changes.","void onServiceStateChanged(ServiceState serviceState) Callback invoked when device service state changes.","void onSignalStrengthChanged(int asu) This method was deprecated in API level 5. Use onSignalStrengthsChanged(SignalStrength)","void onSignalStrengthsChanged(SignalStrength signalStrength) Callback invoked when network signal strengths changes.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.telephony","constants":["int LISTEN_CALL_FORWARDING_INDICATOR Listen for changes to the call-forwarding indicator.","int LISTEN_CALL_STATE Listen for changes to the device call state.","int LISTEN_CELL_INFO Listen for changes to observed cell info.","int LISTEN_CELL_LOCATION Listen for changes to the device's cell location. Note that this will result in frequent callbacks to the listener.","int LISTEN_DATA_ACTIVITY Listen for changes to the direction of data traffic on the data connection (cellular).","int LISTEN_DATA_CONNECTION_STATE Listen for changes to the data connection state (cellular).","int LISTEN_MESSAGE_WAITING_INDICATOR Listen for changes to the message-waiting indicator.","int LISTEN_NONE Stop listening for updates.","int LISTEN_SERVICE_STATE Listen for changes to the network service state (cellular).","int LISTEN_SIGNAL_STRENGTH This constant was deprecated in API level 7. by LISTEN_SIGNAL_STRENGTHS","int LISTEN_SIGNAL_STRENGTHS Listen for changes to the network signal strengths (cellular)."],"class":"PhoneStateListener","constructors":[],"fields":[]}