{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","long getActions() Get the current actions available on this session.","long getActiveQueueItemId() Get the id of the currently active item in the queue.","long getBufferedPosition() Get the current buffered position in ms.","List<PlaybackState.CustomAction> getCustomActions() Get the list of custom actions.","CharSequence getErrorMessage() Get a user readable error message.","long getLastPositionUpdateTime() Get the elapsed real time at which position was last updated.","float getPlaybackSpeed() Get the current playback speed as a multiple of normal playback.","long getPosition() Get the current playback position in ms.","int getState() Get the current state of playback.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.media.session","constants":["long ACTION_FAST_FORWARD Indicates this session supports the fast forward command.","long ACTION_PAUSE Indicates this session supports the pause command.","long ACTION_PLAY Indicates this session supports the play command.","long ACTION_PLAY_FROM_MEDIA_ID Indicates this session supports the play from media id command.","long ACTION_PLAY_FROM_SEARCH Indicates this session supports the play from search command.","long ACTION_PLAY_PAUSE Indicates this session supports the play/pause toggle command.","long ACTION_REWIND Indicates this session supports the rewind command.","long ACTION_SEEK_TO Indicates this session supports the seek to command.","long ACTION_SET_RATING Indicates this session supports the set rating command.","long ACTION_SKIP_TO_NEXT Indicates this session supports the next command.","long ACTION_SKIP_TO_PREVIOUS Indicates this session supports the previous command.","long ACTION_SKIP_TO_QUEUE_ITEM Indicates this session supports the skip to queue item command.","long ACTION_STOP Indicates this session supports the stop command.","long PLAYBACK_POSITION_UNKNOWN Use this value for the position to indicate the position is not known.","int STATE_BUFFERING State indicating this item is currently buffering and will begin playing when enough data has buffered.","int STATE_CONNECTING State indicating the class doing playback is currently connecting to a new destination.","int STATE_ERROR State indicating this item is currently in an error state.","int STATE_FAST_FORWARDING State indicating this item is currently fast forwarding.","int STATE_NONE This is the default playback state and indicates that no media has been added yet, or the performer has been reset and has no content to play.","int STATE_PAUSED State indicating this item is currently paused.","int STATE_PLAYING State indicating this item is currently playing.","int STATE_REWINDING State indicating this item is currently rewinding.","int STATE_SKIPPING_TO_NEXT State indicating the player is currently skipping to the next item.","int STATE_SKIPPING_TO_PREVIOUS State indicating the player is currently skipping to the previous item.","int STATE_SKIPPING_TO_QUEUE_ITEM State indicating the player is currently skipping to a specific item in the queue.","int STATE_STOPPED State indicating this item is currently stopped.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"PlaybackState","constructors":[],"fields":["public static final Creator<PlaybackState> CREATOR"]}