{"methods":["[Expand] Inherited Methods","From class android.support.v17.leanback.widget.PlaybackControlsRow.MultiAction Drawable getDrawable(int index) Returns the drawable at the given index. int getIndex() Gets the current index. String getLabel(int index) Returns the label at the given index. int getNumberOfDrawables() Returns the number of drawables. void nextIndex() Increments the index, wrapping to zero once the end is reached. void setDrawables(Drawable[] drawables) Sets the array of drawables. void setIndex(int index) Sets the current index. void setLabels(String[] labels)","Drawable getDrawable(int index) Returns the drawable at the given index.","int getIndex() Gets the current index.","String getLabel(int index) Returns the label at the given index.","int getNumberOfDrawables() Returns the number of drawables.","void nextIndex() Increments the index, wrapping to zero once the end is reached.","void setDrawables(Drawable[] drawables) Sets the array of drawables.","void setIndex(int index) Sets the current index.","void setLabels(String[] labels)","From class android.support.v17.leanback.widget.Action final Drawable getIcon() Returns the icon drawable for this Action. final long getId() Returns the id for this Action. final CharSequence getLabel1() Returns the first line label for this Action. final CharSequence getLabel2() Returns the second line label for this Action. final void setIcon(Drawable icon) Set the icon drawable for this Action. final void setId(long id) Set id for this Action. final void setLabel1(CharSequence label) Set the first line label for this Action. final void setLabel2(CharSequence label) Set the second line label for this Action. String toString() Returns a string containing a concise, human-readable description of this object.","final Drawable getIcon() Returns the icon drawable for this Action.","final long getId() Returns the id for this Action.","final CharSequence getLabel1() Returns the first line label for this Action.","final CharSequence getLabel2() Returns the second line label for this Action.","final void setIcon(Drawable icon) Set the icon drawable for this Action.","final void setId(long id) Set id for this Action.","final void setLabel1(CharSequence label) Set the first line label for this Action.","final void setLabel2(CharSequence label) Set the second line label for this Action.","String toString() Returns a string containing a concise, human-readable description of this object.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v17.leanback.widget","constants":[],"class":"PlaybackControlsRow.PlayPauseAction","constructors":[],"fields":["public static int PAUSE Action index for the pause icon.","public static int PLAY Action index for the play icon."]}