{"methods":["void clearDefaultAccount() This method is deprecated. See clearDefaultAccount(GoogleApiClient).","void connect() This method is deprecated. See connect().","void disconnect() This method is deprecated. See disconnect().","String getAccountName() This method is deprecated. See getAccountName(GoogleApiClient).","Person getCurrentPerson() This method is deprecated. See getCurrentPerson(GoogleApiClient).","boolean isConnected() This method is deprecated. See isConnected().","boolean isConnecting() This method is deprecated. See isConnecting().","boolean isConnectionCallbacksRegistered(GooglePlayServicesClient.ConnectionCallbacks listener) This method is deprecated. See isConnectionCallbacksRegistered(GoogleApiClient.ConnectionCallbacks).","boolean isConnectionFailedListenerRegistered(GooglePlayServicesClient.OnConnectionFailedListener listener) This method is deprecated. See isConnectionFailedListenerRegistered(GoogleApiClient.OnConnectionFailedListener).","void loadMoments(PlusClient.OnMomentsLoadedListener listener, int maxResults, String pageToken, Uri targetUrl, String type, String userId) This method is deprecated. See load(GoogleApiClient).","void loadMoments(PlusClient.OnMomentsLoadedListener listener) This method is deprecated. See load(GoogleApiClient).","void loadPeople(PlusClient.OnPeopleLoadedListener listener, Collection<String> personIds) This method is deprecated. See load(GoogleApiClient, String...).","void loadPeople(PlusClient.OnPeopleLoadedListener listener, String... personIds) This method is deprecated. See load(GoogleApiClient, String...).","void loadVisiblePeople(PlusClient.OnPeopleLoadedListener listener, String pageToken) This method is deprecated. See loadVisible(GoogleApiClient, int, String).","void loadVisiblePeople(PlusClient.OnPeopleLoadedListener listener, int orderBy, String pageToken) This method is deprecated. See loadVisible(GoogleApiClient, int, String).","void registerConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) This method is deprecated. See registerConnectionCallbacks(GoogleApiClient.ConnectionCallbacks).","void registerConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) This method is deprecated. See registerConnectionFailedListener(GoogleApiClient.OnConnectionFailedListener).","void removeMoment(String momentId) This method is deprecated. See remove(GoogleApiClient, String).","void revokeAccessAndDisconnect(PlusClient.OnAccessRevokedListener listener) This method is deprecated. See revokeAccessAndDisconnect(GoogleApiClient).","void unregisterConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) This method is deprecated. See unregisterConnectionCallbacks(GoogleApiClient.ConnectionCallbacks).","void unregisterConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) This method is deprecated. See unregisterConnectionFailedListener(GoogleApiClient.OnConnectionFailedListener).","void writeMoment(Moment moment) This method is deprecated. See write(GoogleApiClient, Moment).","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)","From interface com.google.android.gms.common.GooglePlayServicesClient abstract void connect() Connects the client to Google Play services. abstract void disconnect() Closes the connection to Google Play services. abstract boolean isConnected() Checks if the client is currently connected to the service, so that requests to other methods will succeed. abstract boolean isConnecting() Checks if the client is attempting to connect to the service. abstract boolean isConnectionCallbacksRegistered(GooglePlayServicesClient.ConnectionCallbacks listener) Returns true if the specified listener is currently registered to receive connection events. abstract boolean isConnectionFailedListenerRegistered(GooglePlayServicesClient.OnConnectionFailedListener listener) Returns true if the specified listener is currently registered to receive connection failed events. abstract void registerConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) Registers a listener to receive connection events from this GooglePlayServicesClient. abstract void registerConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) Registers a listener to receive connection failed events from this GooglePlayServicesClient. abstract void unregisterConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) Removes a connection listener from this GooglePlayServicesClient. abstract void unregisterConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) Removes a connection failed listener from the GooglePlayServicesClient.","abstract void connect() Connects the client to Google Play services.","abstract void disconnect() Closes the connection to Google Play services.","abstract boolean isConnected() Checks if the client is currently connected to the service, so that requests to other methods will succeed.","abstract boolean isConnecting() Checks if the client is attempting to connect to the service.","abstract boolean isConnectionCallbacksRegistered(GooglePlayServicesClient.ConnectionCallbacks listener) Returns true if the specified listener is currently registered to receive connection events.","abstract boolean isConnectionFailedListenerRegistered(GooglePlayServicesClient.OnConnectionFailedListener listener) Returns true if the specified listener is currently registered to receive connection failed events.","abstract void registerConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) Registers a listener to receive connection events from this GooglePlayServicesClient.","abstract void registerConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) Registers a listener to receive connection failed events from this GooglePlayServicesClient.","abstract void unregisterConnectionCallbacks(GooglePlayServicesClient.ConnectionCallbacks listener) Removes a connection listener from this GooglePlayServicesClient.","abstract void unregisterConnectionFailedListener(GooglePlayServicesClient.OnConnectionFailedListener listener) Removes a connection failed listener from the GooglePlayServicesClient."],"package":"com.google.android.gms.plus","constants":[],"class":"PlusClient","constructors":[],"fields":[]}