{"methods":["void dismiss() Dismiss the menu popup.","View.OnTouchListener getDragToOpenListener() Returns an View.OnTouchListener that can be added to the anchor view to implement drag-to-open behavior.","Menu getMenu()","MenuInflater getMenuInflater()","void inflate(int menuRes) Inflate a menu resource into this PopupMenu.","void setOnDismissListener(PopupMenu.OnDismissListener listener) Set a listener that will be notified when this menu is dismissed.","void setOnMenuItemClickListener(PopupMenu.OnMenuItemClickListener listener) Set a listener that will be notified when the user selects an item from the menu.","void show() Show the menu popup anchored to the view specified during construction.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface com.android.internal.view.menu.MenuBuilder.Callback abstract boolean onMenuItemSelected(MenuBuilder menu, MenuItem item) Called when a menu item is selected. abstract void onMenuModeChange(MenuBuilder menu) Called when the mode of the menu changes (for example, from icon to expanded).","abstract boolean onMenuItemSelected(MenuBuilder menu, MenuItem item) Called when a menu item is selected.","abstract void onMenuModeChange(MenuBuilder menu) Called when the mode of the menu changes (for example, from icon to expanded).","From interface com.android.internal.view.menu.MenuPresenter.Callback abstract void onCloseMenu(MenuBuilder menu, boolean allMenusAreClosing) Called when a menu is closing. abstract boolean onOpenSubMenu(MenuBuilder subMenu) Called when a submenu opens.","abstract void onCloseMenu(MenuBuilder menu, boolean allMenusAreClosing) Called when a menu is closing.","abstract boolean onOpenSubMenu(MenuBuilder subMenu) Called when a submenu opens."],"package":"android.widget","constants":[],"class":"PopupMenu","constructors":[],"fields":[]}