{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","CharSequence getBreadCrumbShortTitle(Resources res) Return the currently set bread crumb short title.","CharSequence getBreadCrumbTitle(Resources res) Return the currently set bread crumb title.","CharSequence getSummary(Resources res) Return the currently set summary.","CharSequence getTitle(Resources res) Return the currently set title.","void readFromParcel(Parcel in)","void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.preference","constants":["[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"PreferenceActivity.Header","constructors":[],"fields":["public static final Creator<PreferenceActivity.Header> CREATOR","public CharSequence breadCrumbShortTitle Optional text to show as the short title in the bread crumb.","public int breadCrumbShortTitleRes Resource ID of optional text to show as the short title in the bread crumb.","public CharSequence breadCrumbTitle Optional text to show as the title in the bread crumb.","public int breadCrumbTitleRes Resource ID of optional text to show as the title in the bread crumb.","public Bundle extras Optional additional data for use by subclasses of PreferenceActivity.","public String fragment Full class name of the fragment to display when this header is selected.","public Bundle fragmentArguments Optional arguments to supply to the fragment when it is instantiated.","public int iconRes Optional icon resource to show for this header.","public long id Identifier for this header, to correlate with a new list when it is updated.","public Intent intent Intent to launch when the preference is selected.","public CharSequence summary Optional summary describing what this header controls.","public int summaryRes Resource ID of optional summary describing what this header controls.","public CharSequence title Title of the header that is shown to the user.","public int titleRes Resource ID of title of the header that is shown to the user."]}