{"methods":["final void addPrinters(List<PrinterInfo> printers) Adds discovered printers.","final List<PrinterInfo> getPrinters() Gets the printers reported in this session.","final List<PrinterId> getTrackedPrinters() Gets the printers that should be tracked.","final boolean isDestroyed() Gets whether the session is destroyed.","final boolean isPrinterDiscoveryStarted() Gets whether printer discovery is started.","abstract void onDestroy() Notifies you that the session is destroyed.","abstract void onStartPrinterDiscovery(List<PrinterId> priorityList) Callback asking you to start printer discovery.","abstract void onStartPrinterStateTracking(PrinterId printerId) Callback asking you to start tracking the state of a printer.","abstract void onStopPrinterDiscovery() Callback notifying you that you should stop printer discovery.","abstract void onStopPrinterStateTracking(PrinterId printerId) Callback asking you to stop tracking the state of a printer.","abstract void onValidatePrinters(List<PrinterId> printerIds) Callback asking you to validate that the given printers are valid, that is they exist.","final void removePrinters(List<PrinterId> printerIds) Removes added printers.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.printservice","constants":[],"class":"PrinterDiscoverySession","constructors":[],"fields":[]}