{"methods":["PrintStream append(char c) Appends the char c.","PrintStream append(CharSequence charSequence, int start, int end) Appends a subsequence of CharSequence charSequence, or \"null\".","PrintStream append(CharSequence charSequence) Appends the CharSequence charSequence, or \"null\".","boolean checkError() Flushes this stream and returns the value of the error flag.","synchronized void close() Closes this print stream.","synchronized void flush() Ensures that all pending data is sent out to the target stream.","PrintStream format(Locale l, String format, Object... args) Writes a string formatted by an intermediate Formatter to this stream using the specified locale, format string and arguments.","PrintStream format(String format, Object... args) Formats args according to the format string format, and writes the result to this stream.","void print(float f) Prints the string representation of the float f.","void print(double d) Prints the string representation of the double d.","synchronized void print(String str) Prints a string to the target stream.","void print(Object o) Prints the string representation of the Object o, or \"null\".","void print(char c) Prints the string representation of the char c.","void print(char[] chars) Prints the string representation of the character array chars.","void print(long l) Prints the string representation of the long l.","void print(int i) Prints the string representation of the int i.","void print(boolean b) Prints the string representation of the boolean b.","PrintStream printf(Locale l, String format, Object... args) Prints a formatted string.","PrintStream printf(String format, Object... args) Prints a formatted string.","void println() Prints a newline.","void println(float f) Prints the string representation of the float f followed by a newline.","void println(int i) Prints the string representation of the int i followed by a newline.","void println(long l) Prints the string representation of the long l followed by a newline.","void println(Object o) Prints the string representation of the Object o, or \"null\", followed by a newline.","void println(char[] chars) Prints the string representation of the character array chars followed by a newline.","synchronized void println(String str) Prints a string followed by a newline.","void println(char c) Prints the string representation of the char c followed by a newline.","void println(double d) Prints the string representation of the double d followed by a newline.","void println(boolean b) Prints the string representation of the boolean b followed by a newline.","synchronized void write(int oneByte) Writes one byte to the target stream.","void write(byte[] buffer, int offset, int length) Writes count bytes from buffer starting at offset to the target stream.","void clearError() Sets the error state of the stream to false.","void setError() Sets the error flag of this print stream to true.","[Expand] Inherited Methods","From class java.io.FilterOutputStream void close() Closes this stream. void flush() Ensures that all pending data is sent out to the target stream. void write(byte[] buffer, int offset, int length) Writes count bytes from the byte array buffer starting at offset to the target stream. void write(int oneByte) Writes one byte to the target stream.","void close() Closes this stream.","void flush() Ensures that all pending data is sent out to the target stream.","void write(byte[] buffer, int offset, int length) Writes count bytes from the byte array buffer starting at offset to the target stream.","void write(int oneByte) Writes one byte to the target stream.","From class java.io.OutputStream void close() Closes this stream. void flush() Flushes this stream. void write(byte[] buffer, int offset, int count) Writes count bytes from the byte array buffer starting at position offset to this stream. void write(byte[] buffer) Equivalent to write(buffer, 0, buffer.length). abstract void write(int oneByte) Writes a single byte to this stream.","void close() Closes this stream.","void flush() Flushes this stream.","void write(byte[] buffer, int offset, int count) Writes count bytes from the byte array buffer starting at position offset to this stream.","void write(byte[] buffer) Equivalent to write(buffer, 0, buffer.length).","abstract void write(int oneByte) Writes a single byte to this stream.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.io.Flushable abstract void flush() Flushes the object by writing out any buffered data to the underlying output.","abstract void flush() Flushes the object by writing out any buffered data to the underlying output.","From interface java.lang.Appendable abstract Appendable append(CharSequence csq) Appends the character sequence csq. abstract Appendable append(CharSequence csq, int start, int end) Appends a subsequence of csq. abstract Appendable append(char c) Appends the specified character.","abstract Appendable append(CharSequence csq) Appends the character sequence csq.","abstract Appendable append(CharSequence csq, int start, int end) Appends a subsequence of csq.","abstract Appendable append(char c) Appends the specified character.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"java.io","constants":[],"class":"PrintStream","constructors":[],"fields":[]}