{"methods":["int getColorMode() Gets the color mode with which the image will be printed.","int getOrientation() Gets whether the image will be printed in landscape or portrait.","int getScaleMode() Returns the scale mode with which the image will fill the paper.","void printBitmap(String jobName, Uri imageFile, PrintHelper.OnPrintFinishCallback callback) Prints an image located at the Uri.","void printBitmap(String jobName, Bitmap bitmap) Prints a bitmap.","void printBitmap(String jobName, Uri imageFile) Prints an image located at the Uri.","void printBitmap(String jobName, Bitmap bitmap, PrintHelper.OnPrintFinishCallback callback) Prints a bitmap.","void setColorMode(int colorMode) Sets whether the image will be printed in color (default) COLOR_MODE_COLOR or in back and white COLOR_MODE_MONOCHROME.","void setOrientation(int orientation) Sets whether the image will be printed in landscape ORIENTATION_LANDSCAPE (default) or portrait ORIENTATION_PORTRAIT.","void setScaleMode(int scaleMode) Selects whether the image will fill the paper and be cropped SCALE_MODE_FIT or whether the image will be scaled but leave white space SCALE_MODE_FILL.","static boolean systemSupportsPrint() Gets whether the system supports printing.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.print","constants":["int COLOR_MODE_COLOR this is a color image (default)","int COLOR_MODE_MONOCHROME this is a black and white image","int ORIENTATION_LANDSCAPE Print the image in landscape orientation (default).","int ORIENTATION_PORTRAIT Print the image in portrait orientation.","int SCALE_MODE_FILL image will fill the paper and be cropped (default)","int SCALE_MODE_FIT image will be scaled but leave white space"],"class":"PrintHelper","constructors":[],"fields":[]}