{"methods":["boolean block(String reason) Blocks the print job.","boolean cancel() Cancels the print job.","boolean complete() Completes the print job.","boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","boolean fail(String error) Fails the print job.","int getAdvancedIntOption(String key) Gets the value of an advanced (printer specific) print option.","String getAdvancedStringOption(String key) Gets the value of an advanced (printer specific) print option.","PrintDocument getDocument() Gets the printed document.","PrintJobId getId() Gets the unique print job id.","PrintJobInfo getInfo() Gets the PrintJobInfo that describes this job.","String getTag() Gets the print job tag.","boolean hasAdvancedOption(String key) Gets whether this job has a given advanced (printer specific) print option.","int hashCode() Returns an integer hash code for this object.","boolean isBlocked() Gets whether this print job is blocked.","boolean isCancelled() Gets whether this print job is cancelled.","boolean isCompleted() Gets whether this print job is completed.","boolean isFailed() Gets whether this print job is failed.","boolean isQueued() Gets whether this print job is queued.","boolean isStarted() Gets whether this print job is started.","boolean setTag(String tag) Sets a tag that is valid in the context of a PrintService and is not interpreted by the system.","boolean start() Starts the print job.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.printservice","constants":[],"class":"PrintJob","constructors":[],"fields":[]}