{"methods":["void addPropertyChangeListener(PropertyChangeListener listener) Subscribes listener to change notifications for all properties.","void addPropertyChangeListener(String propertyName, PropertyChangeListener listener) Subscribes listener to change notifications for the property named propertyName.","void fireIndexedPropertyChange(String propertyName, int index, int oldValue, int newValue) Fires a property change of an integer property with the given name.","void fireIndexedPropertyChange(String propertyName, int index, Object oldValue, Object newValue) Fires an IndexedPropertyChangeEvent with the given name, old value, new value and index.","void fireIndexedPropertyChange(String propertyName, int index, boolean oldValue, boolean newValue) Fires a property change of a boolean property with the given name.","void firePropertyChange(String propertyName, int oldValue, int newValue) Fires a property change of an integer property with the given name.","void firePropertyChange(String propertyName, boolean oldValue, boolean newValue) Fires a property change of a boolean property with the given name.","void firePropertyChange(PropertyChangeEvent event) Publishes a property change event to all listeners of that property.","void firePropertyChange(String propertyName, Object oldValue, Object newValue) Fires a PropertyChangeEvent with the given name, old value and new value.","PropertyChangeListener[] getPropertyChangeListeners() Returns all subscribers.","PropertyChangeListener[] getPropertyChangeListeners(String propertyName) Returns the subscribers to be notified when propertyName changes.","boolean hasListeners(String propertyName) Returns true if there are listeners registered to the property with the given name.","void removePropertyChangeListener(String propertyName, PropertyChangeListener listener) Unsubscribes listener from change notifications for the property named propertyName.","void removePropertyChangeListener(PropertyChangeListener listener) Unsubscribes listener from change notifications for all properties.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.beans","constants":[],"class":"PropertyChangeSupport","constructors":[],"fields":[]}