{"methods":["Enumeration<String> getKeys() Returns the names of the resources contained in this ResourceBundle.","Object handleGetObject(String key) Returns the named resource from this ResourceBundle, or null if the resource is not found.","Set<String> handleKeySet()","[Expand] Inherited Methods","From class java.util.ResourceBundle static void clearCache(ClassLoader loader) static void clearCache() boolean containsKey(String key) static ResourceBundle getBundle(String bundleName, Locale locale, ClassLoader loader) Finds the named resource bundle for the specified Locale and ClassLoader. static ResourceBundle getBundle(String baseName, Locale targetLocale, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control. static ResourceBundle getBundle(String bundleName) Finds the named resource bundle for the default Locale and the caller's ClassLoader. static ResourceBundle getBundle(String baseName, Locale targetLocale, ClassLoader loader, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control. static ResourceBundle getBundle(String bundleName, Locale locale) Finds the named ResourceBundle for the specified Locale and the caller ClassLoader. static ResourceBundle getBundle(String baseName, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control. abstract Enumeration<String> getKeys() Returns the names of the resources contained in this ResourceBundle. Locale getLocale() Gets the Locale of this ResourceBundle. final Object getObject(String key) Returns the named resource from this ResourceBundle. final String getString(String key) Returns the named string resource from this ResourceBundle. final String[] getStringArray(String key) Returns the named resource from this ResourceBundle. abstract Object handleGetObject(String key) Returns the named resource from this ResourceBundle, or null if the resource is not found. Set<String> handleKeySet() Set<String> keySet() void setParent(ResourceBundle bundle) Sets the parent resource bundle of this ResourceBundle.","static void clearCache(ClassLoader loader)","static void clearCache()","boolean containsKey(String key)","static ResourceBundle getBundle(String bundleName, Locale locale, ClassLoader loader) Finds the named resource bundle for the specified Locale and ClassLoader.","static ResourceBundle getBundle(String baseName, Locale targetLocale, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control.","static ResourceBundle getBundle(String bundleName) Finds the named resource bundle for the default Locale and the caller's ClassLoader.","static ResourceBundle getBundle(String baseName, Locale targetLocale, ClassLoader loader, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control.","static ResourceBundle getBundle(String bundleName, Locale locale) Finds the named ResourceBundle for the specified Locale and the caller ClassLoader.","static ResourceBundle getBundle(String baseName, ResourceBundle.Control control) Finds the named resource bundle for the specified base name and control.","abstract Enumeration<String> getKeys() Returns the names of the resources contained in this ResourceBundle.","Locale getLocale() Gets the Locale of this ResourceBundle.","final Object getObject(String key) Returns the named resource from this ResourceBundle.","final String getString(String key) Returns the named string resource from this ResourceBundle.","final String[] getStringArray(String key) Returns the named resource from this ResourceBundle.","abstract Object handleGetObject(String key) Returns the named resource from this ResourceBundle, or null if the resource is not found.","Set<String> handleKeySet()","Set<String> keySet()","void setParent(ResourceBundle bundle) Sets the parent resource bundle of this ResourceBundle.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util","constants":[],"class":"PropertyResourceBundle","constructors":[],"fields":[]}