{"methods":["Object clone() Creates and returns a copy of this Object.","int compareToVersion(ProtocolVersion that) Compares this protocol version with another one.","final boolean equals(Object obj) Checks equality of this protocol version with an object.","ProtocolVersion forVersion(int major, int minor) Obtains a specific version of this protocol.","final int getMajor() Returns the major version number of the protocol.","final int getMinor() Returns the minor version number of the HTTP protocol.","final String getProtocol() Returns the name of the protocol.","final boolean greaterEquals(ProtocolVersion version) Tests if this protocol version is greater or equal to the given one.","final int hashCode() Obtains a hash code consistent with equals(Object).","boolean isComparable(ProtocolVersion that) Checks whether this protocol can be compared to another one.","final boolean lessEquals(ProtocolVersion version) Tests if this protocol version is less or equal to the given one.","String toString() Converts this protocol version to a string.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http","constants":[],"class":"ProtocolVersion","constructors":[],"fields":["protected final int major Major version number of the protocol","protected final int minor Minor version number of the protocol","protected final String protocol Name of the protocol."]}