{"methods":["void close() Closes this reader.","void mark(int readAheadLimit) Marks the current position in this stream.","boolean markSupported() Indicates whether this reader supports the mark(int) and reset() methods.","int read() Reads a single character from this reader and returns it as an integer with the two higher-order bytes set to 0.","int read(char[] buffer, int offset, int count) Reads up to count characters from this reader and stores them in character array buffer starting at offset.","boolean ready() Indicates whether this reader is ready to be read without blocking.","void reset() Resets this reader to the last marked position.","long skip(long charCount) Skips charCount characters in this reader.","void unread(char[] buffer, int offset, int length) Pushes a subset of the characters in buffer back to this reader.","void unread(char[] buffer) Pushes all the characters in buffer back to this reader.","void unread(int oneChar) Pushes the specified character oneChar back to this reader.","[Expand] Inherited Methods","From class java.io.FilterReader void close() Closes this reader. synchronized void mark(int readlimit) Sets a mark position in this reader. boolean markSupported() Indicates whether this reader supports mark() and reset(). int read() Reads a single character from the filtered reader and returns it as an integer with the two higher-order bytes set to 0. int read(char[] buffer, int offset, int count) Reads up to count characters from the filtered reader and stores them in the byte array buffer starting at offset. boolean ready() Indicates whether this reader is ready to be read without blocking. void reset() Resets this reader's position to the last marked location. long skip(long charCount) Skips charCount characters in this reader.","void close() Closes this reader.","synchronized void mark(int readlimit) Sets a mark position in this reader.","boolean markSupported() Indicates whether this reader supports mark() and reset().","int read() Reads a single character from the filtered reader and returns it as an integer with the two higher-order bytes set to 0.","int read(char[] buffer, int offset, int count) Reads up to count characters from the filtered reader and stores them in the byte array buffer starting at offset.","boolean ready() Indicates whether this reader is ready to be read without blocking.","void reset() Resets this reader's position to the last marked location.","long skip(long charCount) Skips charCount characters in this reader.","From class java.io.Reader abstract void close() Closes this reader. void mark(int readLimit) Sets a mark position in this reader. boolean markSupported() Indicates whether this reader supports the mark() and reset() methods. int read() Reads a single character from this reader and returns it as an integer with the two higher-order bytes set to 0. abstract int read(char[] buffer, int offset, int count) Reads up to count characters from this reader and stores them at offset in the character array buffer. int read(CharBuffer target) Reads characters and puts them into the target character buffer. int read(char[] buffer) Reads characters from this reader and stores them in the character array buffer starting at offset 0. boolean ready() Indicates whether this reader is ready to be read without blocking. void reset() Resets this reader's position to the last mark() location. long skip(long charCount) Skips charCount characters in this reader.","abstract void close() Closes this reader.","void mark(int readLimit) Sets a mark position in this reader.","boolean markSupported() Indicates whether this reader supports the mark() and reset() methods.","int read() Reads a single character from this reader and returns it as an integer with the two higher-order bytes set to 0.","abstract int read(char[] buffer, int offset, int count) Reads up to count characters from this reader and stores them at offset in the character array buffer.","int read(CharBuffer target) Reads characters and puts them into the target character buffer.","int read(char[] buffer) Reads characters from this reader and stores them in the character array buffer starting at offset 0.","boolean ready() Indicates whether this reader is ready to be read without blocking.","void reset() Resets this reader's position to the last mark() location.","long skip(long charCount) Skips charCount characters in this reader.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.Readable abstract int read(CharBuffer cb) Reads characters into the specified CharBuffer.","abstract int read(CharBuffer cb) Reads characters into the specified CharBuffer."],"package":"java.io","constants":[],"class":"PushbackReader","constructors":[],"fields":[]}