{"methods":["abstract PendingResult<Quests.AcceptQuestResult> accept(GoogleApiClient apiClient, String questId) Asynchronously accept the quest.","abstract PendingResult<Quests.ClaimMilestoneResult> claim(GoogleApiClient apiClient, String questId, String milestoneId) Asynchronously claim the milestone.","abstract Intent getQuestIntent(GoogleApiClient apiClient, String questId) Get an intent to view a single quest.","abstract Intent getQuestsIntent(GoogleApiClient apiClient, int[] questSelectors) Get an intent to view a list of quests.","abstract PendingResult<Quests.LoadQuestsResult> load(GoogleApiClient apiClient, int[] questSelectors, int sortOrder, boolean forceReload) Asynchronously load the quest data for the currently signed-in player and game into a single result, including only quests in the provided state array.","abstract PendingResult<Quests.LoadQuestsResult> loadByIds(GoogleApiClient apiClient, boolean forceReload, String... questIds) Asynchronously load single quest data for the currently signed-in player and game.","abstract void registerQuestUpdateListener(GoogleApiClient apiClient, QuestUpdateListener listener) Register a listener to listen for updates on Quest instances.","abstract void showStateChangedPopup(GoogleApiClient apiClient, String questId) Show the default popup for certain quest states.","abstract void unregisterQuestUpdateListener(GoogleApiClient apiClient) Unregisters this client's quest update listener, if any."],"package":"com.google.android.gms.games.quest","constants":["String EXTRA_QUEST Intent extra used to pass a Quest.","int SELECT_ACCEPTED Constant used to add quests in the STATE_ACCEPTED state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_COMPLETED Constant used to add quests in the STATE_COMPLETED state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_COMPLETED_UNCLAIMED Constant used to add quests in the STATE_COMPLETED state that have at least one milestone in the STATE_COMPLETED_NOT_CLAIMED state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_ENDING_SOON Constant used to add quests in the STATE_ACCEPTED state that have been marked as ending soon isEndingSoon() returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_EXPIRED Constant used to add quests in the STATE_EXPIRED state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_FAILED Constant used to add quests in the STATE_FAILED state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_OPEN Constant used to add quests in the STATE_OPEN state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SELECT_RECENTLY_FAILED Constant used to add quests in the STATE_FAILED state with a getLastUpdatedTimestamp() no older than 7 days ago.","int SELECT_UPCOMING Constant used to add quests in the STATE_UPCOMING state to the QuestBuffer returned by load(GoogleApiClient, int[], int, boolean) and getQuestsIntent(GoogleApiClient, int[]).","int SORT_ORDER_ENDING_SOON_FIRST Sort requests with the quests ending soon first.","int SORT_ORDER_RECENTLY_UPDATED_FIRST Sort requests with the recently updated quests first."],"class":"Quests","constructors":[],"fields":["public static final int[] SELECT_ALL_QUESTS Array of all the valid state selector constants."]}