{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms","constants":[],"class":"R.attr","constructors":[],"fields":["public static int adSize The size of the ad.","public static int adSizes A comma-separated list of the supported ad sizes.","public static int adUnitId The ad unit ID.","public static int allowShortcuts Whether or not global search is enabled for this corpus.","public static int appTheme Theme to be used for the Wallet selector Must be one of the following constant values.","public static int buyButtonAppearance Appearance of the buy button.","public static int buyButtonHeight Height of the buy button.","public static int buyButtonText Text on the buy button.","public static int buyButtonWidth Width of the buy button.","public static int cameraBearing Must be a floating point value, such as \"1.2\".","public static int cameraTargetLat Must be a floating point value, such as \"1.2\".","public static int cameraTargetLng Must be a floating point value, such as \"1.2\".","public static int cameraTilt Must be a floating point value, such as \"1.2\".","public static int cameraZoom Must be a floating point value, such as \"1.2\".","public static int contentProviderUri The URI of the content provider that the index should crawl to get the data for this corpus.","public static int corpusId The ID of the corpus.","public static int corpusVersion The version of the corpus.","public static int defaultIntentAction The default value for the global search section default_intent_action.","public static int defaultIntentActivity The default value for the global search section default_intent_aactivity.","public static int defaultIntentData The default value for the global search section default_intent_data.","public static int environment Google Wallet environment to use Must be one of the following constant values.","public static int featureType The type of this feature.","public static int fragmentMode Fragment mode Must be one of the following constant values.","public static int fragmentStyle A style resource specifing attributes to customize the look and feel of WalletFragment Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int indexPrefixes Indicates if this section should support prefix matching.","public static int inputEnabled Whether or not this corpus could be useful input for IME.","public static int mapType Must be one of the following constant values.","public static int maskedWalletDetailsBackground Masked wallet details background May be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int maskedWalletDetailsButtonBackground \"Change\" button background in masked wallet details view May be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int maskedWalletDetailsButtonTextAppearance TextAppearance for the \"Change\" button in masked wallet details view Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int maskedWalletDetailsHeaderTextAppearance TextAppearance for headers describing masked wallet details Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int maskedWalletDetailsLogoImageType Type of the wallet logo image in masked wallet details view Must be one of the following constant values.","public static int maskedWalletDetailsLogoTextColor Color of the Google Wallet logo text in masked wallet details view Must be a color value, in the form of \"#rgb\", \"#argb\", \"#rrggbb\", or \"#aarrggbb\".","public static int maskedWalletDetailsTextAppearance TextAppearance for masked wallet details Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int noIndex Indicates if this section should not be indexed.","public static int paramName The name of this parameter.","public static int paramValue The value of this parameter.","public static int schemaOrgProperty Section corresponds to this schema.org property.","public static int schemaOrgType schema.org type of documents in this corpus.","public static int searchEnabled Whether or not global search is enabled for this app.","public static int searchLabel A localized string to identify this app's data within the global search app.","public static int sectionContent The content of this global search section.","public static int sectionFormat The format of the section.","public static int sectionId The ID of the section.","public static int sectionType The type of global search section for this mapping.","public static int sectionWeight The weight of the section.","public static int settingsDescription A localized string to describe this apps data within the global search apps settings.","public static int sourceClass Class of the source.","public static int subsectionSeparator Subsection separator.","public static int toAddressesSection Sections containing entities communicated with in a given document.","public static int trimmable Indicates if documents from this corpus can be trimmed when the index reaches its quota.","public static int uiCompass Must be a boolean value, either \"true\" or \"false\".","public static int uiRotateGestures Must be a boolean value, either \"true\" or \"false\".","public static int uiScrollGestures Must be a boolean value, either \"true\" or \"false\".","public static int uiTiltGestures Must be a boolean value, either \"true\" or \"false\".","public static int uiZoomControls Must be a boolean value, either \"true\" or \"false\".","public static int uiZoomGestures Must be a boolean value, either \"true\" or \"false\".","public static int useViewLifecycle Must be a boolean value, either \"true\" or \"false\".","public static int userInputSection If this section is non-empty, the document is considered to be input by the user if either userInputValue is not set or the content of this section is equal to that value.","public static int userInputTag Tag name for documents that contain data input by the user.","public static int userInputValue If set, userInputSection contents needs to equal this value for the document to be considered input by user.","public static int zOrderOnTop Must be a boolean value, either \"true\" or \"false\"."]}