{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms","constants":[],"class":"R.styleable","constructors":[],"fields":["public static final int[] AdsAttrs Attributes that can be used with a AdsAttrs.","public static int AdsAttrs_adSize The size of the ad.","public static int AdsAttrs_adSizes A comma-separated list of the supported ad sizes.","public static int AdsAttrs_adUnitId The ad unit ID.","public static final int[] AppDataSearch Attributes that can be used with a AppDataSearch.","public static final int[] Corpus Attributes that can be used with a Corpus.","public static int Corpus_contentProviderUri The URI of the content provider that the index should crawl to get the data for this corpus.","public static int Corpus_corpusId The ID of the corpus.","public static int Corpus_corpusVersion The version of the corpus.","public static int Corpus_schemaOrgType schema.org type of documents in this corpus.","public static int Corpus_trimmable Indicates if documents from this corpus can be trimmed when the index reaches its quota.","public static final int[] FeatureParam Attributes that can be used with a FeatureParam.","public static int FeatureParam_paramName The name of this parameter.","public static int FeatureParam_paramValue The value of this parameter.","public static final int[] GlobalSearch Attributes that can be used with a GlobalSearch.","public static final int[] GlobalSearchCorpus Attributes that can be used with a GlobalSearchCorpus.","public static int GlobalSearchCorpus_allowShortcuts Whether or not global search is enabled for this corpus.","public static final int[] GlobalSearchSection Attributes that can be used with a GlobalSearchSection.","public static int GlobalSearchSection_sectionContent The content of this global search section.","public static int GlobalSearchSection_sectionType The type of global search section for this mapping.","public static int GlobalSearch_defaultIntentAction The default value for the global search section default_intent_action.","public static int GlobalSearch_defaultIntentActivity The default value for the global search section default_intent_aactivity.","public static int GlobalSearch_defaultIntentData The default value for the global search section default_intent_data.","public static int GlobalSearch_searchEnabled Whether or not global search is enabled for this app.","public static int GlobalSearch_searchLabel A localized string to identify this app's data within the global search app.","public static int GlobalSearch_settingsDescription A localized string to describe this apps data within the global search apps settings.","public static final int[] IMECorpus Attributes that can be used with a IMECorpus.","public static int IMECorpus_inputEnabled Whether or not this corpus could be useful input for IME.","public static int IMECorpus_sourceClass Class of the source.","public static int IMECorpus_toAddressesSection Sections containing entities communicated with in a given document.","public static int IMECorpus_userInputSection If this section is non-empty, the document is considered to be input by the user if either userInputValue is not set or the content of this section is equal to that value.","public static int IMECorpus_userInputTag Tag name for documents that contain data input by the user.","public static int IMECorpus_userInputValue If set, userInputSection contents needs to equal this value for the document to be considered input by user.","public static final int[] MapAttrs Attributes that can be used with a MapAttrs.","public static int MapAttrs_cameraBearing This symbol is the offset where the cameraBearing attribute's value can be found in the MapAttrs array.","public static int MapAttrs_cameraTargetLat This symbol is the offset where the cameraTargetLat attribute's value can be found in the MapAttrs array.","public static int MapAttrs_cameraTargetLng This symbol is the offset where the cameraTargetLng attribute's value can be found in the MapAttrs array.","public static int MapAttrs_cameraTilt This symbol is the offset where the cameraTilt attribute's value can be found in the MapAttrs array.","public static int MapAttrs_cameraZoom This symbol is the offset where the cameraZoom attribute's value can be found in the MapAttrs array.","public static int MapAttrs_mapType This symbol is the offset where the mapType attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiCompass This symbol is the offset where the uiCompass attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiRotateGestures This symbol is the offset where the uiRotateGestures attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiScrollGestures This symbol is the offset where the uiScrollGestures attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiTiltGestures This symbol is the offset where the uiTiltGestures attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiZoomControls This symbol is the offset where the uiZoomControls attribute's value can be found in the MapAttrs array.","public static int MapAttrs_uiZoomGestures This symbol is the offset where the uiZoomGestures attribute's value can be found in the MapAttrs array.","public static int MapAttrs_useViewLifecycle This symbol is the offset where the useViewLifecycle attribute's value can be found in the MapAttrs array.","public static int MapAttrs_zOrderOnTop This symbol is the offset where the zOrderOnTop attribute's value can be found in the MapAttrs array.","public static final int[] Section Attributes that can be used with a Section.","public static final int[] SectionFeature Attributes that can be used with a SectionFeature.","public static int SectionFeature_featureType The type of this feature.","public static int Section_indexPrefixes Indicates if this section should support prefix matching.","public static int Section_noIndex Indicates if this section should not be indexed.","public static int Section_schemaOrgProperty Section corresponds to this schema.org property.","public static int Section_sectionFormat The format of the section.","public static int Section_sectionId The ID of the section.","public static int Section_sectionWeight The weight of the section.","public static int Section_subsectionSeparator Subsection separator.","public static final int[] WalletFragmentOptions Attributes that can be used with a WalletFragmentOptions.","public static int WalletFragmentOptions_appTheme Theme to be used for the Wallet selector Must be one of the following constant values.","public static int WalletFragmentOptions_environment Google Wallet environment to use Must be one of the following constant values.","public static int WalletFragmentOptions_fragmentMode Fragment mode Must be one of the following constant values.","public static int WalletFragmentOptions_fragmentStyle A style resource specifing attributes to customize the look and feel of WalletFragment Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static final int[] WalletFragmentStyle Attributes that can be used with a WalletFragmentStyle.","public static int WalletFragmentStyle_buyButtonAppearance Appearance of the buy button.","public static int WalletFragmentStyle_buyButtonHeight Height of the buy button.","public static int WalletFragmentStyle_buyButtonText Text on the buy button.","public static int WalletFragmentStyle_buyButtonWidth Width of the buy button.","public static int WalletFragmentStyle_maskedWalletDetailsBackground Masked wallet details background May be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int WalletFragmentStyle_maskedWalletDetailsButtonBackground \"Change\" button background in masked wallet details view May be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int WalletFragmentStyle_maskedWalletDetailsButtonTextAppearance TextAppearance for the \"Change\" button in masked wallet details view Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int WalletFragmentStyle_maskedWalletDetailsHeaderTextAppearance TextAppearance for headers describing masked wallet details Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\".","public static int WalletFragmentStyle_maskedWalletDetailsLogoImageType Type of the wallet logo image in masked wallet details view Must be one of the following constant values.","public static int WalletFragmentStyle_maskedWalletDetailsLogoTextColor Color of the Google Wallet logo text in masked wallet details view Must be a color value, in the form of \"#rgb\", \"#argb\", \"#rrggbb\", or \"#aarrggbb\".","public static int WalletFragmentStyle_maskedWalletDetailsTextAppearance TextAppearance for masked wallet details Must be a reference to another resource, in the form \"@[+][package:]type:name\" or to a theme attribute in the form \"?[package:][type:]name\"."]}