{"methods":["int compareTo(Rational another) Compare this rational to the specified rational to determine their natural order.","double doubleValue() Returns the value of the specified number as a double.","boolean equals(Object obj) Compare this Rational to another object and see if they are equal.","float floatValue() Returns the value of the specified number as a float.","int getDenominator() Gets the denominator of the rational The denominator may return 0, in which case the rational may represent positive infinity (if the numerator was positive), negative infinity (if the numerator was negative), or NaN (if the numerator was 0).","int getNumerator() Gets the numerator of the rational.","int hashCode() Returns an integer hash code for this object.","int intValue() Returns the value of the specified number as a int.","boolean isFinite() Indicates whether this rational represents a finite value.","boolean isInfinite() Indicates whether this rational represents an infinite value.","boolean isNaN() Indicates whether this rational is a Not-a-Number (NaN) value.","boolean isZero() Indicates whether this rational represents a zero value.","long longValue() Returns the value of the specified number as a long.","static Rational parseRational(String string) Parses the specified string as a rational value.","short shortValue() Returns the value of the specified number as a short.","String toString() Return a string representation of this rational, e.g.","[Expand] Inherited Methods","From class java.lang.Number byte byteValue() Returns this object's value as a byte. abstract double doubleValue() Returns this object's value as a double. abstract float floatValue() Returns this object's value as a float. abstract int intValue() Returns this object's value as an int. abstract long longValue() Returns this object's value as a long. short shortValue() Returns this object's value as a short.","byte byteValue() Returns this object's value as a byte.","abstract double doubleValue() Returns this object's value as a double.","abstract float floatValue() Returns this object's value as a float.","abstract int intValue() Returns this object's value as an int.","abstract long longValue() Returns this object's value as a long.","short shortValue() Returns this object's value as a short.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"android.util","constants":[],"class":"Rational","constructors":[],"fields":["public static final Rational NEGATIVE_INFINITY Constant for the negative infinity value of the Rational type.","public static final Rational NaN Constant for the Not-a-Number (NaN) value of the Rational type.","public static final Rational POSITIVE_INFINITY Constant for the positive infinity value of the Rational type.","public static final Rational ZERO Constant for the zero value of the Rational type."]}