{"methods":["abstract void create(GoogleApiClient apiClient, RoomConfig config) Create a real-time room for the current game.","abstract void declineInvitation(GoogleApiClient apiClient, String invitationId) Decline an invitation for a real-time room.","abstract void dismissInvitation(GoogleApiClient apiClient, String invitationId) Dismiss an invitation to a real-time room.","abstract Intent getSelectOpponentsIntent(GoogleApiClient apiClient, int minPlayers, int maxPlayers, boolean allowAutomatch) Returns an intent that will let the user select opponents to send an invitation to for a real-time multiplayer match.","abstract Intent getSelectOpponentsIntent(GoogleApiClient apiClient, int minPlayers, int maxPlayers) Returns an intent that will let the user select opponents to send an invitation to for a real-time multiplayer match.","abstract RealTimeSocket getSocketForParticipant(GoogleApiClient apiClient, String roomId, String participantId) Returns a RealTimeSocket for carrying network traffic to the given peer.","abstract Intent getWaitingRoomIntent(GoogleApiClient apiClient, Room room, int minParticipantsToStart) Returns an intent that will display a \"waiting room\" screen that shows the progress of participants joining a real-time multiplayer room.","abstract void join(GoogleApiClient apiClient, RoomConfig config) Join a real-time room by accepting an invitation.","abstract void leave(GoogleApiClient apiClient, RoomUpdateListener listener, String roomId) Leave the specified room.","abstract int sendReliableMessage(GoogleApiClient apiClient, RealTimeMultiplayer.ReliableMessageSentCallback listener, byte[] messageData, String roomId, String recipientParticipantId) Send a message to a participant in a real-time room reliably.","abstract int sendUnreliableMessage(GoogleApiClient apiClient, byte[] messageData, String roomId, String recipientParticipantId) Send a message to a participant in a real-time room.","abstract int sendUnreliableMessage(GoogleApiClient apiClient, byte[] messageData, String roomId, List<String> recipientParticipantIds) Send a message to one or more participants in a real-time room.","abstract int sendUnreliableMessageToOthers(GoogleApiClient apiClient, byte[] messageData, String roomId) Send a message to all participants in a real-time room, excluding the current player."],"package":"com.google.android.gms.games.multiplayer.realtime","constants":["int REAL_TIME_MESSAGE_FAILED Return value indicating immediate failure."],"class":"RealTimeMultiplayer","constructors":[],"fields":[]}