{"methods":["final static Intent getVoiceDetailsIntent(Context context) Returns the broadcast intent to fire with sendOrderedBroadcast(Intent, String, BroadcastReceiver, android.os.Handler, int, String, Bundle) to receive details from the package that implements voice search.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.speech","constants":["String ACTION_GET_LANGUAGE_DETAILS A broadcast intent which can be fired to the BroadcastReceiver component specified in the meta-data defined in the DETAILS_META_DATA meta-data of an Activity satisfying ACTION_WEB_SEARCH.","String ACTION_RECOGNIZE_SPEECH Starts an activity that will prompt the user for speech and send it through a speech recognizer.","String ACTION_VOICE_SEARCH_HANDS_FREE Starts an activity that will prompt the user for speech without requiring the user's visual attention or touch input.","String ACTION_WEB_SEARCH Starts an activity that will prompt the user for speech, send it through a speech recognizer, and either display a web search result or trigger another type of action based on the user's speech.","String DETAILS_META_DATA Meta-data name under which an Activity implementing ACTION_WEB_SEARCH can use to expose the class name of a BroadcastReceiver which can respond to request for more information, from any of the broadcast intents specified in this class.","String EXTRA_CALLING_PACKAGE The extra key used in an intent to the speech recognizer for voice search.","String EXTRA_CONFIDENCE_SCORES A float array of confidence scores of the recognition results when performing ACTION_RECOGNIZE_SPEECH.","String EXTRA_LANGUAGE Optional IETF language tag (as defined by BCP 47), for example \"en-US\".","String EXTRA_LANGUAGE_MODEL Informs the recognizer which speech model to prefer when performing ACTION_RECOGNIZE_SPEECH.","String EXTRA_LANGUAGE_PREFERENCE The key to the extra in the Bundle returned by ACTION_GET_LANGUAGE_DETAILS which is a String that represents the current language preference this user has specified - a locale string like \"en-US\".","String EXTRA_MAX_RESULTS Optional limit on the maximum number of results to return.","String EXTRA_ONLY_RETURN_LANGUAGE_PREFERENCE Specify this boolean extra in a broadcast of ACTION_GET_LANGUAGE_DETAILS to indicate that only the current language preference is needed in the response.","String EXTRA_ORIGIN Optional value which can be used to indicate the referer url of a page in which speech was requested.","String EXTRA_PARTIAL_RESULTS Optional boolean to indicate whether partial results should be returned by the recognizer as the user speaks (default is false).","String EXTRA_PROMPT Optional text prompt to show to the user when asking them to speak.","String EXTRA_RESULTS An ArrayList<String> of the recognition results when performing ACTION_RECOGNIZE_SPEECH.","String EXTRA_RESULTS_PENDINGINTENT When the intent is ACTION_RECOGNIZE_SPEECH, the speech input activity will return results to you via the activity results mechanism.","String EXTRA_RESULTS_PENDINGINTENT_BUNDLE If you use EXTRA_RESULTS_PENDINGINTENT to supply a forwarding intent, you can also use this extra to supply additional extras for the final intent.","String EXTRA_SECURE Optional boolean to indicate that a \"hands free\" voice search was performed while the device was in a secure mode.","String EXTRA_SPEECH_INPUT_COMPLETE_SILENCE_LENGTH_MILLIS The amount of time that it should take after we stop hearing speech to consider the input complete.","String EXTRA_SPEECH_INPUT_MINIMUM_LENGTH_MILLIS The minimum length of an utterance.","String EXTRA_SPEECH_INPUT_POSSIBLY_COMPLETE_SILENCE_LENGTH_MILLIS The amount of time that it should take after we stop hearing speech to consider the input possibly complete.","String EXTRA_SUPPORTED_LANGUAGES The key to the extra in the Bundle returned by ACTION_GET_LANGUAGE_DETAILS which is an ArrayList of Strings that represents the languages supported by this implementation of voice recognition - a list of strings like \"en-US\", \"cmn-Hans-CN\", etc.","String EXTRA_WEB_SEARCH_ONLY Optional boolean, to be used with ACTION_WEB_SEARCH, to indicate whether to only fire web searches in response to a user's speech.","String LANGUAGE_MODEL_FREE_FORM Use a language model based on free-form speech recognition.","String LANGUAGE_MODEL_WEB_SEARCH Use a language model based on web search terms.","int RESULT_AUDIO_ERROR Result code returned when an audio error was encountered","int RESULT_CLIENT_ERROR Result code returned when there is a generic client error","int RESULT_NETWORK_ERROR Result code returned when a network error was encountered","int RESULT_NO_MATCH Result code returned when no matches are found for the given speech","int RESULT_SERVER_ERROR Result code returned when the recognition server returns an error"],"class":"RecognizerIntent","constructors":[],"fields":[]}