{"methods":["boolean didStructureChange()","<T> T get(int resourceId) Gets the Object mapped from the specified id, or null if no such data exists.","int getItemCount() Returns the total number of items that can be laid out.","int getTargetScrollPosition() If scroll is triggered to make a certain item visible, this value will return the adapter index of that item.","boolean hasTargetScrollPosition() Returns if current scroll has a target position.","boolean isPreLayout()","void onViewIgnored(RecyclerView.ViewHolder holder)","void onViewRecycled(RecyclerView.ViewHolder holder)","void put(int resourceId, Object data) Adds a mapping from the specified id to the specified value, replacing the previous mapping from the specified key if there was one.","void remove(int resourceId) Removes the mapping from the specified id, if there was any.","String toString() Returns a string containing a concise, human-readable description of this object.","boolean willRunPredictiveAnimations() Returns whether RecyclerView will run predictive animations in this layout pass or not.","boolean willRunSimpleAnimations() Returns whether RecyclerView will run simple animations in this layout pass or not.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.widget","constants":[],"class":"RecyclerView.State","constructors":[],"fields":[]}