{"methods":["abstract boolean animateAdd(RecyclerView.ViewHolder holder) Called when an item is added to the RecyclerView.","abstract boolean animateChange(RecyclerView.ViewHolder oldHolder, RecyclerView.ViewHolder newHolder, int fromLeft, int fromTop, int toLeft, int toTop) Called when an item is changed in the RecyclerView, as indicated by a call to notifyItemChanged(int) or notifyItemRangeChanged(int, int).","abstract boolean animateMove(RecyclerView.ViewHolder holder, int fromX, int fromY, int toX, int toY) Called when an item is moved in the RecyclerView.","abstract boolean animateRemove(RecyclerView.ViewHolder holder) Called when an item is removed from the RecyclerView.","final void dispatchAddFinished(RecyclerView.ViewHolder item) Method to be called by subclasses when an add animation is done.","final void dispatchAddStarting(RecyclerView.ViewHolder item) Method to be called by subclasses when an add animation is being started.","final void dispatchAnimationsFinished() This method should be called by ItemAnimator implementations to notify any listeners that all pending and active item animations are finished.","final void dispatchChangeFinished(RecyclerView.ViewHolder item, boolean oldItem) Method to be called by subclasses when a change animation is done.","final void dispatchChangeStarting(RecyclerView.ViewHolder item, boolean oldItem) Method to be called by subclasses when a change animation is being started.","final void dispatchMoveFinished(RecyclerView.ViewHolder item) Method to be called by subclasses when a move animation is done.","final void dispatchMoveStarting(RecyclerView.ViewHolder item) Method to be called by subclasses when a move animation is being started.","final void dispatchRemoveFinished(RecyclerView.ViewHolder item) Method to be called by subclasses when a remove animation is done.","final void dispatchRemoveStarting(RecyclerView.ViewHolder item) Method to be called by subclasses when a remove animation is being started.","abstract void endAnimation(RecyclerView.ViewHolder item) Method called when an animation on a view should be ended immediately.","abstract void endAnimations() Method called when all item animations should be ended immediately.","long getAddDuration() Gets the current duration for which all add animations will run.","long getChangeDuration() Gets the current duration for which all change animations will run.","long getMoveDuration() Gets the current duration for which all move animations will run.","long getRemoveDuration() Gets the current duration for which all remove animations will run.","boolean getSupportsChangeAnimations() Returns whether this ItemAnimator supports animations of change events.","final boolean isRunning(RecyclerView.ItemAnimator.ItemAnimatorFinishedListener listener) Like isRunning(), this method returns whether there are any item animations currently running.","abstract boolean isRunning() Method which returns whether there are any item animations currently running.","void onAddFinished(RecyclerView.ViewHolder item) Called when an add animation has ended on the given ViewHolder.","void onAddStarting(RecyclerView.ViewHolder item) Called when an add animation is being started on the given ViewHolder.","void onChangeFinished(RecyclerView.ViewHolder item, boolean oldItem) Called when a change animation has ended on the given ViewHolder.","void onChangeStarting(RecyclerView.ViewHolder item, boolean oldItem) Called when a change animation is being started on the given ViewHolder.","void onMoveFinished(RecyclerView.ViewHolder item) Called when a move animation has ended on the given ViewHolder.","void onMoveStarting(RecyclerView.ViewHolder item) Called when a move animation is being started on the given ViewHolder.","void onRemoveFinished(RecyclerView.ViewHolder item) Called when a remove animation has ended on the given ViewHolder.","void onRemoveStarting(RecyclerView.ViewHolder item) Called when a remove animation is being started on the given ViewHolder.","abstract void runPendingAnimations() Called when there are pending animations waiting to be started.","void setAddDuration(long addDuration) Sets the duration for which all add animations will run.","void setChangeDuration(long changeDuration) Sets the duration for which all change animations will run.","void setMoveDuration(long moveDuration) Sets the duration for which all move animations will run.","void setRemoveDuration(long removeDuration) Sets the duration for which all remove animations will run.","void setSupportsChangeAnimations(boolean supportsChangeAnimations) Sets whether this ItemAnimator supports animations of item change events.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v7.widget","constants":[],"class":"RecyclerView.ItemAnimator","constructors":[],"fields":[]}