{"methods":["final int getQueueLength() Returns an estimate of the number of threads waiting to acquire either the read or write lock.","int getReadHoldCount() Queries the number of reentrant read holds on this lock by the current thread.","int getReadLockCount() Queries the number of read locks held for this lock.","int getWaitQueueLength(Condition condition) Returns an estimate of the number of threads waiting on the given condition associated with the write lock.","int getWriteHoldCount() Queries the number of reentrant write holds on this lock by the current thread.","final boolean hasQueuedThread(Thread thread) Queries whether the given thread is waiting to acquire either the read or write lock.","final boolean hasQueuedThreads() Queries whether any threads are waiting to acquire the read or write lock.","boolean hasWaiters(Condition condition) Queries whether any threads are waiting on the given condition associated with the write lock.","final boolean isFair() Returns true if this lock has fairness set true.","boolean isWriteLocked() Queries if the write lock is held by any thread.","boolean isWriteLockedByCurrentThread() Queries if the write lock is held by the current thread.","ReentrantReadWriteLock.ReadLock readLock() Returns the lock used for reading.","String toString() Returns a string identifying this lock, as well as its lock state.","ReentrantReadWriteLock.WriteLock writeLock() Returns the lock used for writing.","Thread getOwner() Returns the thread that currently owns the write lock, or null if not owned.","Collection<Thread> getQueuedReaderThreads() Returns a collection containing threads that may be waiting to acquire the read lock.","Collection<Thread> getQueuedThreads() Returns a collection containing threads that may be waiting to acquire either the read or write lock.","Collection<Thread> getQueuedWriterThreads() Returns a collection containing threads that may be waiting to acquire the write lock.","Collection<Thread> getWaitingThreads(Condition condition) Returns a collection containing those threads that may be waiting on the given condition associated with the write lock.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.concurrent.locks.ReadWriteLock abstract Lock readLock() Returns the lock used for reading. abstract Lock writeLock() Returns the lock used for writing.","abstract Lock readLock() Returns the lock used for reading.","abstract Lock writeLock() Returns the lock used for writing."],"package":"java.util.concurrent.locks","constants":[],"class":"ReentrantReadWriteLock","constructors":[],"fields":[]}