{"methods":["boolean contains(int x, int y) Return true if the region contains the specified point","int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object obj) Compares this instance with the specified object and indicates if they are equal.","Path getBoundaryPath() Return the boundary of the region as a new Path.","boolean getBoundaryPath(Path path) Set the path to the boundary of the region.","boolean getBounds(Rect r) Set the Rect to the bounds of the region.","Rect getBounds() Return a new Rect set to the bounds of the region.","boolean isComplex() Return true if the region contains more than one rectangle","boolean isEmpty() Return true if this region is empty","boolean isRect() Return true if the region contains a single rectangle","boolean op(Rect r, Region.Op op) Perform the specified Op on this region and the specified rect.","boolean op(int left, int top, int right, int bottom, Region.Op op) Perform the specified Op on this region and the specified rect.","boolean op(Region region, Region.Op op) Perform the specified Op on this region and the specified region.","boolean op(Rect rect, Region region, Region.Op op) Set this region to the result of performing the Op on the specified rect and region.","boolean op(Region region1, Region region2, Region.Op op) Set this region to the result of performing the Op on the specified regions.","boolean quickContains(int left, int top, int right, int bottom) Return true if the region is a single rectangle (not complex) and it contains the specified rectangle.","boolean quickContains(Rect r) Return true if the region is a single rectangle (not complex) and it contains the specified rectangle.","boolean quickReject(int left, int top, int right, int bottom) Return true if the region is empty, or if the specified rectangle does not intersect the region.","boolean quickReject(Region rgn) Return true if the region is empty, or if the specified region does not intersect the region.","boolean quickReject(Rect r) Return true if the region is empty, or if the specified rectangle does not intersect the region.","boolean set(int left, int top, int right, int bottom) Set the region to the specified rectangle","boolean set(Rect r) Set the region to the specified rectangle","boolean set(Region region) Set the region to the specified region.","void setEmpty() Set the region to the empty region","boolean setPath(Path path, Region clip) Set the region to the area described by the path and clip.","String toString() Returns a string containing a concise, human-readable description of this object.","void translate(int dx, int dy, Region dst) Set the dst region to the result of translating this region by [dx, dy].","void translate(int dx, int dy) Translate the region by [dx, dy].","final boolean union(Rect r)","void writeToParcel(Parcel p, int flags) Write the region and its pixels to the parcel.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.graphics","constants":["[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"Region","constructors":[],"fields":["public static final Creator<Region> CREATOR"]}