{"methods":["static void addResultsToIntent(RemoteInput[] remoteInputs, Intent intent, Bundle results) Populate an intent object with the results gathered from remote input.","boolean getAllowFreeFormInput() Get whether or not users can provide an arbitrary value for input.","CharSequence[] getChoices() Get possible input choices.","Bundle getExtras() Get additional metadata carried around with this remote input.","CharSequence getLabel() Get the label to display to users when collecting this input.","String getResultKey() Get the key that the result of this input will be set in from the Bundle returned by getResultsFromIntent(Intent) when the PendingIntent is sent.","static Bundle getResultsFromIntent(Intent intent) Get the remote input results bundle from an intent.","[Expand] Inherited Methods","From class android.support.v4.app.RemoteInputCompatBase.RemoteInput abstract boolean getAllowFreeFormInput() abstract CharSequence[] getChoices() abstract Bundle getExtras() abstract CharSequence getLabel() abstract String getResultKey()","abstract boolean getAllowFreeFormInput()","abstract CharSequence[] getChoices()","abstract Bundle getExtras()","abstract CharSequence getLabel()","abstract String getResultKey()","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":["String EXTRA_RESULTS_DATA Extra added to a clip data intent object to hold the results bundle.","String RESULTS_CLIP_LABEL Label used to denote the clip data type used for remote input transport"],"class":"RemoteInput","constructors":[],"fields":[]}