{"methods":["List<Locale> getCandidateLocales(String baseName, Locale locale) Returns a list of candidate locales according to baseName in locale.","static ResourceBundle.Control getControl(List<String> formats) Returns a control according to formats.","Locale getFallbackLocale(String baseName, Locale locale) Returns the fallback locale for baseName in locale.","List<String> getFormats(String baseName) Returns a list of strings of formats according to baseName.","static ResourceBundle.Control getNoFallbackControl(List<String> formats) Returns a control according to formats whose fallback locale is null.","long getTimeToLive(String baseName, Locale locale) Returns the time to live of the ResourceBundle baseName in locale, default is TTL_NO_EXPIRATION_CONTROL.","boolean needsReload(String baseName, Locale locale, String format, ClassLoader loader, ResourceBundle bundle, long loadTime) Returns true if the ResourceBundle needs to reload.","ResourceBundle newBundle(String baseName, Locale locale, String format, ClassLoader loader, boolean reload) Returns a new ResourceBundle.","String toBundleName(String baseName, Locale locale) a utility method to answer the name of a resource bundle according to the given base name and locale","final String toResourceName(String bundleName, String suffix) a utility method to answer the name of a resource according to the given bundleName and suffix","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util","constants":["long TTL_DONT_CACHE a constant that indicates cache will not be used.","long TTL_NO_EXPIRATION_CONTROL a constant that indicates cache will not be expired."],"class":"ResourceBundle.Control","constructors":[],"fields":["public static final List<String> FORMAT_CLASS a list defines java class format","public static final List<String> FORMAT_DEFAULT a list defines default format","public static final List<String> FORMAT_PROPERTIES a list defines property format"]}