{"methods":["Intent createLocalApprovalIntent()","Bundle getApplicationRestrictions() Returns any available set of application-specific restrictions applicable to this application.","List<RestrictionEntry> getManifestRestrictions(String packageName) Parse and return the list of restrictions defined in the manifest for the specified package, if any.","boolean hasRestrictionsProvider() Called by an application to check if there is an active Restrictions Provider.","void notifyPermissionResponse(String packageName, PersistableBundle response) Called by the Restrictions Provider to deliver a response to an application.","void requestPermission(String requestType, String requestId, PersistableBundle request) Called by an application to request permission for an operation.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.content","constants":["String ACTION_PERMISSION_RESPONSE_RECEIVED Broadcast intent delivered when a response is received for a permission request.","String ACTION_REQUEST_LOCAL_APPROVAL Activity intent that is optionally implemented by the Restrictions Provider package to challenge for an administrator PIN or password locally on the device.","String ACTION_REQUEST_PERMISSION Broadcast intent sent to the Restrictions Provider to handle a permission request from an app.","String EXTRA_PACKAGE_NAME The package name of the application making the request.","String EXTRA_REQUEST_BUNDLE The request bundle passed in the ACTION_REQUEST_PERMISSION broadcast.","String EXTRA_REQUEST_ID The request ID passed in the ACTION_REQUEST_PERMISSION broadcast.","String EXTRA_REQUEST_TYPE The request type passed in the ACTION_REQUEST_PERMISSION broadcast.","String EXTRA_RESPONSE_BUNDLE Contains a response from the administrator for specific request.","String META_DATA_APP_RESTRICTIONS Name of the meta-data entry in the manifest that points to the XML file containing the application's available restrictions.","String REQUEST_KEY_APPROVE_LABEL Key for request approval button label contained in the request bundle.","String REQUEST_KEY_DATA Key for request data contained in the request bundle.","String REQUEST_KEY_DENY_LABEL Key for request rejection button label contained in the request bundle.","String REQUEST_KEY_ICON Key for request icon contained in the request bundle.","String REQUEST_KEY_ID Key for request ID contained in the request bundle.","String REQUEST_KEY_MESSAGE Key for request message contained in the request bundle.","String REQUEST_KEY_NEW_REQUEST Key for issuing a new request, contained in the request bundle.","String REQUEST_KEY_TITLE Key for request title contained in the request bundle.","String REQUEST_TYPE_APPROVAL Request type for a simple question, with a possible title and icon.","String RESPONSE_KEY_ERROR_CODE Key for the optional error code in the response bundle sent to the application.","String RESPONSE_KEY_MESSAGE Key for the optional message in the response bundle sent to the application.","String RESPONSE_KEY_RESPONSE_TIMESTAMP Key for the optional timestamp of when the administrator responded to the permission request.","String RESPONSE_KEY_RESULT Key for the response result in the response bundle sent to the application, for a permission request.","int RESULT_APPROVED Response result value indicating that the request was approved.","int RESULT_DENIED Response result value indicating that the request was denied.","int RESULT_ERROR Response result value indicating an error condition.","int RESULT_ERROR_BAD_REQUEST Error code indicating that there was a problem with the request.","int RESULT_ERROR_INTERNAL Error code indicating that there was an internal error.","int RESULT_ERROR_NETWORK Error code indicating that there was a problem with the network.","int RESULT_NO_RESPONSE Response result value indicating that the request has not received a response yet.","int RESULT_UNKNOWN_REQUEST Response result value indicating that the request is unknown, when it's not a new request."],"class":"RestrictionsManager","constructors":[],"fields":[]}