{"methods":["int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","String[] getAllSelectedStrings() Returns the list of currently selected values.","String[] getChoiceEntries() Returns the list of strings, set earlier, that will be presented as choices to the user.","String[] getChoiceValues() Returns the list of possible string values set earlier.","String getDescription() Returns the provided user-visible description of the entry, if any.","int getIntValue() Returns the value of the entry as an integer when the type is TYPE_INTEGER.","String getKey() This is the unique key for the restriction entry.","boolean getSelectedState() Returns the current selected state for an entry of type TYPE_BOOLEAN.","String getSelectedString() Returns the currently selected string value.","String getTitle() Returns the user-visible title for the entry, if any.","int getType() Returns the type for this restriction.","int hashCode() Returns an integer hash code for this object.","void setAllSelectedStrings(String[] allSelectedStrings) Sets the current list of selected values for an entry of type TYPE_MULTI_SELECT.","void setChoiceEntries(String[] choiceEntries) Sets a list of strings that will be presented as choices to the user.","void setChoiceEntries(Context context, int stringArrayResId) Sets a list of strings that will be presented as choices to the user.","void setChoiceValues(String[] choiceValues) Sets a list of string values that can be selected by the user.","void setChoiceValues(Context context, int stringArrayResId) Sets a list of string values that can be selected by the user, similar to setChoiceValues(String[]).","void setDescription(String description) Sets the user-visible description of the entry, as a possible sub-text for the title.","void setIntValue(int value) Sets the integer value of the entry when the type is TYPE_INTEGER.","void setSelectedState(boolean state) Sets the current selected state for an entry of type TYPE_BOOLEAN.","void setSelectedString(String selectedString) Sets the string value to use as the selected value for this restriction.","void setTitle(String title) Sets the user-visible title for the entry.","void setType(int type) Sets the type for this restriction.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.content","constants":["int TYPE_BOOLEAN A type of restriction.","int TYPE_CHOICE A type of restriction.","int TYPE_INTEGER A type of restriction.","int TYPE_MULTI_SELECT A type of restriction.","int TYPE_NULL A type of restriction.","int TYPE_STRING A type of restriction.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"RestrictionEntry","constructors":[],"fields":["public static final Creator<RestrictionEntry> CREATOR"]}