{"methods":["ContentHandler getContentHandler() Gets the SAX ContentHandler.","[Expand] Inherited Methods","From class android.sax.Element Element getChild(String uri, String localName) Gets the child element with the given name. Element getChild(String localName) Gets the child element with the given name. Element requireChild(String localName) Gets the child element with the given name. Element requireChild(String uri, String localName) Gets the child element with the given name. void setElementListener(ElementListener elementListener) Sets start and end element listeners at the same time. void setEndElementListener(EndElementListener endElementListener) Sets a listener for the end of this element. void setEndTextElementListener(EndTextElementListener endTextElementListener) Sets a listener for the end of this text element. void setStartElementListener(StartElementListener startElementListener) Sets a listener for the start of this element. void setTextElementListener(TextElementListener elementListener) Sets start and end text element listeners at the same time. String toString() Returns a string containing a concise, human-readable description of this object.","Element getChild(String uri, String localName) Gets the child element with the given name.","Element getChild(String localName) Gets the child element with the given name.","Element requireChild(String localName) Gets the child element with the given name.","Element requireChild(String uri, String localName) Gets the child element with the given name.","void setElementListener(ElementListener elementListener) Sets start and end element listeners at the same time.","void setEndElementListener(EndElementListener endElementListener) Sets a listener for the end of this element.","void setEndTextElementListener(EndTextElementListener endTextElementListener) Sets a listener for the end of this text element.","void setStartElementListener(StartElementListener startElementListener) Sets a listener for the start of this element.","void setTextElementListener(TextElementListener elementListener) Sets start and end text element listeners at the same time.","String toString() Returns a string containing a concise, human-readable description of this object.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.sax","constants":[],"class":"RootElement","constructors":[],"fields":[]}