{"methods":["BasicPoolEntry allocEntry(Object state) Obtains a free entry from this pool, if one is available.","void createdEntry(BasicPoolEntry entry) Indicates creation of an entry for this pool.","boolean deleteEntry(BasicPoolEntry entry) Deletes an entry from this pool.","void dropEntry() Forgets about an entry from this pool.","void freeEntry(BasicPoolEntry entry) Returns an allocated entry to this pool.","int getCapacity() Return remaining capacity of this pool","final int getEntryCount() Obtains the number of entries.","final int getMaxEntries() Obtains the maximum number of entries allowed for this pool.","final HttpRoute getRoute() Obtains the route for which this pool is specific.","boolean hasThread() Checks whether there is a waiting thread in this pool.","boolean isUnused() Indicates whether this pool is unused.","WaitingThread nextThread() Returns the next thread in the queue.","void queueThread(WaitingThread wt) Adds a waiting thread.","void removeThread(WaitingThread wt) Removes a waiting thread, if it is queued.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http.impl.conn.tsccm","constants":[],"class":"RouteSpecificPool","constructors":[],"fields":["protected final LinkedList<BasicPoolEntry> freeEntries The list of free entries.","protected final int maxEntries the maximum number of entries allowed for this pool","protected int numEntries The number of created entries.","protected final HttpRoute route The route this pool is for.","protected final Queue<WaitingThread> waitingThreads The list of threads waiting for this pool."]}