{"methods":["boolean canDrawOutOfBounds() Return true if the Row view can draw outside its bounds.","void freeze(RowPresenter.ViewHolder holder, boolean freeze) Freeze/Unfreeze the row, typically used when transition starts/ends.","final RowHeaderPresenter getHeaderPresenter() Get the Presenter used for rendering the header, or null if none has been set.","final OnItemClickedListener getOnItemClickedListener() Get the listener for item click events.","final OnItemSelectedListener getOnItemSelectedListener() Get the listener for item or row selection.","final OnItemViewClickedListener getOnItemViewClickedListener() Set listener for item click event.","final OnItemViewSelectedListener getOnItemViewSelectedListener() Get listener for item or row selection.","final RowPresenter.ViewHolder getRowViewHolder(Presenter.ViewHolder holder) Get the RowPresenter.ViewHolder from the given Presenter ViewHolder.","final boolean getSelectEffectEnabled() Returns true if the row selection effect is enabled.","final float getSelectLevel(Presenter.ViewHolder vh) Get the current select level.","boolean isUsingDefaultSelectEffect() Return whether this RowPresenter is using the default dimming effect provided by the library.","final void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item.","final Presenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View.","final void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item.","final void onViewAttachedToWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been attached to a window.","final void onViewDetachedFromWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been detached from its window.","final void setHeaderPresenter(RowHeaderPresenter headerPresenter) Set the Presenter used for rendering the header.","final void setOnItemClickedListener(OnItemClickedListener listener) Set the listener for item click events.","final void setOnItemSelectedListener(OnItemSelectedListener listener) Set the listener for item or row selection.","final void setOnItemViewClickedListener(OnItemViewClickedListener listener) Set listener for item click event.","final void setOnItemViewSelectedListener(OnItemViewSelectedListener listener) Set listener for item or row selection.","final void setRowViewExpanded(Presenter.ViewHolder holder, boolean expanded) Set the expanded state of a Row view.","final void setRowViewSelected(Presenter.ViewHolder holder, boolean selected) Set the selected state of a Row view.","final void setSelectEffectEnabled(boolean applyDimOnSelect) Enables or disables the row selection effect.","final void setSelectLevel(Presenter.ViewHolder vh, float level) Set the current select level to a value between 0 (unselected) and 1 (selected).","abstract RowPresenter.ViewHolder createRowViewHolder(ViewGroup parent) Called to create a ViewHolder object for a Row.","void initializeRowViewHolder(RowPresenter.ViewHolder vh) Called after a RowPresenter.ViewHolder is created for a Row.","void onBindRowViewHolder(RowPresenter.ViewHolder vh, Object item)","void onRowViewAttachedToWindow(RowPresenter.ViewHolder vh)","void onRowViewDetachedFromWindow(RowPresenter.ViewHolder vh)","void onRowViewExpanded(RowPresenter.ViewHolder vh, boolean expanded) Subclass may override this to respond to expanded state changes of a Row.","void onRowViewSelected(RowPresenter.ViewHolder vh, boolean selected) Subclass may override this to respond to selected state changes of a Row.","void onSelectLevelChanged(RowPresenter.ViewHolder vh) Callback when select level is changed.","void onUnbindRowViewHolder(RowPresenter.ViewHolder vh)","[Expand] Inherited Methods","From class android.support.v17.leanback.widget.Presenter static void cancelAnimationsRecursive(View view) Utility method for removing all running animations on a view. abstract void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item. abstract Presenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View. abstract void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item. void onViewAttachedToWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been attached to a window. void onViewDetachedFromWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been detached from its window. void setOnClickListener(Presenter.ViewHolder holder, View.OnClickListener listener) Called to set a click listener for the given view holder.","static void cancelAnimationsRecursive(View view) Utility method for removing all running animations on a view.","abstract void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item.","abstract Presenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View.","abstract void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item.","void onViewAttachedToWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been attached to a window.","void onViewDetachedFromWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been detached from its window.","void setOnClickListener(Presenter.ViewHolder holder, View.OnClickListener listener) Called to set a click listener for the given view holder.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v17.leanback.widget","constants":[],"class":"RowPresenter","constructors":[],"fields":[]}