{"methods":["Object clone() Returns a new collator with the same collation rules, decomposition mode and strength value as this collator.","int compare(String source, String target) Compares the source text to the target text according to the collation rules, strength and decomposition mode for this RuleBasedCollator.","boolean equals(Object obj) Compares the specified object with this RuleBasedCollator and indicates if they are equal.","CollationElementIterator getCollationElementIterator(String source) Obtains a CollationElementIterator for the given string.","CollationElementIterator getCollationElementIterator(CharacterIterator source) Obtains a CollationElementIterator for the given CharacterIterator.","CollationKey getCollationKey(String source) Returns the CollationKey for the given source text.","String getRules() Returns the collation rules of this collator.","int hashCode() Returns an integer hash code for this object.","[Expand] Inherited Methods","From class java.text.Collator Object clone() Returns a new collator with the same decomposition mode and strength value as this collator. abstract int compare(String string1, String string2) Compares two strings to determine their relative order. int compare(Object object1, Object object2) Compares two objects to determine their relative order. boolean equals(Object object) Compares this collator with the specified object and indicates if they are equal. boolean equals(String string1, String string2) Compares two strings using the collation rules to determine if they are equal. static Locale[] getAvailableLocales() Returns an array of locales for which custom Collator instances are available. abstract CollationKey getCollationKey(String string) Returns a CollationKey for the specified string for this collator with the current decomposition rule and strength value. int getDecomposition() Returns the decomposition rule for this collator. static Collator getInstance() Returns a Collator instance which is appropriate for the user's default Locale. static Collator getInstance(Locale locale) Returns a Collator instance which is appropriate for locale. int getStrength() Returns the strength value for this collator. abstract int hashCode() Returns an integer hash code for this object. void setDecomposition(int value) Sets the decomposition rule for this collator. void setStrength(int value) Sets the strength value for this collator.","Object clone() Returns a new collator with the same decomposition mode and strength value as this collator.","abstract int compare(String string1, String string2) Compares two strings to determine their relative order.","int compare(Object object1, Object object2) Compares two objects to determine their relative order.","boolean equals(Object object) Compares this collator with the specified object and indicates if they are equal.","boolean equals(String string1, String string2) Compares two strings using the collation rules to determine if they are equal.","static Locale[] getAvailableLocales() Returns an array of locales for which custom Collator instances are available.","abstract CollationKey getCollationKey(String string) Returns a CollationKey for the specified string for this collator with the current decomposition rule and strength value.","int getDecomposition() Returns the decomposition rule for this collator.","static Collator getInstance() Returns a Collator instance which is appropriate for the user's default Locale.","static Collator getInstance(Locale locale) Returns a Collator instance which is appropriate for locale.","int getStrength() Returns the strength value for this collator.","abstract int hashCode() Returns an integer hash code for this object.","void setDecomposition(int value) Sets the decomposition rule for this collator.","void setStrength(int value) Sets the strength value for this collator.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.Comparator abstract int compare(T lhs, T rhs) Compares the two specified objects to determine their relative ordering. abstract boolean equals(Object object) Compares this Comparator with the specified Object and indicates whether they are equal.","abstract int compare(T lhs, T rhs) Compares the two specified objects to determine their relative ordering.","abstract boolean equals(Object object) Compares this Comparator with the specified Object and indicates whether they are equal."],"package":"java.text","constants":["[Expand] Inherited Constants","From class java.text.Collator int CANONICAL_DECOMPOSITION Constant used to specify the decomposition rule. int FULL_DECOMPOSITION Constant used to specify the decomposition rule. int IDENTICAL Constant used to specify the collation strength. int NO_DECOMPOSITION Constant used to specify the decomposition rule. int PRIMARY Constant used to specify the collation strength. int SECONDARY Constant used to specify the collation strength. int TERTIARY Constant used to specify the collation strength.","int CANONICAL_DECOMPOSITION Constant used to specify the decomposition rule.","int FULL_DECOMPOSITION Constant used to specify the decomposition rule.","int IDENTICAL Constant used to specify the collation strength.","int NO_DECOMPOSITION Constant used to specify the decomposition rule.","int PRIMARY Constant used to specify the collation strength.","int SECONDARY Constant used to specify the collation strength.","int TERTIARY Constant used to specify the collation strength."],"class":"RuleBasedCollator","constructors":[],"fields":[]}