{"methods":["void addShutdownHook(Thread hook) Registers a VM shutdown hook.","int availableProcessors() Returns the number of processor cores available to the VM, at least 1.","Process exec(String[] progArray, String[] envp) Executes the specified command and its arguments in a separate native process.","Process exec(String prog, String[] envp, File directory) Executes the specified program in a separate native process.","Process exec(String[] progArray, String[] envp, File directory) Executes the specified command and its arguments in a separate native process.","Process exec(String prog, String[] envp) Executes the specified program in a separate native process.","Process exec(String prog) Executes the specified program in a separate native process.","Process exec(String[] progArray) Executes the specified command and its arguments in a separate native process.","void exit(int code) Causes the VM to stop running and the program to exit.","long freeMemory() Returns the number of bytes currently available on the heap without expanding the heap.","void gc() Indicates to the VM that it would be a good time to run the garbage collector.","InputStream getLocalizedInputStream(InputStream stream) This method was deprecated in API level 1. Use InputStreamReader instead.","OutputStream getLocalizedOutputStream(OutputStream stream) This method was deprecated in API level 1. Use OutputStreamWriter instead.","static Runtime getRuntime() Returns the single Runtime instance for the current application.","void halt(int code) Causes the VM to stop running, and the program to exit with the given return code.","void load(String absolutePath) Loads the shared library found at the given absolute path.","void loadLibrary(String nickname) Loads a shared library.","long maxMemory() Returns the maximum number of bytes the heap can expand to.","boolean removeShutdownHook(Thread hook) Unregisters a previously registered VM shutdown hook.","void runFinalization() Provides a hint to the VM that it would be useful to attempt to perform any outstanding object finalization.","static void runFinalizersOnExit(boolean run) This method was deprecated in API level 1. This method is unsafe.","long totalMemory() Returns the number of bytes taken by the heap at its current size.","void traceInstructions(boolean enable) Switches the output of debug information for instructions on or off.","void traceMethodCalls(boolean enable) Switches the output of debug information for methods on or off.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.lang","constants":[],"class":"Runtime","constructors":[],"fields":[]}