{"methods":["abstract Parser getParser() Returns the SAX parser that is encapsulated by the implementation of this class.","abstract Object getProperty(String name) Returns the particular property requested for in the underlying implementation of XMLReader.","Schema getSchema() Get a reference to the the Schema being used by the XML processor.","abstract XMLReader getXMLReader() Returns the XMLReader that is encapsulated by the implementation of this class.","abstract boolean isNamespaceAware() Indicates whether or not this parser is configured to understand namespaces.","abstract boolean isValidating() Indicates whether or not this parser is configured to validate XML documents.","boolean isXIncludeAware() Get the XInclude processing mode for this parser.","void parse(InputStream is, HandlerBase hb, String systemId) Parse the content of the given InputStream instance as XML using the specified HandlerBase.","void parse(InputSource is, DefaultHandler dh) Parse the content given InputSource as XML using the specified DefaultHandler.","void parse(String uri, HandlerBase hb) Parse the content described by the giving Uniform Resource Identifier (URI) as XML using the specified HandlerBase.","void parse(String uri, DefaultHandler dh) Parse the content described by the giving Uniform Resource Identifier (URI) as XML using the specified DefaultHandler.","void parse(File f, DefaultHandler dh) Parse the content of the file specified as XML using the specified DefaultHandler.","void parse(InputStream is, DefaultHandler dh) Parse the content of the given InputStream instance as XML using the specified DefaultHandler.","void parse(InputStream is, DefaultHandler dh, String systemId) Parse the content of the given InputStream instance as XML using the specified DefaultHandler.","void parse(InputSource is, HandlerBase hb) Parse the content given InputSource as XML using the specified HandlerBase.","void parse(InputStream is, HandlerBase hb) Parse the content of the given InputStream instance as XML using the specified HandlerBase.","void parse(File f, HandlerBase hb) Parse the content of the file specified as XML using the specified HandlerBase.","void reset() Reset this SAXParser to its original configuration.","abstract void setProperty(String name, Object value) Sets the particular property in the underlying implementation of XMLReader.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.parsers","constants":[],"class":"SAXParser","constructors":[],"fields":[]}