{"methods":["float getCurrentSpan() Return the average distance between each of the pointers forming the gesture in progress through the focal point.","float getCurrentSpanX() Return the average X distance between each of the pointers forming the gesture in progress through the focal point.","float getCurrentSpanY() Return the average Y distance between each of the pointers forming the gesture in progress through the focal point.","long getEventTime() Return the event time of the current event being processed.","float getFocusX() Get the X coordinate of the current gesture's focal point.","float getFocusY() Get the Y coordinate of the current gesture's focal point.","float getPreviousSpan() Return the previous average distance between each of the pointers forming the gesture in progress through the focal point.","float getPreviousSpanX() Return the previous average X distance between each of the pointers forming the gesture in progress through the focal point.","float getPreviousSpanY() Return the previous average Y distance between each of the pointers forming the gesture in progress through the focal point.","float getScaleFactor() Return the scaling factor from the previous scale event to the current event.","long getTimeDelta() Return the time difference in milliseconds between the previous accepted scaling event and the current scaling event.","boolean isInProgress() Returns true if a scale gesture is in progress.","boolean isQuickScaleEnabled() Return whether the quick scale gesture, in which the user performs a double tap followed by a swipe, should perform scaling.","boolean onTouchEvent(MotionEvent event) Accepts MotionEvents and dispatches events to a ScaleGestureDetector.OnScaleGestureListener when appropriate.","void setQuickScaleEnabled(boolean scales) Set whether the associated ScaleGestureDetector.OnScaleGestureListener should receive onScale callbacks when the user performs a doubleTap followed by a swipe.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"ScaleGestureDetector","constructors":[],"fields":[]}