{"methods":["void execute(Runnable command) Executes command with zero required delay.","boolean getContinueExistingPeriodicTasksAfterShutdownPolicy() Gets the policy on whether to continue executing existing periodic tasks even when this executor has been shutdown.","boolean getExecuteExistingDelayedTasksAfterShutdownPolicy() Gets the policy on whether to execute existing delayed tasks even when this executor has been shutdown.","BlockingQueue<Runnable> getQueue() Returns the task queue used by this executor.","boolean getRemoveOnCancelPolicy() Gets the policy on whether cancelled tasks should be immediately removed from the work queue at time of cancellation.","ScheduledFuture<?> schedule(Runnable command, long delay, TimeUnit unit) Creates and executes a one-shot action that becomes enabled after the given delay.","<V> ScheduledFuture<V> schedule(Callable<V> callable, long delay, TimeUnit unit) Creates and executes a ScheduledFuture that becomes enabled after the given delay.","ScheduledFuture<?> scheduleAtFixedRate(Runnable command, long initialDelay, long period, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given period; that is executions will commence after initialDelay then initialDelay+period, then initialDelay + 2 * period, and so on.","ScheduledFuture<?> scheduleWithFixedDelay(Runnable command, long initialDelay, long delay, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given delay between the termination of one execution and the commencement of the next.","void setContinueExistingPeriodicTasksAfterShutdownPolicy(boolean value) Sets the policy on whether to continue executing existing periodic tasks even when this executor has been shutdown.","void setExecuteExistingDelayedTasksAfterShutdownPolicy(boolean value) Sets the policy on whether to execute existing delayed tasks even when this executor has been shutdown.","void setRemoveOnCancelPolicy(boolean value) Sets the policy on whether cancelled tasks should be immediately removed from the work queue at time of cancellation.","void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.","List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution.","<T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","<T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","<V> RunnableScheduledFuture<V> decorateTask(Runnable runnable, RunnableScheduledFuture<V> task) Modifies or replaces the task used to execute a runnable.","<V> RunnableScheduledFuture<V> decorateTask(Callable<V> callable, RunnableScheduledFuture<V> task) Modifies or replaces the task used to execute a callable.","[Expand] Inherited Methods","From class java.util.concurrent.ThreadPoolExecutor void afterExecute(Runnable r, Throwable t) Method invoked upon completion of execution of the given Runnable. void allowCoreThreadTimeOut(boolean value) Sets the policy governing whether core threads may time out and terminate if no tasks arrive within the keep-alive time, being replaced if needed when new tasks arrive. boolean allowsCoreThreadTimeOut() Returns true if this pool allows core threads to time out and terminate if no tasks arrive within the keepAlive time, being replaced if needed when new tasks arrive. boolean awaitTermination(long timeout, TimeUnit unit) void beforeExecute(Thread t, Runnable r) Method invoked prior to executing the given Runnable in the given thread. void execute(Runnable command) Executes the given task sometime in the future. void finalize() Invokes shutdown when this executor is no longer referenced and it has no threads. int getActiveCount() Returns the approximate number of threads that are actively executing tasks. long getCompletedTaskCount() Returns the approximate total number of tasks that have completed execution. int getCorePoolSize() Returns the core number of threads. long getKeepAliveTime(TimeUnit unit) Returns the thread keep-alive time, which is the amount of time that threads in excess of the core pool size may remain idle before being terminated. int getLargestPoolSize() Returns the largest number of threads that have ever simultaneously been in the pool. int getMaximumPoolSize() Returns the maximum allowed number of threads. int getPoolSize() Returns the current number of threads in the pool. BlockingQueue<Runnable> getQueue() Returns the task queue used by this executor. RejectedExecutionHandler getRejectedExecutionHandler() Returns the current handler for unexecutable tasks. long getTaskCount() Returns the approximate total number of tasks that have ever been scheduled for execution. ThreadFactory getThreadFactory() Returns the thread factory used to create new threads. boolean isShutdown() boolean isTerminated() boolean isTerminating() Returns true if this executor is in the process of terminating after shutdown() or shutdownNow() but has not completely terminated. int prestartAllCoreThreads() Starts all core threads, causing them to idly wait for work. boolean prestartCoreThread() Starts a core thread, causing it to idly wait for work. void purge() Tries to remove from the work queue all Future tasks that have been cancelled. boolean remove(Runnable task) Removes this task from the executor's internal queue if it is present, thus causing it not to be run if it has not already started. void setCorePoolSize(int corePoolSize) Sets the core number of threads. void setKeepAliveTime(long time, TimeUnit unit) Sets the time limit for which threads may remain idle before being terminated. void setMaximumPoolSize(int maximumPoolSize) Sets the maximum allowed number of threads. void setRejectedExecutionHandler(RejectedExecutionHandler handler) Sets a new handler for unexecutable tasks. void setThreadFactory(ThreadFactory threadFactory) Sets the thread factory used to create new threads. void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted. List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution. void terminated() Method invoked when the Executor has terminated. String toString() Returns a string identifying this pool, as well as its state, including indications of run state and estimated worker and task counts.","void afterExecute(Runnable r, Throwable t) Method invoked upon completion of execution of the given Runnable.","void allowCoreThreadTimeOut(boolean value) Sets the policy governing whether core threads may time out and terminate if no tasks arrive within the keep-alive time, being replaced if needed when new tasks arrive.","boolean allowsCoreThreadTimeOut() Returns true if this pool allows core threads to time out and terminate if no tasks arrive within the keepAlive time, being replaced if needed when new tasks arrive.","boolean awaitTermination(long timeout, TimeUnit unit)","void beforeExecute(Thread t, Runnable r) Method invoked prior to executing the given Runnable in the given thread.","void execute(Runnable command) Executes the given task sometime in the future.","void finalize() Invokes shutdown when this executor is no longer referenced and it has no threads.","int getActiveCount() Returns the approximate number of threads that are actively executing tasks.","long getCompletedTaskCount() Returns the approximate total number of tasks that have completed execution.","int getCorePoolSize() Returns the core number of threads.","long getKeepAliveTime(TimeUnit unit) Returns the thread keep-alive time, which is the amount of time that threads in excess of the core pool size may remain idle before being terminated.","int getLargestPoolSize() Returns the largest number of threads that have ever simultaneously been in the pool.","int getMaximumPoolSize() Returns the maximum allowed number of threads.","int getPoolSize() Returns the current number of threads in the pool.","BlockingQueue<Runnable> getQueue() Returns the task queue used by this executor.","RejectedExecutionHandler getRejectedExecutionHandler() Returns the current handler for unexecutable tasks.","long getTaskCount() Returns the approximate total number of tasks that have ever been scheduled for execution.","ThreadFactory getThreadFactory() Returns the thread factory used to create new threads.","boolean isShutdown()","boolean isTerminated()","boolean isTerminating() Returns true if this executor is in the process of terminating after shutdown() or shutdownNow() but has not completely terminated.","int prestartAllCoreThreads() Starts all core threads, causing them to idly wait for work.","boolean prestartCoreThread() Starts a core thread, causing it to idly wait for work.","void purge() Tries to remove from the work queue all Future tasks that have been cancelled.","boolean remove(Runnable task) Removes this task from the executor's internal queue if it is present, thus causing it not to be run if it has not already started.","void setCorePoolSize(int corePoolSize) Sets the core number of threads.","void setKeepAliveTime(long time, TimeUnit unit) Sets the time limit for which threads may remain idle before being terminated.","void setMaximumPoolSize(int maximumPoolSize) Sets the maximum allowed number of threads.","void setRejectedExecutionHandler(RejectedExecutionHandler handler) Sets a new handler for unexecutable tasks.","void setThreadFactory(ThreadFactory threadFactory) Sets the thread factory used to create new threads.","void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.","List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution.","void terminated() Method invoked when the Executor has terminated.","String toString() Returns a string identifying this pool, as well as its state, including indications of run state and estimated worker and task counts.","From class java.util.concurrent.AbstractExecutorService <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete. <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first. <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses. <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do. <T> RunnableFuture<T> newTaskFor(Callable<T> callable) Returns a RunnableFuture for the given callable task. <T> RunnableFuture<T> newTaskFor(Runnable runnable, T value) Returns a RunnableFuture for the given runnable and default value. <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task. <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task. Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","<T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete.","<T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first.","<T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses.","<T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do.","<T> RunnableFuture<T> newTaskFor(Callable<T> callable) Returns a RunnableFuture for the given callable task.","<T> RunnableFuture<T> newTaskFor(Runnable runnable, T value) Returns a RunnableFuture for the given runnable and default value.","<T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","<T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.util.concurrent.Executor abstract void execute(Runnable command) Executes the given command at some time in the future.","abstract void execute(Runnable command) Executes the given command at some time in the future.","From interface java.util.concurrent.ExecutorService abstract boolean awaitTermination(long timeout, TimeUnit unit) Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first. abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete. abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first. abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses. abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do. abstract boolean isShutdown() Returns true if this executor has been shut down. abstract boolean isTerminated() Returns true if all tasks have completed following shut down. abstract void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted. abstract List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution. abstract <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task. abstract <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task. abstract Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","abstract boolean awaitTermination(long timeout, TimeUnit unit) Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first.","abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning a list of Futures holding their status and results when all complete.","abstract <T> List<Future<T>> invokeAll(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first.","abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks, long timeout, TimeUnit unit) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses.","abstract <T> T invokeAny(Collection<?만xtendsCallable<T>> tasks) Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do.","abstract boolean isShutdown() Returns true if this executor has been shut down.","abstract boolean isTerminated() Returns true if all tasks have completed following shut down.","abstract void shutdown() Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.","abstract List<Runnable> shutdownNow() Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution.","abstract <T> Future<T> submit(Runnable task, T result) Submits a Runnable task for execution and returns a Future representing that task.","abstract <T> Future<T> submit(Callable<T> task) Submits a value-returning task for execution and returns a Future representing the pending results of the task.","abstract Future<?> submit(Runnable task) Submits a Runnable task for execution and returns a Future representing that task.","From interface java.util.concurrent.ScheduledExecutorService abstract ScheduledFuture<?> schedule(Runnable command, long delay, TimeUnit unit) Creates and executes a one-shot action that becomes enabled after the given delay. abstract <V> ScheduledFuture<V> schedule(Callable<V> callable, long delay, TimeUnit unit) Creates and executes a ScheduledFuture that becomes enabled after the given delay. abstract ScheduledFuture<?> scheduleAtFixedRate(Runnable command, long initialDelay, long period, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given period; that is executions will commence after initialDelay then initialDelay+period, then initialDelay + 2 * period, and so on. abstract ScheduledFuture<?> scheduleWithFixedDelay(Runnable command, long initialDelay, long delay, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given delay between the termination of one execution and the commencement of the next.","abstract ScheduledFuture<?> schedule(Runnable command, long delay, TimeUnit unit) Creates and executes a one-shot action that becomes enabled after the given delay.","abstract <V> ScheduledFuture<V> schedule(Callable<V> callable, long delay, TimeUnit unit) Creates and executes a ScheduledFuture that becomes enabled after the given delay.","abstract ScheduledFuture<?> scheduleAtFixedRate(Runnable command, long initialDelay, long period, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given period; that is executions will commence after initialDelay then initialDelay+period, then initialDelay + 2 * period, and so on.","abstract ScheduledFuture<?> scheduleWithFixedDelay(Runnable command, long initialDelay, long delay, TimeUnit unit) Creates and executes a periodic action that becomes enabled first after the given initial delay, and subsequently with the given delay between the termination of one execution and the commencement of the next."],"package":"java.util.concurrent","constants":[],"class":"ScheduledThreadPoolExecutor","constructors":[],"fields":[]}