{"methods":["abstract ErrorHandler getErrorHandler() Gets the current ErrorHandler set to this SchemaFactory.","boolean getFeature(String name) Look up the value of a feature flag.","Object getProperty(String name) Look up the value of a property.","abstract LSResourceResolver getResourceResolver() Gets the current LSResourceResolver set to this SchemaFactory.","abstract boolean isSchemaLanguageSupported(String schemaLanguage) Is specified schema supported by this SchemaFactory?","static SchemaFactory newInstance(String schemaLanguage, String factoryClassName, ClassLoader classLoader) Returns an instance of the named implementation of SchemaFactory.","static SchemaFactory newInstance(String schemaLanguage) Lookup an implementation of the SchemaFactory that supports the specified schema language and return it.","abstract Schema newSchema(Source[] schemas) Parses the specified source(s) as a schema and returns it as a schema.","Schema newSchema(URL schema) Parses the specified URL as a schema and returns it as a Schema.","Schema newSchema(File schema) Parses the specified File as a schema and returns it as a Schema.","Schema newSchema(Source schema) Parses the specified source as a schema and returns it as a schema.","abstract Schema newSchema() Creates a special Schema object.","abstract void setErrorHandler(ErrorHandler errorHandler) Sets the ErrorHandler to receive errors encountered during the newSchema method invocation.","void setFeature(String name, boolean value) Set the value of a feature flag.","void setProperty(String name, Object object) Set the value of a property.","abstract void setResourceResolver(LSResourceResolver resourceResolver) Sets the LSResourceResolver to customize resource resolution when parsing schemas.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.validation","constants":[],"class":"SchemaFactory","constructors":[],"fields":[]}