{"methods":["static ScriptIntrinsicBlend create(RenderScript rs, Element e) Supported elements types are U8_4(RenderScript)","void forEachAdd(Allocation ain, Allocation aout) Sets dst = min(src + dst, 1.0)","void forEachClear(Allocation ain, Allocation aout) Sets dst = {0, 0, 0, 0}","void forEachDst(Allocation ain, Allocation aout) Sets dst = dst This is a NOP.","void forEachDstAtop(Allocation ain, Allocation aout) dst = dst.rgb * src.a + (1.0 - dst.a) * src.rgb dst.a = src.a","void forEachDstIn(Allocation ain, Allocation aout) Sets dst = dst * src.a","void forEachDstOut(Allocation ain, Allocation aout) Sets dst = dst * (1.0 - src.a)","void forEachDstOver(Allocation ain, Allocation aout) Sets dst = dst + src * (1.0 - dst.a)","void forEachMultiply(Allocation ain, Allocation aout) Sets dst = src * dst","void forEachSrc(Allocation ain, Allocation aout) Sets dst = src","void forEachSrcAtop(Allocation ain, Allocation aout) dst.rgb = src.rgb * dst.a + (1.0 - src.a) * dst.rgb dst.a = dst.a","void forEachSrcIn(Allocation ain, Allocation aout) Sets dst = src * dst.a","void forEachSrcOut(Allocation ain, Allocation aout) Sets dst = src * (1.0 - dst.a)","void forEachSrcOver(Allocation ain, Allocation aout) Sets dst = src + dst * (1.0 - src.a)","void forEachSubtract(Allocation ain, Allocation aout) Sets dst = max(dst - src, 0.0)","void forEachXor(Allocation ain, Allocation aout) Sets dst = {src.r ^ dst.r, src.g ^ dst.g, src.b ^ dst.b, src.a ^ dst.a}","Script.KernelID getKernelIDAdd() Get a KernelID for the Add kernel.","Script.KernelID getKernelIDClear() Get a KernelID for the Clear kernel.","Script.KernelID getKernelIDDst() Get a KernelID for the Dst kernel.","Script.KernelID getKernelIDDstAtop() Get a KernelID for the DstAtop kernel.","Script.KernelID getKernelIDDstIn() Get a KernelID for the DstIn kernel.","Script.KernelID getKernelIDDstOut() Get a KernelID for the DstOut kernel.","Script.KernelID getKernelIDDstOver() Get a KernelID for the DstOver kernel.","Script.KernelID getKernelIDMultiply() Get a KernelID for the Multiply kernel.","Script.KernelID getKernelIDSrc() Get a KernelID for the Src kernel.","Script.KernelID getKernelIDSrcAtop() Get a KernelID for the SrcAtop kernel.","Script.KernelID getKernelIDSrcIn() Get a KernelID for the SrcIn kernel.","Script.KernelID getKernelIDSrcOut() Get a KernelID for the SrcOut kernel.","Script.KernelID getKernelIDSrcOver() Get a KernelID for the SrcOver kernel.","Script.KernelID getKernelIDSubtract() Get a KernelID for the Subtract kernel.","Script.KernelID getKernelIDXor() Get a KernelID for the Xor kernel.","[Expand] Inherited Methods","From class android.support.v8.renderscript.Script void bindAllocation(Allocation va, int slot) Only intended for use by generated reflected code. Script.FieldID createFieldID(int slot, Element e) Only to be used by generated reflected classes. Script.KernelID createKernelID(int slot, int sig, Element ein, Element eout) Only to be used by generated reflected classes. void forEach(int slot, Allocation ain, Allocation aout, FieldPacker v) Only intended for use by generated reflected code. void forEach(int slot, Allocation ain, Allocation aout, FieldPacker v, Script.LaunchOptions sc) Only intended for use by generated reflected code. void invoke(int slot) Only intended for use by generated reflected code. void invoke(int slot, FieldPacker v) Only intended for use by generated reflected code. void setTimeZone(String timeZone) void setVar(int index, int v) Only intended for use by generated reflected code. void setVar(int index, FieldPacker v, Element e, int[] dims) Only intended for use by generated reflected code. void setVar(int index, boolean v) Only intended for use by generated reflected code. void setVar(int index, double v) Only intended for use by generated reflected code. void setVar(int index, float v) Only intended for use by generated reflected code. void setVar(int index, long v) Only intended for use by generated reflected code. void setVar(int index, FieldPacker v) Only intended for use by generated reflected code. void setVar(int index, BaseObj o) Only intended for use by generated reflected code.","void bindAllocation(Allocation va, int slot) Only intended for use by generated reflected code.","Script.FieldID createFieldID(int slot, Element e) Only to be used by generated reflected classes.","Script.KernelID createKernelID(int slot, int sig, Element ein, Element eout) Only to be used by generated reflected classes.","void forEach(int slot, Allocation ain, Allocation aout, FieldPacker v) Only intended for use by generated reflected code.","void forEach(int slot, Allocation ain, Allocation aout, FieldPacker v, Script.LaunchOptions sc) Only intended for use by generated reflected code.","void invoke(int slot) Only intended for use by generated reflected code.","void invoke(int slot, FieldPacker v) Only intended for use by generated reflected code.","void setTimeZone(String timeZone)","void setVar(int index, int v) Only intended for use by generated reflected code.","void setVar(int index, FieldPacker v, Element e, int[] dims) Only intended for use by generated reflected code.","void setVar(int index, boolean v) Only intended for use by generated reflected code.","void setVar(int index, double v) Only intended for use by generated reflected code.","void setVar(int index, float v) Only intended for use by generated reflected code.","void setVar(int index, long v) Only intended for use by generated reflected code.","void setVar(int index, FieldPacker v) Only intended for use by generated reflected code.","void setVar(int index, BaseObj o) Only intended for use by generated reflected code.","From class android.support.v8.renderscript.BaseObj void destroy() Frees any native resources associated with this object. boolean equals(Object obj) Compare the current BaseObj with another BaseObj for equality. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. int hashCode() Calculates the hash code value for a BaseObj.","void destroy() Frees any native resources associated with this object.","boolean equals(Object obj) Compare the current BaseObj with another BaseObj for equality.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","int hashCode() Calculates the hash code value for a BaseObj.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v8.renderscript","constants":[],"class":"ScriptIntrinsicBlend","constructors":[],"fields":[]}