{"methods":["static int addProvider(Provider provider) Adds the given provider to the collection of providers at the next available position.","static String getAlgorithmProperty(String algName, String propName) This method was deprecated in API level 1. Use AlgorithmParameters and KeyFactory instead.","static Set<String> getAlgorithms(String serviceName) Returns a Set of all registered algorithms for the specified cryptographic service.","static String getProperty(String key) Returns the value of the security property named by the argument.","synchronized static Provider getProvider(String name) Returns the Provider with the specified name.","static Provider[] getProviders(String filter) Returns the array of providers which meet the user supplied string filter.","synchronized static Provider[] getProviders() Returns an array containing all installed providers.","synchronized static Provider[] getProviders(Map<String, String> filter) Returns the array of providers which meet the user supplied set of filters.","synchronized static int insertProviderAt(Provider provider, int position) Insert the given Provider at the specified position.","synchronized static void removeProvider(String name) Removes the Provider with the specified name form the collection of providers.","static void setProperty(String key, String value) Sets the value of the specified security property.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security","constants":[],"class":"Security","constructors":[],"fields":[]}