{"methods":["final Object attach(Object anObject) Attaches an object to this key.","final Object attachment() Gets the attached object.","abstract void cancel() Cancels this key.","abstract SelectableChannel channel() Gets the channel of this key.","abstract int interestOps() Gets this key's interest set.","abstract SelectionKey interestOps(int operations) Sets the interest set for this key.","final boolean isAcceptable() Indicates whether this key's channel is interested in the accept operation and is ready to accept new connections.","final boolean isConnectable() Indicates whether this key's channel is interested in the connect operation and is ready to connect.","final boolean isReadable() Indicates whether this key's channel is interested in the read operation and is ready to read.","abstract boolean isValid() Indicates whether this key is valid.","final boolean isWritable() Indicates whether this key's channel is interested in the write operation and is ready to write.","abstract int readyOps() Gets the set of operations that are ready.","abstract Selector selector() Gets the selector for which this key's channel is registered.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.nio.channels","constants":["int OP_ACCEPT Interest set mask bit for socket-accept operations.","int OP_CONNECT Interest set mask bit for socket-connect operations.","int OP_READ Interesting operation mask bit for read operations.","int OP_WRITE Interest set mask bit for write operations."],"class":"SelectionKey","constructors":[],"fields":[]}