{"methods":["static boolean extendDown(Spannable text, Layout layout) Move the selection end to the buffer offset physically below the current selection end.","static boolean extendLeft(Spannable text, Layout layout) Move the selection end to the buffer offset physically to the left of the current selection end.","static boolean extendRight(Spannable text, Layout layout) Move the selection end to the buffer offset physically to the right of the current selection end.","final static void extendSelection(Spannable text, int index) Move the selection edge to offset index.","static boolean extendToLeftEdge(Spannable text, Layout layout)","static boolean extendToRightEdge(Spannable text, Layout layout)","static boolean extendUp(Spannable text, Layout layout) Move the selection end to the buffer offset physically above the current selection end.","final static int getSelectionEnd(CharSequence text) Return the offset of the selection edge or cursor, or -1 if there is no selection or cursor.","final static int getSelectionStart(CharSequence text) Return the offset of the selection anchor or cursor, or -1 if there is no selection or cursor.","static boolean moveDown(Spannable text, Layout layout) Move the cursor to the buffer offset physically below the current offset, to the end of the buffer if it is on the bottom line but not at the end, or return false if the cursor is already at the end of the buffer.","static boolean moveLeft(Spannable text, Layout layout) Move the cursor to the buffer offset physically to the left of the current offset, or return false if the cursor is already at the left edge of the line and there is not another line to move it to.","static boolean moveRight(Spannable text, Layout layout) Move the cursor to the buffer offset physically to the right of the current offset, or return false if the cursor is already at at the right edge of the line and there is not another line to move it to.","static boolean moveToLeftEdge(Spannable text, Layout layout)","static boolean moveToRightEdge(Spannable text, Layout layout)","static boolean moveUp(Spannable text, Layout layout) Move the cursor to the buffer offset physically above the current offset, to the beginning if it is on the top line but not at the start, or return false if the cursor is already on the top line.","final static void removeSelection(Spannable text) Remove the selection or cursor, if any, from the text.","final static void selectAll(Spannable text) Select the entire text.","final static void setSelection(Spannable text, int index) Move the cursor to offset index.","static void setSelection(Spannable text, int start, int stop) Set the selection anchor to start and the selection edge to stop.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.text","constants":[],"class":"Selection","constructors":[],"fields":["public static final Object SELECTION_END","public static final Object SELECTION_START"]}