{"methods":["void acquire() Acquires a permit from this semaphore, blocking until one is available, or the thread is interrupted.","void acquire(int permits) Acquires the given number of permits from this semaphore, blocking until all are available, or the thread is interrupted.","void acquireUninterruptibly() Acquires a permit from this semaphore, blocking until one is available.","void acquireUninterruptibly(int permits) Acquires the given number of permits from this semaphore, blocking until all are available.","int availablePermits() Returns the current number of permits available in this semaphore.","int drainPermits() Acquires and returns all permits that are immediately available.","final int getQueueLength() Returns an estimate of the number of threads waiting to acquire.","final boolean hasQueuedThreads() Queries whether any threads are waiting to acquire.","boolean isFair() Returns true if this semaphore has fairness set true.","void release() Releases a permit, returning it to the semaphore.","void release(int permits) Releases the given number of permits, returning them to the semaphore.","String toString() Returns a string identifying this semaphore, as well as its state.","boolean tryAcquire(long timeout, TimeUnit unit) Acquires a permit from this semaphore, if one becomes available within the given waiting time and the current thread has not been interrupted.","boolean tryAcquire() Acquires a permit from this semaphore, only if one is available at the time of invocation.","boolean tryAcquire(int permits, long timeout, TimeUnit unit) Acquires the given number of permits from this semaphore, if all become available within the given waiting time and the current thread has not been interrupted.","boolean tryAcquire(int permits) Acquires the given number of permits from this semaphore, only if all are available at the time of invocation.","Collection<Thread> getQueuedThreads() Returns a collection containing threads that may be waiting to acquire.","void reducePermits(int reduction) Shrinks the number of available permits by the indicated reduction.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.util.concurrent","constants":[],"class":"Semaphore","constructors":[],"fields":[]}