{"methods":["static void getConfiguration(ContentResolver cr, Configuration outConfig) Convenience function to read all of the current configuration-related settings into a Configuration object.","static float getFloat(ContentResolver cr, String name, float def) Convenience function for retrieving a single system settings value as a floating point number.","static float getFloat(ContentResolver cr, String name) Convenience function for retrieving a single system settings value as a float.","static int getInt(ContentResolver cr, String name) Convenience function for retrieving a single system settings value as an integer.","static int getInt(ContentResolver cr, String name, int def) Convenience function for retrieving a single system settings value as an integer.","static long getLong(ContentResolver cr, String name, long def) Convenience function for retrieving a single system settings value as a long.","static long getLong(ContentResolver cr, String name) Convenience function for retrieving a single system settings value as a long.","static boolean getShowGTalkServiceStatus(ContentResolver cr) This method was deprecated in API level 17. - Do not use","static String getString(ContentResolver resolver, String name) Look up a name in the database.","static Uri getUriFor(String name) Construct the content URI for a particular name/value pair, useful for monitoring changes with a ContentObserver.","static boolean putConfiguration(ContentResolver cr, Configuration config) Convenience function to write a batch of configuration-related settings from a Configuration object.","static boolean putFloat(ContentResolver cr, String name, float value) Convenience function for updating a single settings value as a floating point number.","static boolean putInt(ContentResolver cr, String name, int value) Convenience function for updating a single settings value as an integer.","static boolean putLong(ContentResolver cr, String name, long value) Convenience function for updating a single settings value as a long integer.","static boolean putString(ContentResolver resolver, String name, String value) Store a name/value pair into the database.","static void setShowGTalkServiceStatus(ContentResolver cr, boolean flag) This method was deprecated in API level 17. - Do not use","[Expand] Inherited Methods","From class android.provider.Settings.NameValueTable static Uri getUriFor(Uri uri, String name) static boolean putString(ContentResolver resolver, Uri uri, String name, String value)","static Uri getUriFor(Uri uri, String name)","static boolean putString(ContentResolver resolver, Uri uri, String name, String value)","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ACCELEROMETER_ROTATION Control whether the accelerometer will be used to change screen orientation.","String ADB_ENABLED This constant was deprecated in API level 3. Use ADB_ENABLED instead","String AIRPLANE_MODE_ON This constant was deprecated in API level 17. Use AIRPLANE_MODE_ON instead","String AIRPLANE_MODE_RADIOS This constant was deprecated in API level 17. Use AIRPLANE_MODE_RADIOS instead","String ALARM_ALERT Persistent store for the system-wide default alarm alert.","String ALWAYS_FINISH_ACTIVITIES This constant was deprecated in API level 17. Use ALWAYS_FINISH_ACTIVITIES instead","String ANDROID_ID This constant was deprecated in API level 3. Use ANDROID_ID instead","String ANIMATOR_DURATION_SCALE This constant was deprecated in API level 17. Use ANIMATOR_DURATION_SCALE instead","String APPEND_FOR_LAST_AUDIBLE Appended to various volume related settings to record the previous values before they the settings were affected by a silent/vibrate ringer mode change.","String AUTO_TIME This constant was deprecated in API level 17. Use AUTO_TIME instead","String AUTO_TIME_ZONE This constant was deprecated in API level 17. Use AUTO_TIME_ZONE instead","String BLUETOOTH_DISCOVERABILITY Determines whether remote devices may discover and/or connect to this device.","String BLUETOOTH_DISCOVERABILITY_TIMEOUT Bluetooth discoverability timeout.","String BLUETOOTH_ON This constant was deprecated in API level 3. Use BLUETOOTH_ON instead","String DATA_ROAMING This constant was deprecated in API level 3. Use DATA_ROAMING instead","String DATE_FORMAT Date format string mm/dd/yyyy dd/mm/yyyy yyyy/mm/dd","String DEBUG_APP This constant was deprecated in API level 17. Use DEBUG_APP instead","String DEVICE_PROVISIONED This constant was deprecated in API level 3. Use DEVICE_PROVISIONED instead","String DIM_SCREEN This constant was deprecated in API level 17. This setting is no longer used.","String DTMF_TONE_WHEN_DIALING Whether the audible DTMF tones are played by the dialer when dialing.","String END_BUTTON_BEHAVIOR What happens when the user presses the end call button if they're not on a call.","String FONT_SCALE Scaling factor for fonts, float.","String HAPTIC_FEEDBACK_ENABLED Whether the haptic feedback (long presses, ...) are enabled.","String HTTP_PROXY This constant was deprecated in API level 3. Use HTTP_PROXY instead","String INSTALL_NON_MARKET_APPS This constant was deprecated in API level 3. Use INSTALL_NON_MARKET_APPS instead","String LOCATION_PROVIDERS_ALLOWED This constant was deprecated in API level 3. Use LOCATION_PROVIDERS_ALLOWED instead","String LOCK_PATTERN_ENABLED This constant was deprecated in API level 8. Use LOCK_PATTERN_ENABLED instead","String LOCK_PATTERN_TACTILE_FEEDBACK_ENABLED This constant was deprecated in API level 8. Use LOCK_PATTERN_TACTILE_FEEDBACK_ENABLED instead","String LOCK_PATTERN_VISIBLE This constant was deprecated in API level 8. Use LOCK_PATTERN_VISIBLE instead","String LOGGING_ID This constant was deprecated in API level 3. Use LOGGING_ID instead","String MODE_RINGER This constant was deprecated in API level 17. Use MODE_RINGER instead","String MODE_RINGER_STREAMS_AFFECTED Determines which streams are affected by ringer mode changes.","String MUTE_STREAMS_AFFECTED Determines which streams are affected by mute.","String NETWORK_PREFERENCE This constant was deprecated in API level 3. Use NETWORK_PREFERENCE instead","String NEXT_ALARM_FORMATTED This constant was deprecated in API level 21. Use getNextAlarmClock().","String NOTIFICATION_SOUND Persistent store for the system-wide default notification sound.","String PARENTAL_CONTROL_ENABLED This constant was deprecated in API level 3. Use PARENTAL_CONTROL_ENABLED instead","String PARENTAL_CONTROL_LAST_UPDATE This constant was deprecated in API level 3. Use PARENTAL_CONTROL_LAST_UPDATE instead","String PARENTAL_CONTROL_REDIRECT_URL This constant was deprecated in API level 3. Use PARENTAL_CONTROL_REDIRECT_URL instead","String RADIO_BLUETOOTH This constant was deprecated in API level 17. Use RADIO_BLUETOOTH instead","String RADIO_CELL This constant was deprecated in API level 17. Use RADIO_CELL instead","String RADIO_NFC This constant was deprecated in API level 17. Use RADIO_NFC instead","String RADIO_WIFI This constant was deprecated in API level 17. Use RADIO_WIFI instead","String RINGTONE Persistent store for the system-wide default ringtone URI.","String SCREEN_BRIGHTNESS The screen backlight brightness between 0 and 255.","String SCREEN_BRIGHTNESS_MODE Control whether to enable automatic brightness mode.","int SCREEN_BRIGHTNESS_MODE_AUTOMATIC SCREEN_BRIGHTNESS_MODE value for automatic mode.","int SCREEN_BRIGHTNESS_MODE_MANUAL SCREEN_BRIGHTNESS_MODE value for manual mode.","String SCREEN_OFF_TIMEOUT The amount of time in milliseconds before the device goes to sleep or begins to dream after a period of inactivity.","String SETTINGS_CLASSNAME This constant was deprecated in API level 3. Use SETTINGS_CLASSNAME instead","String SETUP_WIZARD_HAS_RUN Whether the setup wizard has been run before (on first boot), or if it still needs to be run.","String SHOW_GTALK_SERVICE_STATUS","String SHOW_PROCESSES This constant was deprecated in API level 17. Use SHOW_PROCESSES instead","String SHOW_WEB_SUGGESTIONS This constant was deprecated in API level 11. Each application that shows web suggestions should have its own setting for this.","String SOUND_EFFECTS_ENABLED Whether the sounds effects (key clicks, lid open ...) are enabled.","String STAY_ON_WHILE_PLUGGED_IN This constant was deprecated in API level 17. Use STAY_ON_WHILE_PLUGGED_IN instead","String SYS_PROP_SETTING_VERSION","String TEXT_AUTO_CAPS Setting to enable Auto Caps in text editors.","String TEXT_AUTO_PUNCTUATE Setting to enable Auto Punctuate in text editors.","String TEXT_AUTO_REPLACE Setting to enable Auto Replace (AutoText) in text editors.","String TEXT_SHOW_PASSWORD Setting to showing password characters in text editors.","String TIME_12_24 Display times as 12 or 24 hours 12 24","String TRANSITION_ANIMATION_SCALE This constant was deprecated in API level 17. Use TRANSITION_ANIMATION_SCALE instead","String USB_MASS_STORAGE_ENABLED This constant was deprecated in API level 3. Use USB_MASS_STORAGE_ENABLED instead","String USER_ROTATION Default screen rotation when no other policy applies.","String USE_GOOGLE_MAIL This constant was deprecated in API level 3. Use USE_GOOGLE_MAIL instead","String VIBRATE_ON Whether vibrate is on for different events.","String VOLUME_ALARM Alarm volume.","String VOLUME_BLUETOOTH_SCO Bluetooth Headset volume.","String VOLUME_MUSIC Music/media/gaming volume.","String VOLUME_NOTIFICATION Notification volume.","String VOLUME_RING Ringer volume.","String VOLUME_SYSTEM System/notifications volume.","String VOLUME_VOICE Voice call volume.","String WAIT_FOR_DEBUGGER This constant was deprecated in API level 17. Use WAIT_FOR_DEBUGGER instead","String WALLPAPER_ACTIVITY This constant was deprecated in API level 17. Use WallpaperManager instead.","String WIFI_MAX_DHCP_RETRY_COUNT This constant was deprecated in API level 3. Use WIFI_MAX_DHCP_RETRY_COUNT instead","String WIFI_MOBILE_DATA_TRANSITION_WAKELOCK_TIMEOUT_MS This constant was deprecated in API level 3. Use WIFI_MOBILE_DATA_TRANSITION_WAKELOCK_TIMEOUT_MS instead","String WIFI_NETWORKS_AVAILABLE_NOTIFICATION_ON This constant was deprecated in API level 3. Use WIFI_NETWORKS_AVAILABLE_NOTIFICATION_ON instead","String WIFI_NETWORKS_AVAILABLE_REPEAT_DELAY This constant was deprecated in API level 3. Use WIFI_NETWORKS_AVAILABLE_REPEAT_DELAY instead","String WIFI_NUM_OPEN_NETWORKS_KEPT This constant was deprecated in API level 3. Use WIFI_NUM_OPEN_NETWORKS_KEPT instead","String WIFI_ON This constant was deprecated in API level 3. Use WIFI_ON instead","String WIFI_SLEEP_POLICY This constant was deprecated in API level 17. Use WIFI_SLEEP_POLICY instead","int WIFI_SLEEP_POLICY_DEFAULT This constant was deprecated in API level 17. Use WIFI_SLEEP_POLICY_DEFAULT instead","int WIFI_SLEEP_POLICY_NEVER This constant was deprecated in API level 17. Use WIFI_SLEEP_POLICY_NEVER instead","int WIFI_SLEEP_POLICY_NEVER_WHILE_PLUGGED This constant was deprecated in API level 17. Use WIFI_SLEEP_POLICY_NEVER_WHILE_PLUGGED instead","String WIFI_STATIC_DNS1 This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_STATIC_DNS2 This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_STATIC_GATEWAY This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_STATIC_IP This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_STATIC_NETMASK This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_USE_STATIC_IP This constant was deprecated in API level 17. Use WifiManager instead","String WIFI_WATCHDOG_ACCEPTABLE_PACKET_LOSS_PERCENTAGE This constant was deprecated in API level 3. Use WIFI_WATCHDOG_ACCEPTABLE_PACKET_LOSS_PERCENTAGE instead","String WIFI_WATCHDOG_AP_COUNT This constant was deprecated in API level 3. Use WIFI_WATCHDOG_AP_COUNT instead","String WIFI_WATCHDOG_BACKGROUND_CHECK_DELAY_MS This constant was deprecated in API level 3. Use WIFI_WATCHDOG_BACKGROUND_CHECK_DELAY_MS instead","String WIFI_WATCHDOG_BACKGROUND_CHECK_ENABLED This constant was deprecated in API level 3. Use WIFI_WATCHDOG_BACKGROUND_CHECK_ENABLED instead","String WIFI_WATCHDOG_BACKGROUND_CHECK_TIMEOUT_MS This constant was deprecated in API level 3. Use WIFI_WATCHDOG_BACKGROUND_CHECK_TIMEOUT_MS instead","String WIFI_WATCHDOG_INITIAL_IGNORED_PING_COUNT This constant was deprecated in API level 3. Use WIFI_WATCHDOG_INITIAL_IGNORED_PING_COUNT instead","String WIFI_WATCHDOG_MAX_AP_CHECKS This constant was deprecated in API level 3. Use WIFI_WATCHDOG_MAX_AP_CHECKS instead","String WIFI_WATCHDOG_ON This constant was deprecated in API level 3. Use WIFI_WATCHDOG_ON instead","String WIFI_WATCHDOG_PING_COUNT This constant was deprecated in API level 3. Use WIFI_WATCHDOG_PING_COUNT instead","String WIFI_WATCHDOG_PING_DELAY_MS This constant was deprecated in API level 3. Use WIFI_WATCHDOG_PING_DELAY_MS instead","String WIFI_WATCHDOG_PING_TIMEOUT_MS This constant was deprecated in API level 3. Use WIFI_WATCHDOG_PING_TIMEOUT_MS instead","String WINDOW_ANIMATION_SCALE This constant was deprecated in API level 17. Use WINDOW_ANIMATION_SCALE instead","[Expand] Inherited Constants","From class android.provider.Settings.NameValueTable String NAME String VALUE","String NAME","String VALUE","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"Settings.System","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for this table","public static final Uri DEFAULT_ALARM_ALERT_URI A Uri that will point to the current default alarm alert at any given time.","public static final Uri DEFAULT_NOTIFICATION_URI A Uri that will point to the current default notification sound at any given time.","public static final Uri DEFAULT_RINGTONE_URI A Uri that will point to the current default ringtone at any given time.","public static final String[] VOLUME_SETTINGS The mapping of stream type (integer) to its setting."]}