{"methods":["static float getFloat(ContentResolver cr, String name, float def) Convenience function for retrieving a single secure settings value as a floating point number.","static float getFloat(ContentResolver cr, String name) Convenience function for retrieving a single secure settings value as a float.","static int getInt(ContentResolver cr, String name) Convenience function for retrieving a single secure settings value as an integer.","static int getInt(ContentResolver cr, String name, int def) Convenience function for retrieving a single secure settings value as an integer.","static long getLong(ContentResolver cr, String name, long def) Convenience function for retrieving a single secure settings value as a long.","static long getLong(ContentResolver cr, String name) Convenience function for retrieving a single secure settings value as a long.","static String getString(ContentResolver resolver, String name) Look up a name in the database.","static Uri getUriFor(String name) Construct the content URI for a particular name/value pair, useful for monitoring changes with a ContentObserver.","final static boolean isLocationProviderEnabled(ContentResolver cr, String provider) This method was deprecated in API level 19. use LOCATION_MODE or isProviderEnabled(String)","static boolean putFloat(ContentResolver cr, String name, float value) Convenience function for updating a single settings value as a floating point number.","static boolean putInt(ContentResolver cr, String name, int value) Convenience function for updating a single settings value as an integer.","static boolean putLong(ContentResolver cr, String name, long value) Convenience function for updating a secure settings value as a long integer.","static boolean putString(ContentResolver resolver, String name, String value) Store a name/value pair into the database.","final static void setLocationProviderEnabled(ContentResolver cr, String provider, boolean enabled) This method was deprecated in API level 19. use putInt(ContentResolver, String, int) and LOCATION_MODE","[Expand] Inherited Methods","From class android.provider.Settings.NameValueTable static Uri getUriFor(Uri uri, String name) static boolean putString(ContentResolver resolver, Uri uri, String name, String value)","static Uri getUriFor(Uri uri, String name)","static boolean putString(ContentResolver resolver, Uri uri, String name, String value)","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ACCESSIBILITY_DISPLAY_INVERSION_ENABLED Setting that specifies whether display color inversion is enabled.","String ACCESSIBILITY_ENABLED If accessibility is enabled.","String ACCESSIBILITY_SPEAK_PASSWORD Whether to speak passwords while in accessibility mode.","String ADB_ENABLED This constant was deprecated in API level 17. Use ADB_ENABLED instead","String ALLOWED_GEOLOCATION_ORIGINS Origins for which browsers should allow geolocation by default.","String ALLOW_MOCK_LOCATION Setting to allow mock locations and location provider status to be injected into the LocationManager service for testing purposes during application development.","String ANDROID_ID A 64-bit number (as a hex string) that is randomly generated when the user first sets up the device and should remain constant for the lifetime of the user's device.","String BACKGROUND_DATA This constant was deprecated in API level 14. As of ICE_CREAM_SANDWICH, availability of background data depends on several combined factors. When background data is unavailable, getActiveNetworkInfo() will now appear disconnected.","String BLUETOOTH_ON This constant was deprecated in API level 17. Use BLUETOOTH_ON instead","String DATA_ROAMING This constant was deprecated in API level 17. Use DATA_ROAMING instead","String DEFAULT_INPUT_METHOD Setting to record the input method used by default, holding the ID of the desired method.","String DEVELOPMENT_SETTINGS_ENABLED This constant was deprecated in API level 17. Use DEVELOPMENT_SETTINGS_ENABLED instead","String DEVICE_PROVISIONED This constant was deprecated in API level 17. Use DEVICE_PROVISIONED instead","String ENABLED_ACCESSIBILITY_SERVICES List of the enabled accessibility providers.","String ENABLED_INPUT_METHODS List of input methods that are currently enabled.","String HTTP_PROXY This constant was deprecated in API level 17. Use HTTP_PROXY","String INPUT_METHOD_SELECTOR_VISIBILITY Setting to record the visibility of input method selector","String INSTALL_NON_MARKET_APPS Whether applications can be installed for this user via the system's ACTION_INSTALL_PACKAGE mechanism.","String LOCATION_MODE The degree of location access enabled by the user.","int LOCATION_MODE_BATTERY_SAVING Reduced power usage, such as limiting the number of GPS updates per hour.","int LOCATION_MODE_HIGH_ACCURACY Best-effort location computation allowed.","int LOCATION_MODE_OFF Location access disabled.","int LOCATION_MODE_SENSORS_ONLY Network Location Provider disabled, but GPS and other sensors enabled.","String LOCATION_PROVIDERS_ALLOWED This constant was deprecated in API level 19. use LOCATION_MODE and MODE_CHANGED_ACTION (or PROVIDERS_CHANGED_ACTION)","String LOCK_PATTERN_ENABLED Whether autolock is enabled (0 = false, 1 = true)","String LOCK_PATTERN_TACTILE_FEEDBACK_ENABLED This constant was deprecated in API level 17. Starting in JELLY_BEAN_MR1 the lockscreen uses HAPTIC_FEEDBACK_ENABLED.","String LOCK_PATTERN_VISIBLE Whether lock pattern is visible as user enters (0 = false, 1 = true)","String LOGGING_ID This constant was deprecated in API level 3. This identifier is poorly initialized and has many collisions. It should not be used.","String NETWORK_PREFERENCE This constant was deprecated in API level 17. Use NETWORK_PREFERENCE instead","String PARENTAL_CONTROL_ENABLED No longer supported.","String PARENTAL_CONTROL_LAST_UPDATE No longer supported.","String PARENTAL_CONTROL_REDIRECT_URL No longer supported.","String SELECTED_INPUT_METHOD_SUBTYPE Setting to record the input method subtype used by default, holding the ID of the desired method.","String SETTINGS_CLASSNAME Settings classname to launch when Settings is clicked from All Applications.","String SKIP_FIRST_USE_HINTS If enabled, apps should try to skip any introductory hints on first launch.","String SYS_PROP_SETTING_VERSION","String TOUCH_EXPLORATION_ENABLED If touch exploration is enabled.","String TTS_DEFAULT_COUNTRY This constant was deprecated in API level 14. this setting is no longer in use, as of the Ice Cream Sandwich release. Apps should never need to read this setting directly, instead can query the TextToSpeech framework classes for the default locale. getLanguage().","String TTS_DEFAULT_LANG This constant was deprecated in API level 14. this setting is no longer in use, as of the Ice Cream Sandwich release. Apps should never need to read this setting directly, instead can query the TextToSpeech framework classes for the default locale. getLanguage().","String TTS_DEFAULT_PITCH Default text-to-speech engine pitch.","String TTS_DEFAULT_RATE Default text-to-speech engine speech rate.","String TTS_DEFAULT_SYNTH Default text-to-speech engine.","String TTS_DEFAULT_VARIANT This constant was deprecated in API level 14. this setting is no longer in use, as of the Ice Cream Sandwich release. Apps should never need to read this setting directly, instead can query the TextToSpeech framework classes for the locale that is in use getLanguage().","String TTS_ENABLED_PLUGINS Space delimited list of plugin packages that are enabled.","String TTS_USE_DEFAULTS This constant was deprecated in API level 14. The value of this setting is no longer respected by the framework text to speech APIs as of the Ice Cream Sandwich release.","String USB_MASS_STORAGE_ENABLED This constant was deprecated in API level 17. Use USB_MASS_STORAGE_ENABLED instead","String USE_GOOGLE_MAIL This constant was deprecated in API level 17. Use USE_GOOGLE_MAIL instead","String WIFI_MAX_DHCP_RETRY_COUNT This constant was deprecated in API level 17. Use WIFI_MAX_DHCP_RETRY_COUNT instead","String WIFI_MOBILE_DATA_TRANSITION_WAKELOCK_TIMEOUT_MS This constant was deprecated in API level 17. Use WIFI_MOBILE_DATA_TRANSITION_WAKELOCK_TIMEOUT_MS instead","String WIFI_NETWORKS_AVAILABLE_NOTIFICATION_ON This constant was deprecated in API level 17. Use WIFI_NETWORKS_AVAILABLE_NOTIFICATION_ON instead.","String WIFI_NETWORKS_AVAILABLE_REPEAT_DELAY This constant was deprecated in API level 17. Use WIFI_NETWORKS_AVAILABLE_REPEAT_DELAY instead.","String WIFI_NUM_OPEN_NETWORKS_KEPT This constant was deprecated in API level 17. Use WIFI_NUM_OPEN_NETWORKS_KEPT instead.","String WIFI_ON This constant was deprecated in API level 17. Use WIFI_ON instead.","String WIFI_WATCHDOG_ACCEPTABLE_PACKET_LOSS_PERCENTAGE This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_AP_COUNT This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_BACKGROUND_CHECK_DELAY_MS This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_BACKGROUND_CHECK_ENABLED This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_BACKGROUND_CHECK_TIMEOUT_MS This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_INITIAL_IGNORED_PING_COUNT This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_MAX_AP_CHECKS This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_ON This constant was deprecated in API level 17. Use WIFI_WATCHDOG_ON instead","String WIFI_WATCHDOG_PING_COUNT This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_PING_DELAY_MS This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_PING_TIMEOUT_MS This constant was deprecated in API level 14. This setting is not used.","String WIFI_WATCHDOG_WATCH_LIST This constant was deprecated in API level 14. This setting is not used.","[Expand] Inherited Constants","From class android.provider.Settings.NameValueTable String NAME String VALUE","String NAME","String VALUE","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"Settings.Secure","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for this table"]}