{"methods":["boolean hasSubMenu() Determines if this ActionProvider has a submenu associated with it.","View onCreateActionView() This method is deprecated. use onCreateActionView(MenuItem)","void onPrepareSubMenu(SubMenu subMenu) Called to prepare an associated submenu for the menu item backed by this ActionProvider.","void setOnShareTargetSelectedListener(ShareActionProvider.OnShareTargetSelectedListener listener) Sets a listener to be notified when a share target has been selected.","void setShareHistoryFileName(String shareHistoryFile) Sets the file name of a file for persisting the share history which history will be used for ordering share targets.","void setShareIntent(Intent shareIntent) Sets an intent with information about the share action.","[Expand] Inherited Methods","From class android.view.ActionProvider boolean hasSubMenu() Determines if this ActionProvider has a submenu associated with it. boolean isVisible() If overridesItemVisibility() returns true, the return value of this method will help determine the visibility of the MenuItem this ActionProvider is bound to. abstract View onCreateActionView() This method was deprecated in API level 16. use onCreateActionView(MenuItem) View onCreateActionView(MenuItem forItem) Factory method called by the Android framework to create new action views. boolean onPerformDefaultAction() Performs an optional default action. void onPrepareSubMenu(SubMenu subMenu) Called to prepare an associated submenu for the menu item backed by this ActionProvider. boolean overridesItemVisibility() The result of this method determines whether or not isVisible() will be used by the MenuItem this ActionProvider is bound to help determine its visibility. void refreshVisibility() If this ActionProvider is associated with an item in a menu, refresh the visibility of the item based on overridesItemVisibility() and isVisible(). void setVisibilityListener(ActionProvider.VisibilityListener listener) Set a listener to be notified when this ActionProvider's overridden visibility changes.","boolean hasSubMenu() Determines if this ActionProvider has a submenu associated with it.","boolean isVisible() If overridesItemVisibility() returns true, the return value of this method will help determine the visibility of the MenuItem this ActionProvider is bound to.","abstract View onCreateActionView() This method was deprecated in API level 16. use onCreateActionView(MenuItem)","View onCreateActionView(MenuItem forItem) Factory method called by the Android framework to create new action views.","boolean onPerformDefaultAction() Performs an optional default action.","void onPrepareSubMenu(SubMenu subMenu) Called to prepare an associated submenu for the menu item backed by this ActionProvider.","boolean overridesItemVisibility() The result of this method determines whether or not isVisible() will be used by the MenuItem this ActionProvider is bound to help determine its visibility.","void refreshVisibility() If this ActionProvider is associated with an item in a menu, refresh the visibility of the item based on overridesItemVisibility() and isVisible().","void setVisibilityListener(ActionProvider.VisibilityListener listener) Set a listener to be notified when this ActionProvider's overridden visibility changes.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.widget","constants":["String DEFAULT_SHARE_HISTORY_FILE_NAME The default name for storing share history."],"class":"ShareActionProvider","constructors":[],"fields":[]}