{"methods":["void performBackup(ParcelFileDescriptor oldState, BackupDataOutput data, ParcelFileDescriptor newState) Backs up the configured SharedPreferences groups.","void restoreEntity(BackupDataInputStream data) Restores one entity from the restore data stream to its proper shared preferences file store.","void writeNewStateDescription(ParcelFileDescriptor fd) Called by BackupAgentHelper after a restore operation to write the backup state file corresponding to the data as processed by the helper.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.app.backup.BackupHelper abstract void performBackup(ParcelFileDescriptor oldState, BackupDataOutput data, ParcelFileDescriptor newState) Based on oldState, determine what application content needs to be backed up, write it to data, and fill in newState with the complete state as it exists now. abstract void restoreEntity(BackupDataInputStream data) Called by BackupAgentHelper to restore a single entity from the restore data set. abstract void writeNewStateDescription(ParcelFileDescriptor newState) Called by BackupAgentHelper after a restore operation to write the backup state file corresponding to the data as processed by the helper.","abstract void performBackup(ParcelFileDescriptor oldState, BackupDataOutput data, ParcelFileDescriptor newState) Based on oldState, determine what application content needs to be backed up, write it to data, and fill in newState with the complete state as it exists now.","abstract void restoreEntity(BackupDataInputStream data) Called by BackupAgentHelper to restore a single entity from the restore data set.","abstract void writeNewStateDescription(ParcelFileDescriptor newState) Called by BackupAgentHelper after a restore operation to write the backup state file corresponding to the data as processed by the helper."],"package":"android.app.backup","constants":[],"class":"SharedPreferencesBackupHelper","constructors":[],"fields":[]}