{"methods":["static ShareCompat.IntentReader from(Activity activity) Get an IntentReader for parsing and interpreting the sharing intent used to start the given activity.","ComponentName getCallingActivity() Get the ComponentName of the Activity that invoked this sharing intent.","Drawable getCallingActivityIcon() Get the icon of the calling activity as a Drawable if data about the calling activity is available.","Drawable getCallingApplicationIcon() Get the icon of the calling application as a Drawable if data about the calling package is available.","CharSequence getCallingApplicationLabel() Get the human-readable label (title) of the calling application if data about the calling package is available.","String getCallingPackage() Get the name of the package that invoked this sharing intent.","String[] getEmailBcc() Get an array of Strings, each an email address to BCC on this share.","String[] getEmailCc() Get an array of Strings, each an email address to CC on this share.","String[] getEmailTo() Get an array of Strings, each an email address to share to.","String getHtmlText() Get the styled HTML text shared with the target activity.","Uri getStream(int index) Get the URI of a stream item shared with the target activity.","Uri getStream() Get a URI referring to a data stream shared with the target activity.","int getStreamCount() Return the number of stream items shared.","String getSubject() Get a subject heading for this share; useful when sharing via email.","CharSequence getText() Get the literal text shared with the target activity.","String getType() Get the mimetype of the data shared to this activity.","boolean isMultipleShare() Returns true if the activity this reader was obtained for was started with an ACTION_SEND_MULTIPLE intent.","boolean isShareIntent() Returns true if the activity this reader was obtained for was started with an ACTION_SEND or ACTION_SEND_MULTIPLE sharing Intent.","boolean isSingleShare() Returns true if the activity this reader was obtained for was started with an ACTION_SEND intent and contains a single shared item.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":[],"class":"ShareCompat.IntentReader","constructors":[],"fields":[]}