{"methods":["ShareCompat.IntentBuilder addEmailBcc(String[] addresses) Add an array of email addresses to be used in the \"bcc\" field of the final Intent.","ShareCompat.IntentBuilder addEmailBcc(String address) Add an email address to be used in the \"bcc\" field of the final Intent.","ShareCompat.IntentBuilder addEmailCc(String[] addresses) Add an array of email addresses to be used in the \"cc\" field of the final Intent.","ShareCompat.IntentBuilder addEmailCc(String address) Add an email address to be used in the \"cc\" field of the final Intent.","ShareCompat.IntentBuilder addEmailTo(String address) Add an email address to be used in the \"to\" field of the final Intent.","ShareCompat.IntentBuilder addEmailTo(String[] addresses) Add an array of email addresses to be used in the \"to\" field of the final Intent.","ShareCompat.IntentBuilder addStream(Uri streamUri) Add a stream URI to the data that should be shared.","Intent createChooserIntent() Create an Intent that will launch the standard Android activity chooser, allowing the user to pick what activity/app on the system should handle the share.","static ShareCompat.IntentBuilder from(Activity launchingActivity) Create a new IntentBuilder for launching a sharing action from launchingActivity.","Intent getIntent() Retrieve the Intent as configured so far by the IntentBuilder.","ShareCompat.IntentBuilder setChooserTitle(int resId) Set the title that will be used for the activity chooser for this share.","ShareCompat.IntentBuilder setChooserTitle(CharSequence title) Set the title that will be used for the activity chooser for this share.","ShareCompat.IntentBuilder setEmailBcc(String[] addresses) Set an array of email addresses to BCC on this share.","ShareCompat.IntentBuilder setEmailCc(String[] addresses) Set an array of email addresses to CC on this share.","ShareCompat.IntentBuilder setEmailTo(String[] addresses) Set an array of email addresses as recipients of this share.","ShareCompat.IntentBuilder setHtmlText(String htmlText) Set an HTML string to be sent as part of the share.","ShareCompat.IntentBuilder setStream(Uri streamUri) Set a stream URI to the data that should be shared.","ShareCompat.IntentBuilder setSubject(String subject) Set a subject heading for this share; useful for sharing via email.","ShareCompat.IntentBuilder setText(CharSequence text) Set the literal text data to be sent as part of the share.","ShareCompat.IntentBuilder setType(String mimeType) Set the type of data being shared","void startChooser() Start a chooser activity for the current share intent.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.app","constants":[],"class":"ShareCompat.IntentBuilder","constructors":[],"fields":[]}