{"methods":["Object clone() Creates and returns a copy of this Object.","abstract Object engineGetParameter(String param) This method was deprecated in API level 1. There is no generally accepted parameter naming convention.","AlgorithmParameters engineGetParameters() Returns the AlgorithmParameters of this SignatureSpi instance.","void engineInitSign(PrivateKey privateKey, SecureRandom random) Initializes this SignatureSpi instance for signing, using the private key of the identity whose signature is going to be generated and the specified source of randomness.","abstract void engineInitSign(PrivateKey privateKey) Initializes this SignatureSpi instance for signing, using the private key of the identity whose signature is going to be generated.","abstract void engineInitVerify(PublicKey publicKey) Initializes this SignatureSpi instance for signature verification, using the public key of the identity whose signature is going to be verified.","abstract void engineSetParameter(String param, Object value) This method was deprecated in API level 1. Use engineSetParameter(AlgorithmParameterSpec)","void engineSetParameter(AlgorithmParameterSpec params) Sets the specified AlgorithmParameterSpec.","int engineSign(byte[] outbuf, int offset, int len) Generates and stores the signature of all updated data in the provided byte[] at the specified position with the specified length.","abstract byte[] engineSign() Generates and returns the signature of all updated data.","abstract void engineUpdate(byte b) Updates the data to be verified or to be signed, using the specified byte.","void engineUpdate(ByteBuffer input) Updates the data to be verified or to be signed, using the specified ByteBuffer.","abstract void engineUpdate(byte[] b, int off, int len) Updates the data to be verified or to be signed, using the given byte[], starting form the specified index for the specified length.","boolean engineVerify(byte[] sigBytes, int offset, int length) Indicates whether the given sigBytes starting at index offset with length bytes can be verified using the public key or a certificate of the signer.","abstract boolean engineVerify(byte[] sigBytes) Indicates whether the given sigBytes can be verified using the public key or a certificate of the signer.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.security","constants":[],"class":"SignatureSpi","constructors":[],"fields":["protected SecureRandom appRandom Implementation specific source of randomness."]}