{"methods":["static SingleLineTransformationMethod getInstance()","char[] getOriginal() The characters to be replaced are \\n and \\r.","char[] getReplacement() The character \\n is replaced with is space; the character \\r is replaced with is FEFF (zero width space).","[Expand] Inherited Methods","From class android.text.method.ReplacementTransformationMethod abstract char[] getOriginal() Returns the list of characters that are to be replaced by other characters when displayed. abstract char[] getReplacement() Returns a parallel array of replacement characters for the ones that are to be replaced. CharSequence getTransformation(CharSequence source, View v) Returns a CharSequence that will mirror the contents of the source CharSequence but with the characters in getOriginal() replaced by ones from getReplacement(). void onFocusChanged(View view, CharSequence sourceText, boolean focused, int direction, Rect previouslyFocusedRect) This method is called when the TextView that uses this TransformationMethod gains or loses focus.","abstract char[] getOriginal() Returns the list of characters that are to be replaced by other characters when displayed.","abstract char[] getReplacement() Returns a parallel array of replacement characters for the ones that are to be replaced.","CharSequence getTransformation(CharSequence source, View v) Returns a CharSequence that will mirror the contents of the source CharSequence but with the characters in getOriginal() replaced by ones from getReplacement().","void onFocusChanged(View view, CharSequence sourceText, boolean focused, int direction, Rect previouslyFocusedRect) This method is called when the TextView that uses this TransformationMethod gains or loses focus.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.text.method.TransformationMethod abstract CharSequence getTransformation(CharSequence source, View view) Returns a CharSequence that is a transformation of the source text -- for example, replacing each character with a dot in a password field. abstract void onFocusChanged(View view, CharSequence sourceText, boolean focused, int direction, Rect previouslyFocusedRect) This method is called when the TextView that uses this TransformationMethod gains or loses focus.","abstract CharSequence getTransformation(CharSequence source, View view) Returns a CharSequence that is a transformation of the source text -- for example, replacing each character with a dot in a password field.","abstract void onFocusChanged(View view, CharSequence sourceText, boolean focused, int direction, Rect previouslyFocusedRect) This method is called when the TextView that uses this TransformationMethod gains or loses focus."],"package":"android.text.method","constants":[],"class":"SingleLineTransformationMethod","constructors":[],"fields":[]}