{"methods":["void close() Closes the connection in this pool entry.","void shutdown() Shuts down the connection in this pool entry.","[Expand] Inherited Methods","From class org.apache.http.impl.conn.AbstractPoolEntry Object getState() Returns the state object associated with this pool entry. void layerProtocol(HttpContext context, HttpParams params) Layers a protocol on top of an established tunnel. void open(HttpRoute route, HttpContext context, HttpParams params) Opens the underlying connection. void setState(Object state) Assigns a state object to this pool entry. void shutdownEntry() Shuts down the entry. void tunnelProxy(HttpHost next, boolean secure, HttpParams params) Tracks tunnelling of the connection to a chained proxy. void tunnelTarget(boolean secure, HttpParams params) Tracks tunnelling of the connection to the target.","Object getState() Returns the state object associated with this pool entry.","void layerProtocol(HttpContext context, HttpParams params) Layers a protocol on top of an established tunnel.","void open(HttpRoute route, HttpContext context, HttpParams params) Opens the underlying connection.","void setState(Object state) Assigns a state object to this pool entry.","void shutdownEntry() Shuts down the entry.","void tunnelProxy(HttpHost next, boolean secure, HttpParams params) Tracks tunnelling of the connection to a chained proxy.","void tunnelTarget(boolean secure, HttpParams params) Tracks tunnelling of the connection to the target.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"org.apache.http.impl.conn","constants":[],"class":"SingleClientConnManager.PoolEntry","constructors":[],"fields":[]}