{"methods":["void answerCall(int timeout) Answers a call.","void attachCall(SipSession session, String sessionDescription) Attaches an incoming call to this call object.","void close() Closes this object.","void continueCall(int timeout) Continues a call that's on hold.","void endCall() Ends a call.","SipProfile getLocalProfile() Gets the local SIP profile.","SipProfile getPeerProfile() Gets the peer's SIP profile.","int getState() Gets the state of the SipSession that carries this call.","void holdCall(int timeout) Puts a call on hold.","boolean isInCall() Checks if the call is established.","boolean isMuted() Checks if the call is muted.","boolean isOnHold() Checks if the call is on hold.","void makeCall(SipProfile peerProfile, SipSession sipSession, int timeout) Initiates an audio call to the specified profile.","void sendDtmf(int code, Message result) Sends a DTMF code.","void sendDtmf(int code) Sends a DTMF code.","void setListener(SipAudioCall.Listener listener) Sets the listener to listen to the audio call events.","void setListener(SipAudioCall.Listener listener, boolean callbackImmediately) Sets the listener to listen to the audio call events.","void setSpeakerMode(boolean speakerMode) Puts the device to speaker mode.","void startAudio() Starts the audio for the established call.","void toggleMute() Toggles mute.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.sip","constants":[],"class":"SipAudioCall","constructors":[],"fields":[]}