{"methods":["void answerCall(String sessionDescription, int timeout) Answers an incoming call with the specified session description.","void changeCall(String sessionDescription, int timeout) Changes the session description during a call.","void endCall() Ends an established call, terminates an outgoing call or rejects an incoming call.","String getCallId() Gets the call ID of the session.","String getLocalIp() Gets the IP address of the local host on which this SIP session runs.","SipProfile getLocalProfile() Gets the SIP profile that this session is associated with.","SipProfile getPeerProfile() Gets the SIP profile that this session is connected to.","int getState() Gets the session state.","boolean isInCall() Checks if the session is in a call.","void makeCall(SipProfile callee, String sessionDescription, int timeout) Initiates a call to the specified profile.","void register(int duration) Performs registration to the server specified by the associated local profile.","void setListener(SipSession.Listener listener) Sets the listener to listen to the session events.","void unregister() Performs unregistration to the server specified by the associated local profile.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.sip","constants":[],"class":"SipSession","constructors":[],"fields":[]}