{"methods":["void onCallBusy(SipSession session) Called when the peer is busy during session initialization.","void onCallChangeFailed(SipSession session, int errorCode, String errorMessage) Called when an error occurs during session modification negotiation.","void onCallEnded(SipSession session) Called when the session is terminated.","void onCallEstablished(SipSession session, String sessionDescription) Called when the session is established.","void onCalling(SipSession session) Called when an INVITE request is sent to initiate a new call.","void onError(SipSession session, int errorCode, String errorMessage) Called when an error occurs during session initialization and termination.","void onRegistering(SipSession session) Called when a registration request is sent.","void onRegistrationDone(SipSession session, int duration) Called when registration is successfully done.","void onRegistrationFailed(SipSession session, int errorCode, String errorMessage) Called when the registration fails.","void onRegistrationTimeout(SipSession session) Called when the registration gets timed out.","void onRinging(SipSession session, SipProfile caller, String sessionDescription) Called when an INVITE request is received.","void onRingingBack(SipSession session) Called when a RINGING response is received for the INVITE request sent","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.sip","constants":[],"class":"SipSession.Listener","constructors":[],"fields":[]}