{"methods":["static SmsMessage.MessageClass valueOf(String name)","final static MessageClass[] values()","[Expand] Inherited Methods","From class java.lang.Enum final Object clone() Enum objects are singletons, they may not be cloned. final int compareTo(E o) Compares this object to the specified enum object to determine their relative order. final boolean equals(Object other) Compares this object with the specified object and indicates if they are equal. final void finalize() Enum types may not have finalizers. final Class<E> getDeclaringClass() Returns the enum constant's declaring class. final int hashCode() Returns an integer hash code for this object. final String name() Returns the name of this enum constant. final int ordinal() Returns the position of the enum constant in the declaration. String toString() Returns a string containing a concise, human-readable description of this object. static <T extends Enum<T>> T valueOf(Class<T> enumType, String name) Returns the constant with the specified name of the specified enum type.","final Object clone() Enum objects are singletons, they may not be cloned.","final int compareTo(E o) Compares this object to the specified enum object to determine their relative order.","final boolean equals(Object other) Compares this object with the specified object and indicates if they are equal.","final void finalize() Enum types may not have finalizers.","final Class<E> getDeclaringClass() Returns the enum constant's declaring class.","final int hashCode() Returns an integer hash code for this object.","final String name() Returns the name of this enum constant.","final int ordinal() Returns the position of the enum constant in the declaration.","String toString() Returns a string containing a concise, human-readable description of this object.","static <T extends Enum<T>> T valueOf(Class<T> enumType, String name) Returns the constant with the specified name of the specified enum type.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"android.telephony","constants":[],"class":"SmsMessage.MessageClass","constructors":[],"fields":[]}