{"methods":["abstract PendingResult<Snapshots.CommitSnapshotResult> commitAndClose(GoogleApiClient apiClient, Snapshot snapshot, SnapshotMetadataChange metadataChange) Commit any modifications made to the snapshot.","abstract PendingResult<Snapshots.DeleteSnapshotResult> delete(GoogleApiClient apiClient, SnapshotMetadata metadata) Delete the specified snapshot.","abstract void discardAndClose(GoogleApiClient apiClient, Snapshot snapshot) Discard the contents of the snapshot and close the contents.","abstract int getMaxCoverImageSize(GoogleApiClient apiClient) Gets the maximum data size per snapshot cover image in bytes.","abstract int getMaxDataSize(GoogleApiClient apiClient) Gets the maximum data size per snapshot in bytes.","abstract Intent getSelectSnapshotIntent(GoogleApiClient apiClient, String title, boolean allowAddButton, boolean allowDelete, int maxSnapshots) Returns an intent that will let the user select a snapshot.","abstract SnapshotMetadata getSnapshotFromBundle(Bundle extras) This method takes a Bundle object and extracts the Snapshot provided.","abstract PendingResult<Snapshots.LoadSnapshotsResult> load(GoogleApiClient apiClient, boolean forceReload) Asynchronously load the snapshot data for the currently signed-in player.","abstract PendingResult<Snapshots.OpenSnapshotResult> open(GoogleApiClient apiClient, String fileName, boolean createIfNotFound) Open a snapshot with the given name.","abstract PendingResult<Snapshots.OpenSnapshotResult> open(GoogleApiClient apiClient, SnapshotMetadata metadata) Open a snapshot with the given metadata (usually returned from load(GoogleApiClient, boolean).","abstract PendingResult<Snapshots.OpenSnapshotResult> resolveConflict(GoogleApiClient apiClient, String conflictId, String snapshotId, SnapshotMetadataChange metadataChange, SnapshotContents snapshotContents) Resolve a conflict using the provided data.","abstract PendingResult<Snapshots.OpenSnapshotResult> resolveConflict(GoogleApiClient apiClient, String conflictId, Snapshot snapshot) Resolve a conflict using the data from the provided snapshot.","abstract PendingResult<Snapshots.OpenSnapshotResult> resolveConflict(GoogleApiClient apiClient, String conflictId, String snapshotId, SnapshotMetadataChange metadataChange, Contents contents) This method is deprecated. use resolveConflict(GoogleApiClient, String, String, SnapshotMetadataChange, SnapshotContents)"],"package":"com.google.android.gms.games.snapshot","constants":["int DISPLAY_LIMIT_NONE Constant passed to getSelectSnapshotIntent(GoogleApiClient, String, boolean, boolean, int) indicating that the UI should not cap the number of displayed snapshots.","String EXTRA_SNAPSHOT_METADATA Intent extra used to pass a SnapshotMetadata.","String EXTRA_SNAPSHOT_NEW Intent extra used to indicate the user wants to create a new snapshot."],"class":"Snapshots","constructors":[],"fields":[]}