{"methods":["final void autoPause() Pause all active streams.","final void autoResume() Resume all previously active streams.","int load(AssetFileDescriptor afd, int priority) Load the sound from an asset file descriptor.","int load(Context context, int resId, int priority) Load the sound from the specified APK resource.","int load(String path, int priority) Load the sound from the specified path.","int load(FileDescriptor fd, long offset, long length, int priority) Load the sound from a FileDescriptor.","final void pause(int streamID) Pause a playback stream.","final int play(int soundID, float leftVolume, float rightVolume, int priority, int loop, float rate) Play a sound from a sound ID.","final void release() Release the SoundPool resources.","final void resume(int streamID) Resume a playback stream.","final void setLoop(int streamID, int loop) Set loop mode.","void setOnLoadCompleteListener(SoundPool.OnLoadCompleteListener listener) Sets the callback hook for the OnLoadCompleteListener.","final void setPriority(int streamID, int priority) Change stream priority.","final void setRate(int streamID, float rate) Change playback rate.","final void setVolume(int streamID, float leftVolume, float rightVolume) Set stream volume.","final void stop(int streamID) Stop a playback stream.","final boolean unload(int soundID) Unload a sound from a sound ID.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media","constants":[],"class":"SoundPool","constructors":[],"fields":[]}