{"methods":["abstract View getDropDownView(int position, View convertView, ViewGroup parent) Get a View that displays in the drop down popup the data at the specified position in the data set.","[Expand] Inherited Methods","From interface android.widget.Adapter abstract int getCount() How many items are in the data set represented by this Adapter. abstract Object getItem(int position) Get the data item associated with the specified position in the data set. abstract long getItemId(int position) Get the row id associated with the specified position in the list. abstract int getItemViewType(int position) Get the type of View that will be created by getView(int, View, ViewGroup) for the specified item. abstract View getView(int position, View convertView, ViewGroup parent) Get a View that displays the data at the specified position in the data set. abstract int getViewTypeCount() Returns the number of types of Views that will be created by getView(int, View, ViewGroup). abstract boolean hasStableIds() Indicates whether the item ids are stable across changes to the underlying data. abstract boolean isEmpty() abstract void registerDataSetObserver(DataSetObserver observer) Register an observer that is called when changes happen to the data used by this adapter. abstract void unregisterDataSetObserver(DataSetObserver observer) Unregister an observer that has previously been registered with this adapter via registerDataSetObserver(DataSetObserver).","abstract int getCount() How many items are in the data set represented by this Adapter.","abstract Object getItem(int position) Get the data item associated with the specified position in the data set.","abstract long getItemId(int position) Get the row id associated with the specified position in the list.","abstract int getItemViewType(int position) Get the type of View that will be created by getView(int, View, ViewGroup) for the specified item.","abstract View getView(int position, View convertView, ViewGroup parent) Get a View that displays the data at the specified position in the data set.","abstract int getViewTypeCount() Returns the number of types of Views that will be created by getView(int, View, ViewGroup).","abstract boolean hasStableIds() Indicates whether the item ids are stable across changes to the underlying data.","abstract boolean isEmpty()","abstract void registerDataSetObserver(DataSetObserver observer) Register an observer that is called when changes happen to the data used by this adapter.","abstract void unregisterDataSetObserver(DataSetObserver observer) Unregister an observer that has previously been registered with this adapter via registerDataSetObserver(DataSetObserver)."],"package":"android.widget","constants":["[Expand] Inherited Constants","From interface android.widget.Adapter int IGNORE_ITEM_VIEW_TYPE An item view type that causes the AdapterView to ignore the item view. int NO_SELECTION","int IGNORE_ITEM_VIEW_TYPE An item view type that causes the AdapterView to ignore the item view.","int NO_SELECTION"],"class":"SpinnerAdapter","constructors":[],"fields":[]}