{"methods":["String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class android.database.sqlite.SQLiteProgram void bindAllArgsAsStrings(String[] bindArgs) Given an array of String bindArgs, this method binds all of them in one single call. void bindBlob(int index, byte[] value) Bind a byte array value to this statement. void bindDouble(int index, double value) Bind a double value to this statement. void bindLong(int index, long value) Bind a long value to this statement. void bindNull(int index) Bind a NULL value to this statement. void bindString(int index, String value) Bind a String value to this statement. void clearBindings() Clears all existing bindings. final int getUniqueId() This method was deprecated in API level 11. This method is deprecated and must not be used. void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close().","void bindAllArgsAsStrings(String[] bindArgs) Given an array of String bindArgs, this method binds all of them in one single call.","void bindBlob(int index, byte[] value) Bind a byte array value to this statement.","void bindDouble(int index, double value) Bind a double value to this statement.","void bindLong(int index, long value) Bind a long value to this statement.","void bindNull(int index) Bind a NULL value to this statement.","void bindString(int index, String value) Bind a String value to this statement.","void clearBindings() Clears all existing bindings.","final int getUniqueId() This method was deprecated in API level 11. This method is deprecated and must not be used.","void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close().","From class android.database.sqlite.SQLiteClosable void acquireReference() Acquires a reference to the object. void close() Releases a reference to the object, closing the object if the last reference was released. abstract void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close(). void onAllReferencesReleasedFromContainer() This method was deprecated in API level 16. Do not use. void releaseReference() Releases a reference to the object, closing the object if the last reference was released. void releaseReferenceFromContainer() This method was deprecated in API level 16. Do not use.","void acquireReference() Acquires a reference to the object.","void close() Releases a reference to the object, closing the object if the last reference was released.","abstract void onAllReferencesReleased() Called when the last reference to the object was released by a call to releaseReference() or close().","void onAllReferencesReleasedFromContainer() This method was deprecated in API level 16. Do not use.","void releaseReference() Releases a reference to the object, closing the object if the last reference was released.","void releaseReferenceFromContainer() This method was deprecated in API level 16. Do not use.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.io.Closeable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds.","From interface java.lang.AutoCloseable abstract void close() Closes the object and release any system resources it holds.","abstract void close() Closes the object and release any system resources it holds."],"package":"android.database.sqlite","constants":[],"class":"SQLiteQuery","constructors":[],"fields":[]}