{"methods":["abstract void writeArray(Array theArray) Write an SQL Array value into the output stream.","abstract void writeAsciiStream(InputStream theStream) Write a stream of ASCII characters into the output stream.","abstract void writeBigDecimal(BigDecimal theBigDecimal) Write a java.math.BigDecimal value into the output stream.","abstract void writeBinaryStream(InputStream theStream) Write a stream of uninterpreted bytes into the output stream.","abstract void writeBlob(Blob theBlob) Write an SQL Blob value into the output stream.","abstract void writeBoolean(boolean theFlag) Write a boolean value into the output stream.","abstract void writeByte(byte theByte) Write a byte value into the output stream.","abstract void writeBytes(byte[] theBytes) Write an array of bytes into the output stream.","abstract void writeCharacterStream(Reader theStream) Write a stream of unicode characters into the output stream.","abstract void writeClob(Clob theClob) Write an SQL Clob value into the output stream.","abstract void writeDate(Date theDate) Write a java.sql.Date value into the output stream.","abstract void writeDouble(double theDouble) Write a double value into the output stream.","abstract void writeFloat(float theFloat) Write a float value into the output stream.","abstract void writeInt(int theInt) Write an int value into the output stream.","abstract void writeLong(long theLong) Write a long value into the output stream.","abstract void writeNClob(NClob theNClob) Write a Clob into the output stream as an SQL NCLOB.","abstract void writeNString(String theString) Write a String into the output stream as an SQL NCHAR, NVARCHAR, or LONGNVARCHAR.","abstract void writeObject(SQLData theObject) Write an SQLData object into the output stream.","abstract void writeRef(Ref theRef) Write an SQL Ref value into the output stream.","abstract void writeRowId(RowId theRowId) Write a RowId into the output stream as an SQL ROWID.","abstract void writeSQLXML(SQLXML theXml) Write a SQLXML into the output stream as an SQL XML.","abstract void writeShort(short theShort) Write a short value into the output stream.","abstract void writeString(String theString) Write a String value into the output stream.","abstract void writeStruct(Struct theStruct) Write an SQL Struct value into the output stream.","abstract void writeTime(Time theTime) Write a java.sql.Time value into the output stream.","abstract void writeTimestamp(Timestamp theTimestamp) Write a java.sql.Timestamp value into the output stream.","abstract void writeURL(URL theURL) Write a URL into the output stream as an SQL DATALINK."],"package":"java.sql","constants":[],"class":"SQLOutput","constructors":[],"fields":[]}