{"methods":["[Expand] Inherited Methods","From class java.sql.SQLException int getErrorCode() Returns the integer error code for this SQLException. SQLException getNextException() Retrieves the SQLException chained to this SQLException, if any. String getSQLState() Retrieves the SQLState description string for this SQLException object. Iterator<Throwable> iterator() Obsolete. void setNextException(SQLException ex) Obsolete.","int getErrorCode() Returns the integer error code for this SQLException.","SQLException getNextException() Retrieves the SQLException chained to this SQLException, if any.","String getSQLState() Retrieves the SQLState description string for this SQLException object.","Iterator<Throwable> iterator() Obsolete.","void setNextException(SQLException ex) Obsolete.","From class java.lang.Throwable final void addSuppressed(Throwable throwable) Adds throwable to the list of throwables suppressed by this. Throwable fillInStackTrace() Records the stack trace from the point where this method has been called to this Throwable. Throwable getCause() Returns the cause of this Throwable, or null if there is no cause. String getLocalizedMessage() Returns the detail message which was provided when this Throwable was created. String getMessage() Returns the detail message which was provided when this Throwable was created. StackTraceElement[] getStackTrace() Returns a clone of the array of stack trace elements of this Throwable. final Throwable[] getSuppressed() Returns the throwables suppressed by this. Throwable initCause(Throwable throwable) Initializes the cause of this Throwable. void printStackTrace(PrintStream err) Writes a printable representation of this Throwable's stack trace to the given print stream. void printStackTrace(PrintWriter err) Writes a printable representation of this Throwable's stack trace to the specified print writer. void printStackTrace() Writes a printable representation of this Throwable's stack trace to the System.err stream. void setStackTrace(StackTraceElement[] trace) Sets the array of stack trace elements. String toString() Returns a string containing a concise, human-readable description of this object.","final void addSuppressed(Throwable throwable) Adds throwable to the list of throwables suppressed by this.","Throwable fillInStackTrace() Records the stack trace from the point where this method has been called to this Throwable.","Throwable getCause() Returns the cause of this Throwable, or null if there is no cause.","String getLocalizedMessage() Returns the detail message which was provided when this Throwable was created.","String getMessage() Returns the detail message which was provided when this Throwable was created.","StackTraceElement[] getStackTrace() Returns a clone of the array of stack trace elements of this Throwable.","final Throwable[] getSuppressed() Returns the throwables suppressed by this.","Throwable initCause(Throwable throwable) Initializes the cause of this Throwable.","void printStackTrace(PrintStream err) Writes a printable representation of this Throwable's stack trace to the given print stream.","void printStackTrace(PrintWriter err) Writes a printable representation of this Throwable's stack trace to the specified print writer.","void printStackTrace() Writes a printable representation of this Throwable's stack trace to the System.err stream.","void setStackTrace(StackTraceElement[] trace) Sets the array of stack trace elements.","String toString() Returns a string containing a concise, human-readable description of this object.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Iterable abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","abstract Iterator<T> iterator() Returns an Iterator for the elements in this object."],"package":"java.sql","constants":[],"class":"SQLTransientConnectionException","constructors":[],"fields":[]}