{"methods":["final SSLEngine createSSLEngine(String peerHost, int peerPort) Creates an SSLEngine instance from this context with the specified hostname and port.","final SSLEngine createSSLEngine() Creates an SSLEngine instance from this context.","final SSLSessionContext getClientSessionContext() Returns the SSL session context that encapsulates the set of SSL sessions that can be used for handshake of client-side SSL sockets.","static SSLContext getDefault() Returns the default SSLContext.","final SSLParameters getDefaultSSLParameters() Returns the default SSL handshake parameters for SSLSockets created by this SSLContext.","static SSLContext getInstance(String protocol, String provider) Creates a new SSLContext instance for the specified protocol from the specified provider.","static SSLContext getInstance(String protocol, Provider provider) Creates a new SSLContext instance for the specified protocol from the specified provider.","static SSLContext getInstance(String protocol) Creates a new SSLContext instance for the specified protocol.","final String getProtocol() Returns the name of the secure socket protocol of this instance.","final Provider getProvider() Returns the provider of this SSLContext instance.","final SSLSessionContext getServerSessionContext() Returns the SSL session context that encapsulates the set of SSL sessions that can be used for handshake of server-side SSL sockets.","final SSLServerSocketFactory getServerSocketFactory() Returns a server socket factory for this instance.","final SSLSocketFactory getSocketFactory() Returns a socket factory for this instance.","final SSLParameters getSupportedSSLParameters() Returns SSL handshake parameters for SSLSockets that includes all supported cipher suites and protocols.","final void init(KeyManager[] km, TrustManager[] tm, SecureRandom sr) Initializes this SSLContext instance.","static void setDefault(SSLContext sslContext) Sets the default SSLContext instance as returned by getDefault() to a non-null initialized value.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.net.ssl","constants":[],"class":"SSLContext","constructors":[],"fields":[]}