{"methods":["boolean addError(int error) Adds the supplied SSL error to the set.","SslCertificate getCertificate() Gets the SSL certificate associated with this object.","int getPrimaryError() Gets the most severe SSL error in this object's set of errors.","String getUrl() Gets the URL associated with this object.","boolean hasError(int error) Determines whether this object includes the supplied error.","String toString() Returns a string representation of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.http","constants":["int SSL_DATE_INVALID The date of the certificate is invalid","int SSL_EXPIRED The certificate has expired","int SSL_IDMISMATCH Hostname mismatch","int SSL_INVALID A generic error occurred","int SSL_MAX_ERROR This constant was deprecated in API level 14. This constant is not necessary for using the SslError API and can change from release to release.","int SSL_NOTYETVALID The certificate is not yet valid","int SSL_UNTRUSTED The certificate authority is not trusted"],"class":"SslError","constructors":[],"fields":[]}