{"methods":["abstract void beginHandshake() Initiates a handshake on this engine.","abstract void closeInbound() Notifies this engine instance that no more inbound network data will be sent to this engine.","abstract void closeOutbound() Notifies this engine instance that no more outbound application data will be sent to this engine.","abstract Runnable getDelegatedTask() Returns a delegate task for this engine instance.","abstract boolean getEnableSessionCreation() Returns whether new SSL sessions may be established by this engine.","abstract String[] getEnabledCipherSuites() Returns the SSL cipher suite names that are enabled in this engine instance.","abstract String[] getEnabledProtocols() Returns the protocol version names that are enabled in this engine instance.","abstract SSLEngineResult.HandshakeStatus getHandshakeStatus() Returns the status of the handshake of this engine instance.","abstract boolean getNeedClientAuth() Returns whether this engine instance will require client authentication.","String getPeerHost() Returns the name of the peer host.","int getPeerPort() Returns the port number of the peer host.","SSLParameters getSSLParameters() Returns a new SSLParameters based on this SSLSocket's current cipher suites, protocols, and client authentication settings.","abstract SSLSession getSession() Returns the SSL session for this engine instance.","abstract String[] getSupportedCipherSuites() Returns the SSL cipher suite names that are supported by this engine.","abstract String[] getSupportedProtocols() Returns the protocol names that are supported by this engine.","abstract boolean getUseClientMode() Returns whether this engine is set to act in client mode when handshaking.","abstract boolean getWantClientAuth() Returns whether this engine will request client authentication.","abstract boolean isInboundDone() Returns whether no more inbound data will be accepted by this engine.","abstract boolean isOutboundDone() Returns whether no more outbound data will be produced by this engine.","abstract void setEnableSessionCreation(boolean flag) Sets whether new SSL sessions may be established by this engine instance.","abstract void setEnabledCipherSuites(String[] suites) Sets the SSL cipher suite names that should be enabled in this engine instance.","abstract void setEnabledProtocols(String[] protocols) Sets the protocol version names that should be enabled in this engine instance.","abstract void setNeedClientAuth(boolean need) Sets whether this engine must require client authentication.","void setSSLParameters(SSLParameters p) Sets various SSL handshake parameters based on the SSLParameter argument.","abstract void setUseClientMode(boolean mode) Sets whether this engine should act in client (or server) mode when handshaking.","abstract void setWantClientAuth(boolean want) Sets whether this engine should request client authentication.","SSLEngineResult unwrap(ByteBuffer src, ByteBuffer dst) Decodes the incoming network data buffer into the application data buffer.","abstract SSLEngineResult unwrap(ByteBuffer src, ByteBuffer[] dsts, int offset, int length) Decodes the incoming network data buffer into application data buffers.","SSLEngineResult unwrap(ByteBuffer src, ByteBuffer[] dsts) Decodes the incoming network data buffer into the application data buffers.","SSLEngineResult wrap(ByteBuffer[] srcs, ByteBuffer dst) Encodes the outgoing application data buffers into the network data buffer.","abstract SSLEngineResult wrap(ByteBuffer[] srcs, int offset, int length, ByteBuffer dst) Encodes the outgoing application data buffers into the network data buffer.","SSLEngineResult wrap(ByteBuffer src, ByteBuffer dst) Encodes the outgoing application data buffer into the network data buffer.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.net.ssl","constants":[],"class":"SSLEngine","constructors":[],"fields":[]}