{"methods":["abstract int getApplicationBufferSize() Returns the maximum size that an application buffer can be for this session.","abstract String getCipherSuite() Returns the name of the cipher suite used in this session.","abstract long getCreationTime() Returns the time this session was created, in milliseconds since midnight January 1st 1970 UTC.","abstract byte[] getId() Returns this sessions identifier.","abstract long getLastAccessedTime() Returns the time this session was last accessed, in milliseconds since midnight January 1st 1970 UTC.","abstract Certificate[] getLocalCertificates() Returns the list of certificates that were used to identify the local side to the peer during the handshake.","abstract Principal getLocalPrincipal() Returns the principal used to identify the local side to the peer during the handshake.","abstract int getPacketBufferSize() Returns the maximum size that a network buffer can be for this session.","abstract X509Certificate[] getPeerCertificateChain() Returns the list of certificates the peer used to identify itself during the handshake.","abstract Certificate[] getPeerCertificates() Returns the list of certificates the peer used to identify itself during the handshake.","abstract String getPeerHost() Returns the host name of the peer of this session.","abstract int getPeerPort() Returns the port number of the peer of this session.","abstract Principal getPeerPrincipal() Returns the principal identifying the peer during the handshake.","abstract String getProtocol() Returns the protocol name that is used for all connections in this session.","abstract SSLSessionContext getSessionContext() Returns the context of this session, or null if no context is available.","abstract Object getValue(String name) Returns the object bound to the specified name in this session's application layer data.","abstract String[] getValueNames() Returns the list of the object names bound to this session's application layer data..","abstract void invalidate() Invalidates this session.","abstract boolean isValid() Returns whether this session is valid.","abstract void putValue(String name, Object value) Binds the specified object under the specified name in this session's application layer data.","abstract void removeValue(String name) Removes the binding for the specified name in this session's application layer data."],"package":"javax.net.ssl","constants":[],"class":"SSLSession","constructors":[],"fields":[]}