{"methods":["int getAvailableBlocks() This method was deprecated in API level 18. Use getAvailableBlocksLong() instead.","long getAvailableBlocksLong() The number of blocks that are free on the file system and available to applications.","long getAvailableBytes() The number of bytes that are free on the file system and available to applications.","int getBlockCount() This method was deprecated in API level 18. Use getBlockCountLong() instead.","long getBlockCountLong() The total number of blocks on the file system.","int getBlockSize() This method was deprecated in API level 18. Use getBlockSizeLong() instead.","long getBlockSizeLong() The size, in bytes, of a block on the file system.","int getFreeBlocks() This method was deprecated in API level 18. Use getFreeBlocksLong() instead.","long getFreeBlocksLong() The total number of blocks that are free on the file system, including reserved blocks (that are not available to normal applications).","long getFreeBytes() The number of bytes that are free on the file system, including reserved blocks (that are not available to normal applications).","long getTotalBytes() The total number of bytes supported by the file system.","void restat(String path) Perform a restat of the file system referenced by this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":[],"class":"StatFs","constructors":[],"fields":[]}