{"methods":["void animateTo(StreetViewPanoramaCamera camera, long duration) Changes the current camera position, orientation and zoom, to a given position over a specified duration","StreetViewPanoramaLocation getLocation() Returns the current location of the user and information regarding the current panorama's adjacent panoramas","StreetViewPanoramaCamera getPanoramaCamera() Returns the current orientation and zoom","boolean isPanningGesturesEnabled() Returns whether or not the panning gestures are enabled for the user","boolean isStreetNamesEnabled() Returns whether or not the street names appear on the panorama","boolean isUserNavigationEnabled() Returns whether or not the navigation is enabled for the user.","boolean isZoomGesturesEnabled() Returns whether or not the zoom gestures are enabled for the user","Point orientationToPoint(StreetViewPanoramaOrientation orientation) Returns a screen location that corresponds to an orientation (StreetViewPanoramaOrientation).","StreetViewPanoramaOrientation pointToOrientation(Point point) Returns the orientation that corresponds to a screen location.","final void setOnStreetViewPanoramaCameraChangeListener(StreetViewPanorama.OnStreetViewPanoramaCameraChangeListener listener) Sets a callback that's invoked when the camera changes","final void setOnStreetViewPanoramaChangeListener(StreetViewPanorama.OnStreetViewPanoramaChangeListener listener) Sets a callback that's invoked when the panorama changes","final void setOnStreetViewPanoramaClickListener(StreetViewPanorama.OnStreetViewPanoramaClickListener listener) Sets a callback that's invoked when the panorama is tapped.","void setPanningGesturesEnabled(boolean enablePanning) Sets whether the user is able to use panning gestures","void setPosition(LatLng position) Sets the StreetViewPanorama to a given location","void setPosition(String panoId) Sets the StreetViewPanorama to a given location","void setPosition(LatLng position, int radius) Sets the StreetViewPanorama to a given location","void setStreetNamesEnabled(boolean enableStreetNames) Sets whether the user is able to see street names on panoramas","void setUserNavigationEnabled(boolean enableUserNavigation) Sets whether the user is able to move to another panorama","void setZoomGesturesEnabled(boolean enableZoom) Sets whether the user is able to use zoom gestures","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.maps","constants":[],"class":"StreetViewPanorama","constructors":[],"fields":[]}