{"methods":["void commentChar(int ch) Specifies that the character ch shall be treated as a comment character.","void eolIsSignificant(boolean flag) Specifies whether the end of a line is significant and should be returned as TT_EOF in ttype by this tokenizer.","int lineno() Returns the current line number.","void lowerCaseMode(boolean flag) Specifies whether word tokens should be converted to lower case when they are stored in sval.","int nextToken() Parses the next token from this tokenizer's source stream or reader.","void ordinaryChar(int ch) Specifies that the character ch shall be treated as an ordinary character by this tokenizer.","void ordinaryChars(int low, int hi) Specifies that the characters in the range from low to hi shall be treated as an ordinary character by this tokenizer.","void parseNumbers() Specifies that this tokenizer shall parse numbers.","void pushBack() Indicates that the current token should be pushed back and returned again the next time nextToken() is called.","void quoteChar(int ch) Specifies that the character ch shall be treated as a quote character.","void resetSyntax() Specifies that all characters shall be treated as ordinary characters.","void slashSlashComments(boolean flag) Specifies whether \"slash-slash\" (C++-style) comments shall be recognized.","void slashStarComments(boolean flag) Specifies whether \"slash-star\" (C-style) comments shall be recognized.","String toString() Returns the state of this tokenizer in a readable format.","void whitespaceChars(int low, int hi) Specifies that the characters in the range from low to hi shall be treated as whitespace characters by this tokenizer.","void wordChars(int low, int hi) Specifies that the characters in the range from low to hi shall be treated as word characters by this tokenizer.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.io","constants":["int TT_EOF The constant representing the end of the stream.","int TT_EOL The constant representing the end of the line.","int TT_NUMBER The constant representing a number token.","int TT_WORD The constant representing a word token."],"class":"StreamTokenizer","constructors":[],"fields":["public double nval Contains a number if the current token is a number (ttype == TT_NUMBER).","public String sval Contains a string if the current token is a word (ttype == TT_WORD).","public int ttype After calling nextToken(), ttype contains the type of token that has been read."]}