{"methods":["boolean equals(Object obj) Check if this StreamConfigurationMap is equal to another StreamConfigurationMap.","Range[]<Integer> getHighSpeedVideoFpsRanges() Get a list of supported high speed video recording FPS ranges.","Range[]<Integer> getHighSpeedVideoFpsRangesFor(Size size) Get the frame per second ranges (fpsMin, fpsMax) for input high speed video size.","Size[] getHighSpeedVideoSizes() Get a list of supported high speed video recording sizes.","Size[] getHighSpeedVideoSizesFor(Range<Integer> fpsRange) Get the supported video sizes for input FPS range.","final int[] getOutputFormats() Get the image format output formats in this stream configuration.","<T> long getOutputMinFrameDuration(Class<T> klass, Size size) Get the minimum frame duration for the class/size combination (in nanoseconds).","long getOutputMinFrameDuration(int format, Size size) Get the minimum frame duration for the format/size combination (in nanoseconds).","<T> Size[] getOutputSizes(Class<T> klass) Get a list of sizes compatible with klass to use as an output.","Size[] getOutputSizes(int format) Get a list of sizes compatible with the requested image format.","<T> long getOutputStallDuration(Class<T> klass, Size size) Get the stall duration for the class/size combination (in nanoseconds).","long getOutputStallDuration(int format, Size size) Get the stall duration for the format/size combination (in nanoseconds).","int hashCode() Returns an integer hash code for this object.","boolean isOutputSupportedFor(int format) Determine whether or not output surfaces with a particular user-defined format can be passed createCaptureSession.","boolean isOutputSupportedFor(Surface surface) Determine whether or not the surface in its current state is suitable to be included in a capture session as an output.","static <T> boolean isOutputSupportedFor(Class<T> klass) Determine whether or not output streams can be configured with a particular class as a consumer.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware.camera2.params","constants":[],"class":"StreamConfigurationMap","constructors":[],"fields":[]}