{"methods":["StrictMode.VmPolicy build() Construct the VmPolicy instance.","StrictMode.VmPolicy.Builder detectActivityLeaks() Detect leaks of Activity subclasses.","StrictMode.VmPolicy.Builder detectAll() Detect everything that's potentially suspect.","StrictMode.VmPolicy.Builder detectFileUriExposure() Detect when a file:// Uri is exposed beyond this app.","StrictMode.VmPolicy.Builder detectLeakedClosableObjects() Detect when an Closeable or other object with a explict termination method is finalized without having been closed.","StrictMode.VmPolicy.Builder detectLeakedRegistrationObjects() Detect when a BroadcastReceiver or ServiceConnection is leaked during Context teardown.","StrictMode.VmPolicy.Builder detectLeakedSqlLiteObjects() Detect when an SQLiteCursor or other SQLite object is finalized without having been closed.","StrictMode.VmPolicy.Builder penaltyDeath() Crashes the whole process on violation.","StrictMode.VmPolicy.Builder penaltyDropBox() Enable detected violations log a stacktrace and timing data to the DropBox on policy violation.","StrictMode.VmPolicy.Builder penaltyLog() Log detected violations to the system log.","StrictMode.VmPolicy.Builder setClassInstanceLimit(Class klass, int instanceLimit) Set an upper bound on how many instances of a class can be in memory at once.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":[],"class":"StrictMode.VmPolicy.Builder","constructors":[],"fields":[]}