{"methods":["static StrictMode.ThreadPolicy allowThreadDiskReads() A convenience wrapper that takes the current StrictMode.ThreadPolicy from getThreadPolicy(), modifies it to permit disk reads, and sets the new policy with setThreadPolicy(StrictMode.ThreadPolicy), returning the old policy so you can restore it at the end of a block.","static StrictMode.ThreadPolicy allowThreadDiskWrites() A convenience wrapper that takes the current StrictMode.ThreadPolicy from getThreadPolicy(), modifies it to permit both disk reads & writes, and sets the new policy with setThreadPolicy(StrictMode.ThreadPolicy), returning the old policy so you can restore it at the end of a block.","static void enableDefaults() Enable the recommended StrictMode defaults, with violations just being logged.","static StrictMode.ThreadPolicy getThreadPolicy() Returns the current thread's policy.","static StrictMode.VmPolicy getVmPolicy() Gets the current VM policy.","static void noteSlowCall(String name) For code to note that it's slow.","static void setThreadPolicy(StrictMode.ThreadPolicy policy) Sets the policy for what actions on the current thread should be detected, as well as the penalty if such actions occur.","static void setVmPolicy(StrictMode.VmPolicy policy) Sets the policy for what actions in the VM process (on any thread) should be detected, as well as the penalty if such actions occur.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.os","constants":[],"class":"StrictMode","constructors":[],"fields":[]}