{"methods":["Object clone() Returns a new StringCharacterIterator with the same source string, begin, end, and current index as this iterator.","char current() Returns the character at the current index in the source string.","boolean equals(Object object) Compares the specified object with this StringCharacterIterator and indicates if they are equal.","char first() Sets the current position to the begin index and returns the character at the new position in the source string.","int getBeginIndex() Returns the begin index in the source string.","int getEndIndex() Returns the end index in the source string.","int getIndex() Returns the current index in the source string.","int hashCode() Returns an integer hash code for this object.","char last() Sets the current position to the end index - 1 and returns the character at the new position.","char next() Increments the current index and returns the character at the new index.","char previous() Decrements the current index and returns the character at the new index.","char setIndex(int location) Sets the current index in the source string.","void setText(String value) Sets the source string to iterate over.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.text.CharacterIterator abstract Object clone() Returns a new CharacterIterator with the same properties. abstract char current() Returns the character at the current index. abstract char first() Sets the current position to the begin index and returns the character at the new position. abstract int getBeginIndex() Returns the begin index. abstract int getEndIndex() Returns the end index. abstract int getIndex() Returns the current index. abstract char last() Sets the current position to the end index - 1 and returns the character at the new position. abstract char next() Increments the current index and returns the character at the new index. abstract char previous() Decrements the current index and returns the character at the new index. abstract char setIndex(int location) Sets the current index to a new position and returns the character at the new index.","abstract Object clone() Returns a new CharacterIterator with the same properties.","abstract char current() Returns the character at the current index.","abstract char first() Sets the current position to the begin index and returns the character at the new position.","abstract int getBeginIndex() Returns the begin index.","abstract int getEndIndex() Returns the end index.","abstract int getIndex() Returns the current index.","abstract char last() Sets the current position to the end index - 1 and returns the character at the new position.","abstract char next() Increments the current index and returns the character at the new index.","abstract char previous() Decrements the current index and returns the character at the new index.","abstract char setIndex(int location) Sets the current index to a new position and returns the character at the new index."],"package":"java.text","constants":["[Expand] Inherited Constants","From interface java.text.CharacterIterator char DONE A constant which indicates that there is no character at the current index.","char DONE A constant which indicates that there is no character at the current index."],"class":"StringCharacterIterator","constructors":[],"fields":[]}