{"methods":["static <T> T doAs(Subject subject, PrivilegedAction<T> action) Runs the code defined by action using the permissions granted to the Subject itself and to the code as well.","static <T> T doAs(Subject subject, PrivilegedExceptionAction<T> action) Runs the code defined by action using the permissions granted to the subject and to the code itself.","static <T> T doAsPrivileged(Subject subject, PrivilegedAction<T> action, AccessControlContext context) Run the code defined by action using the permissions granted to the Subject and to the code itself, additionally providing a more specific context.","static <T> T doAsPrivileged(Subject subject, PrivilegedExceptionAction<T> action, AccessControlContext context) Runs the code defined by action using the permissions granted to the subject and to the code itself, additionally providing a more specific context.","boolean equals(Object obj) Checks two Subjects for equality.","<T extends Principal> Set<T> getPrincipals(Class<T> c) Returns this Subject's Principal which is a subclass of the Class provided.","Set<Principal> getPrincipals() Returns this Subject's Principal.","<T> Set<T> getPrivateCredentials(Class<T> c) Returns this Subject's private credentials which are a subclass of the Class provided.","Set<Object> getPrivateCredentials() Returns the private credentials associated with this Subject.","<T> Set<T> getPublicCredentials(Class<T> c) Returns this Subject's public credentials which are a subclass of the Class provided.","Set<Object> getPublicCredentials() Returns the public credentials associated with this Subject.","static Subject getSubject(AccessControlContext context) Returns the Subject that was last associated with the context provided as argument.","int hashCode() Returns a hash code of this Subject.","boolean isReadOnly() Returns whether this Subject is read-only or not.","void setReadOnly() Prevents from modifications being done to the credentials and Principal sets.","String toString() Returns a String representation of this Subject.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.security.auth","constants":[],"class":"Subject","constructors":[],"fields":[]}