{"methods":["static void arraycopy(Object src, int srcPos, Object dst, int dstPos, int length) Copies length elements from the array src, starting at offset srcPos, into the array dst, starting at offset dstPos.","static String clearProperty(String name) Removes a specific system property.","static Console console() Returns the Console associated with this VM, or null.","static long currentTimeMillis() Returns the current time in milliseconds since January 1, 1970 00:00:00.0 UTC.","static void exit(int code) Causes the VM to stop running and the program to exit with the given exit status.","static void gc() Indicates to the VM that it would be a good time to run the garbage collector.","static Properties getProperties() Returns the system properties.","static String getProperty(String propertyName) Returns the value of a particular system property or null if no such property exists.","static String getProperty(String name, String defaultValue) Returns the value of a particular system property.","static SecurityManager getSecurityManager() Returns null.","static String getenv(String name) Returns the value of the environment variable with the given name, or null if no such variable exists.","static Map<String, String> getenv() Returns an unmodifiable map of all environment variables to their values.","static int identityHashCode(Object anObject) Returns an integer hash code for the parameter.","static Channel inheritedChannel() Returns the inherited channel from the creator of the current virtual machine.","static String lineSeparator() Returns the system's line separator.","static void load(String pathName) See load(String).","static void loadLibrary(String libName) See loadLibrary(String).","static String mapLibraryName(String nickname) Returns the platform specific file name format for the shared library named by the argument.","static long nanoTime() Returns the current timestamp of the most precise timer available on the local system, in nanoseconds.","static void runFinalization() Provides a hint to the VM that it would be useful to attempt to perform any outstanding object finalization.","static void runFinalizersOnExit(boolean flag) This method was deprecated in API level 1. This method is unsafe.","static void setErr(PrintStream newErr) Sets the standard error output stream to the given user defined output stream.","static void setIn(InputStream newIn) Sets the standard input stream to the given user defined input stream.","static void setOut(PrintStream newOut) Sets the standard output stream to the given user defined output stream.","static void setProperties(Properties p) Attempts to set all system properties.","static String setProperty(String name, String value) Sets the value of a particular system property.","static void setSecurityManager(SecurityManager sm) Throws SecurityException.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.lang","constants":[],"class":"System","constructors":[],"fields":["public static final PrintStream err Default error output stream.","public static final InputStream in Default input stream.","public static final PrintStream out Default output stream."]}