{"methods":["void setBaseAttributes(TypedArray a, int widthAttr, int heightAttr) Extracts the layout parameters from the supplied attributes.","[Expand] Inherited Methods","From class android.widget.LinearLayout.LayoutParams String debug(String output) Returns a String representation of this set of layout parameters.","String debug(String output) Returns a String representation of this set of layout parameters.","From class android.view.ViewGroup.MarginLayoutParams int getLayoutDirection() Retuns the layout direction. int getMarginEnd() Returns the end margin in pixels. int getMarginStart() Returns the start margin in pixels. boolean isMarginRelative() Check if margins are relative. void resolveLayoutDirection(int layoutDirection) This will be called by requestLayout(). void setLayoutDirection(int layoutDirection) Set the layout direction void setMarginEnd(int end) Sets the relative end margin. void setMarginStart(int start) Sets the relative start margin. void setMargins(int left, int top, int right, int bottom) Sets the margins, in pixels.","int getLayoutDirection() Retuns the layout direction.","int getMarginEnd() Returns the end margin in pixels.","int getMarginStart() Returns the start margin in pixels.","boolean isMarginRelative() Check if margins are relative.","void resolveLayoutDirection(int layoutDirection) This will be called by requestLayout().","void setLayoutDirection(int layoutDirection) Set the layout direction","void setMarginEnd(int end) Sets the relative end margin.","void setMarginStart(int start) Sets the relative start margin.","void setMargins(int left, int top, int right, int bottom) Sets the margins, in pixels.","From class android.view.ViewGroup.LayoutParams void resolveLayoutDirection(int layoutDirection) Resolve layout parameters depending on the layout direction. void setBaseAttributes(TypedArray a, int widthAttr, int heightAttr) Extracts the layout parameters from the supplied attributes.","void resolveLayoutDirection(int layoutDirection) Resolve layout parameters depending on the layout direction.","void setBaseAttributes(TypedArray a, int widthAttr, int heightAttr) Extracts the layout parameters from the supplied attributes.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.widget","constants":["[Expand] Inherited Constants","From class android.view.ViewGroup.LayoutParams int FILL_PARENT Special value for the height or width requested by a View. int MATCH_PARENT Special value for the height or width requested by a View. int WRAP_CONTENT Special value for the height or width requested by a View.","int FILL_PARENT Special value for the height or width requested by a View.","int MATCH_PARENT Special value for the height or width requested by a View.","int WRAP_CONTENT Special value for the height or width requested by a View."],"class":"TableRow.LayoutParams","constructors":[],"fields":["public int column The column index of the cell represented by the widget.","public int span The number of columns the widgets spans over."]}