{"methods":["void dispatch() Manually dispatches queued events (tracking pixels, etc) if a network connection is available.","DataLayer getDataLayer() Returns the data layer object that is used by the tag manager.","static TagManager getInstance(Context context) Get the singleton instance of the TagManager class, creating it if necessary.","PendingResult<ContainerHolder> loadContainerDefaultOnly(String containerId, int defaultContainerResourceId, Handler handler) The ContainerHolder will be available from the returned PendingResult as soon as either of the following happens: the default container is loaded, or no default container is found.","PendingResult<ContainerHolder> loadContainerDefaultOnly(String containerId, int defaultContainerResourceId) The ContainerHolder will be available from the returned PendingResult as soon as either of the following happens: the default container is loaded, or no default container is found.","PendingResult<ContainerHolder> loadContainerPreferFresh(String containerId, int defaultContainerResourceId) The ContainerHolder will be available from the returned PendingResult as soon as one of the following happens: a saved container which has been recently refreshed is loaded, a network container is loaded or a network error occurs, or a timeout occurs (as specified in await(long, java.util.concurrent.TimeUnit), or setResultCallback(com.google.android.gms.common.api.ResultCallback, long, java.util.concurrent.TimeUnit).","PendingResult<ContainerHolder> loadContainerPreferFresh(String containerId, int defaultContainerResourceId, Handler handler) The ContainerHolder will be available from the returned PendingResult as soon as one of the following happens: a saved container which has been recently refreshed is loaded, a network container is loaded or a network error occurs, or a timeout occurs (as specified in await(long, java.util.concurrent.TimeUnit), or setResultCallback(com.google.android.gms.common.api.ResultCallback, long, java.util.concurrent.TimeUnit).","PendingResult<ContainerHolder> loadContainerPreferNonDefault(String containerId, int defaultContainerResourceId) The ContainerHolder will be available from the returned PendingResult as soon as one of the following happens: a saved container is loaded, or if there is no saved container, a network container is loaded or a network error occurs, or a timeout occurs (as specified in await(long, java.util.concurrent.TimeUnit), or setResultCallback(com.google.android.gms.common.api.ResultCallback, long, java.util.concurrent.TimeUnit).","PendingResult<ContainerHolder> loadContainerPreferNonDefault(String containerId, int defaultContainerResourceId, Handler handler) The ContainerHolder will be available from the returned PendingResult as soon as one of the following happens: a saved container is loaded, if there is no saved container, a network container is loaded or a network error occurs, or a timeout occurs (as specified in await(long, java.util.concurrent.TimeUnit), or setResultCallback(com.google.android.gms.common.api.ResultCallback, long, java.util.concurrent.TimeUnit).","void setVerboseLoggingEnabled(boolean enableVerboseLogging) Sets whether or not verbose logging is enabled.","[Expand] Inherited Methods","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.tagmanager","constants":[],"class":"TagManager","constructors":[],"fields":[]}