{"methods":["TaskStackBuilder addNextIntent(Intent nextIntent) Add a new Intent to the task stack.","TaskStackBuilder addNextIntentWithParentStack(Intent nextIntent) Add a new Intent with the resolved chain of parents for the target activity to the task stack.","TaskStackBuilder addParentStack(Activity sourceActivity) Add the activity parent chain as specified by manifest <meta-data> elements to the task stack builder.","TaskStackBuilder addParentStack(ComponentName sourceActivityName) Add the activity parent chain as specified by manifest <meta-data> elements to the task stack builder.","TaskStackBuilder addParentStack(Class<?> sourceActivityClass) Add the activity parent chain as specified by manifest <meta-data> elements to the task stack builder.","static TaskStackBuilder create(Context context) Return a new TaskStackBuilder for launching a fresh task stack consisting of a series of activities.","Intent editIntentAt(int index) Return the intent at the specified index for modification.","static TaskStackBuilder from(Context context) This method is deprecated. use create(Context) instead","Intent getIntent(int index) This method is deprecated. Renamed to editIntentAt to better reflect intended usage","int getIntentCount()","Intent[] getIntents() Return an array containing the intents added to this builder.","PendingIntent getPendingIntent(int requestCode, int flags) Obtain a PendingIntent for launching the task constructed by this builder so far.","PendingIntent getPendingIntent(int requestCode, int flags, Bundle options) Obtain a PendingIntent for launching the task constructed by this builder so far.","Iterator<Intent> iterator() This method is deprecated. Use editIntentAt instead","void startActivities(Bundle options) Start the task stack constructed by this builder.","void startActivities() Start the task stack constructed by this builder.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Iterable abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","abstract Iterator<T> iterator() Returns an Iterator for the elements in this object."],"package":"android.support.v4.app","constants":[],"class":"TaskStackBuilder","constructors":[],"fields":[]}