{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["int BROADCAST_THREAD Thread type: broadcast thread.","int COMMON_THREAD Thread type: common thread.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.Telephony.ThreadsColumns String ARCHIVED If the thread is archived Type: INTEGER (boolean) String DATE The date at which the thread was created. String ERROR Indicates whether there is a transmission error in the thread. String HAS_ATTACHMENT Indicates whether this thread contains any attachments. String MESSAGE_COUNT The message count of the thread. String READ Indicates whether all messages of the thread have been read. String RECIPIENT_IDS A string encoding of the recipient IDs of the recipients of the message, in numerical order and separated by spaces. String SNIPPET The snippet of the latest message in the thread. String SNIPPET_CHARSET The charset of the snippet. String TYPE Type of the thread, either COMMON_THREAD or BROADCAST_THREAD.","String ARCHIVED If the thread is archived Type: INTEGER (boolean)","String DATE The date at which the thread was created.","String ERROR Indicates whether there is a transmission error in the thread.","String HAS_ATTACHMENT Indicates whether this thread contains any attachments.","String MESSAGE_COUNT The message count of the thread.","String READ Indicates whether all messages of the thread have been read.","String RECIPIENT_IDS A string encoding of the recipient IDs of the recipients of the message, in numerical order and separated by spaces.","String SNIPPET The snippet of the latest message in the thread.","String SNIPPET_CHARSET The charset of the snippet.","String TYPE Type of the thread, either COMMON_THREAD or BROADCAST_THREAD."],"class":"Telephony.Threads","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for this table, by conversation.","public static final Uri OBSOLETE_THREADS_URI The content:// style URL for this table, for obsolete threads."]}