{"methods":["void cancelMissedCallsNotification() Removes the missed-call notification if one is present.","boolean handleMmi(String dialString) Processes the specified dial string as an MMI code.","boolean isInCall() Returns whether there is an ongoing phone call (can be in dialing, ringing, active or holding states).","void showInCallScreen(boolean showDialpad) Brings the in-call screen to the foreground if there is an ongoing call.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.telecom","constants":["String ACTION_SHOW_CALL_SETTINGS The Intent action used to show the call settings page.","char DTMF_CHARACTER_PAUSE The dual tone multi-frequency signaling character sent to indicate the dialing system should pause for a predefined period.","char DTMF_CHARACTER_WAIT The dual-tone multi-frequency signaling character sent to indicate the dialing system should wait for user confirmation before proceeding.","String EXTRA_CALL_DISCONNECT_CAUSE Optional extra for ACTION_PHONE_STATE_CHANGED containing the disconnect code.","String EXTRA_CALL_DISCONNECT_MESSAGE Optional extra for ACTION_PHONE_STATE_CHANGED containing the disconnect message.","String EXTRA_START_CALL_WITH_SPEAKERPHONE Optional extra for ACTION_CALL containing a boolean that determines whether the speakerphone should be automatically turned on for an outgoing call.","String GATEWAY_ORIGINAL_ADDRESS An optional ACTION_CALL intent extra corresponding to the original address to dial for the call.","String GATEWAY_PROVIDER_PACKAGE An optional ACTION_CALL intent extra denoting the package name of the app specifying an alternative gateway for the call.","int PRESENTATION_ALLOWED Property is displayed normally.","int PRESENTATION_PAYPHONE Property should be displayed as a pay phone.","int PRESENTATION_RESTRICTED Property was blocked.","int PRESENTATION_UNKNOWN Presentation was not specified or is unknown."],"class":"TelecomManager","constructors":[],"fields":[]}