{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String DEFAULT_SORT_ORDER The default sort order for this table.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.Telephony.BaseMmsColumns String CONTENT_CLASS The content-class of the message. String CONTENT_LOCATION The Content-Location of the message. String CONTENT_TYPE The Content-Type of the message. String CREATOR The identity of the sender of a sent message. String DATE The date the message was received. String DATE_SENT The date the message was sent. String DELIVERY_REPORT The delivery-report of the message. String DELIVERY_TIME The delivery-time of the message. String EXPIRY The expiry time of the message. String LOCKED Is the message locked? Type: INTEGER (boolean) String MESSAGE_BOX The box which the message belongs to, e.g. int MESSAGE_BOX_ALL Message box: all messages. int MESSAGE_BOX_DRAFTS Message box: drafts. int MESSAGE_BOX_FAILED Message box: failed. int MESSAGE_BOX_INBOX Message box: inbox. int MESSAGE_BOX_OUTBOX Message box: outbox. int MESSAGE_BOX_SENT Message box: sent messages. String MESSAGE_CLASS The class of the message. String MESSAGE_ID The Message-ID of the message. String MESSAGE_SIZE The size of the message. String MESSAGE_TYPE The type of the message defined by MMS spec. String MMS_VERSION The version of the specification that this message conforms to. String PRIORITY The priority of the message. String READ Has the message been read? Type: INTEGER (boolean) String READ_REPORT The read-report of the message. String READ_STATUS The read-status of the message. String REPORT_ALLOWED Is read report allowed? Type: INTEGER (boolean) String RESPONSE_STATUS The response-status of the message. String RESPONSE_TEXT The response-text of the message. String RETRIEVE_STATUS The retrieve-status of the message. String RETRIEVE_TEXT The retrieve-text of the message. String RETRIEVE_TEXT_CHARSET The character set of the retrieve-text. String SEEN Has the message been seen by the user? The \"seen\" flag determines whether we need to show a new message notification. String STATUS The status of the message. String SUBJECT The subject of the message, if present. String SUBJECT_CHARSET The character set of the subject, if present. String TEXT_ONLY Does the message have only a text part (can also have a subject) with no picture, slideshow, sound, etc. String THREAD_ID The thread ID of the message. String TRANSACTION_ID The transaction-id of the message.","String CONTENT_CLASS The content-class of the message.","String CONTENT_LOCATION The Content-Location of the message.","String CONTENT_TYPE The Content-Type of the message.","String CREATOR The identity of the sender of a sent message.","String DATE The date the message was received.","String DATE_SENT The date the message was sent.","String DELIVERY_REPORT The delivery-report of the message.","String DELIVERY_TIME The delivery-time of the message.","String EXPIRY The expiry time of the message.","String LOCKED Is the message locked? Type: INTEGER (boolean)","String MESSAGE_BOX The box which the message belongs to, e.g.","int MESSAGE_BOX_ALL Message box: all messages.","int MESSAGE_BOX_DRAFTS Message box: drafts.","int MESSAGE_BOX_FAILED Message box: failed.","int MESSAGE_BOX_INBOX Message box: inbox.","int MESSAGE_BOX_OUTBOX Message box: outbox.","int MESSAGE_BOX_SENT Message box: sent messages.","String MESSAGE_CLASS The class of the message.","String MESSAGE_ID The Message-ID of the message.","String MESSAGE_SIZE The size of the message.","String MESSAGE_TYPE The type of the message defined by MMS spec.","String MMS_VERSION The version of the specification that this message conforms to.","String PRIORITY The priority of the message.","String READ Has the message been read? Type: INTEGER (boolean)","String READ_REPORT The read-report of the message.","String READ_STATUS The read-status of the message.","String REPORT_ALLOWED Is read report allowed? Type: INTEGER (boolean)","String RESPONSE_STATUS The response-status of the message.","String RESPONSE_TEXT The response-text of the message.","String RETRIEVE_STATUS The retrieve-status of the message.","String RETRIEVE_TEXT The retrieve-text of the message.","String RETRIEVE_TEXT_CHARSET The character set of the retrieve-text.","String SEEN Has the message been seen by the user? The \"seen\" flag determines whether we need to show a new message notification.","String STATUS The status of the message.","String SUBJECT The subject of the message, if present.","String SUBJECT_CHARSET The character set of the subject, if present.","String TEXT_ONLY Does the message have only a text part (can also have a subject) with no picture, slideshow, sound, etc.","String THREAD_ID The thread ID of the message.","String TRANSACTION_ID The transaction-id of the message."],"class":"Telephony.Mms.Inbox","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for this table."]}