{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String APN APN name.","String AUTH_TYPE Authentication type.","String BEARER Radio Access Technology info.","String CARRIER_ENABLED Is this APN enabled? Type: INTEGER (boolean)","String CURRENT Is this the current APN? Type: INTEGER (boolean)","String DEFAULT_SORT_ORDER The default sort order for this table.","String MCC Mobile Country Code (MCC).","String MMSC MMSC URL.","String MMSPORT MMS proxy port.","String MMSPROXY MMS proxy address.","String MNC Mobile Network Code (MNC).","String MVNO_MATCH_DATA MVNO data.","String MVNO_TYPE MVNO type: SPN (Service Provider Name), IMSI, GID (Group Identifier Level 1).","String NAME Entry name.","String NUMERIC Numeric operator ID (as String).","String PASSWORD APN password.","String PORT Proxy port.","String PROTOCOL The protocol to use to connect to this APN.","String PROXY Proxy address.","String ROAMING_PROTOCOL The protocol to use to connect to this APN when roaming.","String SERVER Server address.","String TYPE Comma-delimited list of APN types.","String USER APN username.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"Telephony.Carriers","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URL for this table."]}