{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["int ERR_TYPE_GENERIC Error type: generic transient error.","int ERR_TYPE_GENERIC_PERMANENT Error type: permanent error (along with all higher error values).","int ERR_TYPE_MMS_PROTO_PERMANENT Error type: MMS protocol permanent error.","int ERR_TYPE_MMS_PROTO_TRANSIENT Error type: MMS protocol transient error.","int ERR_TYPE_SMS_PROTO_PERMANENT Error type: SMS protocol permanent error.","int ERR_TYPE_SMS_PROTO_TRANSIENT Error type: SMS protocol transient error.","int ERR_TYPE_TRANSPORT_FAILURE Error type: transport failure.","int MMS_PROTO MMS protocol type.","int NO_ERROR Error type: no error.","int SMS_PROTO SMS protocol type.","String TYPE_DISCRIMINATOR_COLUMN The column to distinguish SMS and MMS messages in query results.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"Telephony.MmsSms","constructors":[],"fields":["public static final Uri CONTENT_CONVERSATIONS_URI The content:// style URL for this table, by conversation.","public static final Uri CONTENT_DRAFT_URI The content:// style URL for draft messages in this table.","public static final Uri CONTENT_FILTER_BYPHONE_URI The content:// style URL for this table, by phone number.","public static final Uri CONTENT_LOCKED_URI The content:// style URL for locked messages in this table.","public static final Uri CONTENT_UNDELIVERED_URI The content:// style URL for undelivered messages in this table.","public static final Uri CONTENT_URI The content:// style URL for this table.","public static final Uri SEARCH_URI Pass in a query parameter called \"pattern\" which is the text to search for."]}