{"methods":["static SmsMessage[] getMessagesFromIntent(Intent intent) Read the PDUs out of an SMS_RECEIVED_ACTION or a DATA_SMS_RECEIVED_ACTION intent.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String ACTION_CHANGE_DEFAULT Activity action: Ask the user to change the default SMS application.","String DATA_SMS_RECEIVED_ACTION Broadcast Action: A new data based SMS message has been received by the device.","String EXTRA_PACKAGE_NAME The PackageName string passed in as an extra for ACTION_CHANGE_DEFAULT","int RESULT_SMS_DUPLICATED Set by BroadcastReceiver to indicate a duplicate incoming message.","int RESULT_SMS_GENERIC_ERROR Set by BroadcastReceiver to indicate a generic error while processing the message.","int RESULT_SMS_HANDLED Set by BroadcastReceiver to indicate that the message was handled successfully.","int RESULT_SMS_OUT_OF_MEMORY Set by BroadcastReceiver to indicate insufficient memory to store the message.","int RESULT_SMS_UNSUPPORTED Set by BroadcastReceiver to indicate that the message, while possibly valid, is of a format or encoding that is not supported.","String SIM_FULL_ACTION Broadcast Action: The SIM storage for SMS messages is full.","String SMS_CB_RECEIVED_ACTION Broadcast Action: A new Cell Broadcast message has been received by the device.","String SMS_DELIVER_ACTION Broadcast Action: A new text-based SMS message has been received by the device.","String SMS_EMERGENCY_CB_RECEIVED_ACTION Broadcast Action: A new Emergency Broadcast message has been received by the device.","String SMS_RECEIVED_ACTION Broadcast Action: A new text-based SMS message has been received by the device.","String SMS_REJECTED_ACTION Broadcast Action: An incoming SMS has been rejected by the telephony framework.","String SMS_SERVICE_CATEGORY_PROGRAM_DATA_RECEIVED_ACTION Broadcast Action: A new CDMA SMS has been received containing Service Category Program Data (updates the list of enabled broadcast channels).","String WAP_PUSH_DELIVER_ACTION Broadcast Action: A new WAP PUSH message has been received by the device.","String WAP_PUSH_RECEIVED_ACTION Broadcast Action: A new WAP PUSH message has been received by the device."],"class":"Telephony.Sms.Intents","constructors":[],"fields":[]}