{"methods":["final TestSuiteBuilder addRequirements(Predicate...<TestMethod> predicates) Exclude tests that fail to satisfy all of the given predicates.","TestSuiteBuilder addRequirements(List<Predicate<TestMethod>> predicates) Exclude tests that fail to satisfy all of the given predicates.","final TestSuite build() Call this method once you've configured your builder as desired.","TestSuiteBuilder excludePackages(String... packageNames) Exclude all tests in the given packages and all sub-packages, unless otherwise specified.","final TestSuiteBuilder includeAllPackagesUnderHere() Include all junit tests that satisfy the requirements in the calling class' package and all sub-packages.","TestSuiteBuilder includePackages(String... packageNames) Include all tests that satisfy the requirements in the given packages and all sub-packages, unless otherwise specified.","TestSuiteBuilder named(String newSuiteName) Override the default name for the suite being built.","String getSuiteName() Subclasses use this method to determine the name of the suite.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.test.suitebuilder","constants":[],"class":"TestSuiteBuilder","constructors":[],"fields":[]}