{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.speech.tts","constants":["String ACTION_CHECK_TTS_DATA Activity Action: Starts the activity from the platform TextToSpeech engine to verify the proper installation and availability of the resource files on the system.","String ACTION_GET_SAMPLE_TEXT Activity intent for getting some sample text to use for demonstrating TTS.","String ACTION_INSTALL_TTS_DATA Activity Action: Triggers the platform TextToSpeech engine to start the activity that installs the resource files on the device that are required for TTS to be operational.","String ACTION_TTS_DATA_INSTALLED Broadcast Action: broadcast to signal the change in the list of available languages or/and their features.","int CHECK_VOICE_DATA_BAD_DATA This constant was deprecated in API level 18. Use CHECK_VOICE_DATA_FAIL instead.","int CHECK_VOICE_DATA_FAIL Indicates failure when checking the installation status of the resources used by the TextToSpeech engine with the ACTION_CHECK_TTS_DATA intent.","int CHECK_VOICE_DATA_MISSING_DATA This constant was deprecated in API level 18. Use CHECK_VOICE_DATA_FAIL instead.","int CHECK_VOICE_DATA_MISSING_VOLUME This constant was deprecated in API level 18. Use CHECK_VOICE_DATA_FAIL instead.","int CHECK_VOICE_DATA_PASS Indicates success when checking the installation status of the resources used by the TextToSpeech engine with the ACTION_CHECK_TTS_DATA intent.","int DEFAULT_STREAM Default audio stream used when playing synthesized speech.","String EXTRA_AVAILABLE_VOICES Extra information received with the ACTION_CHECK_TTS_DATA intent result where the TextToSpeech engine returns an ArrayList of all the available voices.","String EXTRA_CHECK_VOICE_DATA_FOR This constant was deprecated in API level 18. Redundant functionality, checking for existence of specific sets of voice data can be done on client side.","String EXTRA_SAMPLE_TEXT Extra information received with the ACTION_GET_SAMPLE_TEXT intent result where the TextToSpeech engine returns an String with sample text for requested voice","String EXTRA_TTS_DATA_INSTALLED This constant was deprecated in API level 18. No longer in use. If client ise interested in information about what changed, is should send ACTION_CHECK_TTS_DATA intent to discover available voices.","String EXTRA_UNAVAILABLE_VOICES Extra information received with the ACTION_CHECK_TTS_DATA intent result where the TextToSpeech engine returns an ArrayList of all the unavailable voices.","String EXTRA_VOICE_DATA_FILES This constant was deprecated in API level 18. TTS engine implementation detail, this information has no use for text-to-speech API client.","String EXTRA_VOICE_DATA_FILES_INFO This constant was deprecated in API level 18. TTS engine implementation detail, this information has no use for text-to-speech API client.","String EXTRA_VOICE_DATA_ROOT_DIRECTORY This constant was deprecated in API level 18. TTS engine implementation detail, this information has no use for text-to-speech API client.","String INTENT_ACTION_TTS_SERVICE Intent for starting a TTS service.","String KEY_FEATURE_EMBEDDED_SYNTHESIS This constant was deprecated in API level 21. Starting from API level 21, to select embedded synthesis, call (getVoices(), find a suitable embedded voice (isNetworkConnectionRequired()) and pass it to setVoice(Voice)).","String KEY_FEATURE_NETWORK_RETRIES_COUNT Feature key that indicates that network request retries count can be set for the request.","String KEY_FEATURE_NETWORK_SYNTHESIS This constant was deprecated in API level 21. Starting from API level 21, to select network synthesis, call (getVoices(), find a suitable network voice (isNetworkConnectionRequired()) and pass it to setVoice(Voice)).","String KEY_FEATURE_NETWORK_TIMEOUT_MS Feature key that indicate that a network timeout can be set for the request.","String KEY_FEATURE_NOT_INSTALLED Feature key that indicates that the voice may need to download additional data to be fully functional.","String KEY_PARAM_PAN Parameter key to specify how the speech is panned from left to right when speaking text.","String KEY_PARAM_SESSION_ID Parameter key to specify an audio session identifier (obtained from generateAudioSessionId()) that will be used by the request audio output.","String KEY_PARAM_STREAM Parameter key to specify the audio stream type to be used when speaking text or playing back a file.","String KEY_PARAM_UTTERANCE_ID Parameter key to identify an utterance in the TextToSpeech.OnUtteranceCompletedListener after text has been spoken, a file has been played back or a silence duration has elapsed.","String KEY_PARAM_VOLUME Parameter key to specify the speech volume relative to the current stream type volume used when speaking text.","String SERVICE_META_DATA Name under which a text to speech engine publishes information about itself."],"class":"TextToSpeech.Engine","constructors":[],"fields":[]}