{"methods":["void closeExpiredConnections() Closes all expired connections in the pool.","void closeIdleConnections(long idleTimeout, TimeUnit tunit) Closes idle connections in the pool.","int getConnectionsInPool(HttpRoute route) Gets the total number of pooled connections for the given route.","int getConnectionsInPool() Gets the total number of pooled connections.","SchemeRegistry getSchemeRegistry() Obtains the scheme registry used by this manager.","void releaseConnection(ManagedClientConnection conn, long validDuration, TimeUnit timeUnit) Releases a connection for use by others.","ClientConnectionRequest requestConnection(HttpRoute route, Object state) Returns a new ClientConnectionRequest, from which a ManagedClientConnection can be obtained or the request can be aborted.","void shutdown() Shuts down this connection manager and releases allocated resources.","ClientConnectionOperator createConnectionOperator(SchemeRegistry schreg) Hook for creating the connection operator.","AbstractConnPool createConnectionPool(HttpParams params) Hook for creating the connection pool.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.apache.http.conn.ClientConnectionManager abstract void closeExpiredConnections() Closes all expired connections in the pool. abstract void closeIdleConnections(long idletime, TimeUnit tunit) Closes idle connections in the pool. abstract SchemeRegistry getSchemeRegistry() Obtains the scheme registry used by this manager. abstract void releaseConnection(ManagedClientConnection conn, long validDuration, TimeUnit timeUnit) Releases a connection for use by others. abstract ClientConnectionRequest requestConnection(HttpRoute route, Object state) Returns a new ClientConnectionRequest, from which a ManagedClientConnection can be obtained or the request can be aborted. abstract void shutdown() Shuts down this connection manager and releases allocated resources.","abstract void closeExpiredConnections() Closes all expired connections in the pool.","abstract void closeIdleConnections(long idletime, TimeUnit tunit) Closes idle connections in the pool.","abstract SchemeRegistry getSchemeRegistry() Obtains the scheme registry used by this manager.","abstract void releaseConnection(ManagedClientConnection conn, long validDuration, TimeUnit timeUnit) Releases a connection for use by others.","abstract ClientConnectionRequest requestConnection(HttpRoute route, Object state) Returns a new ClientConnectionRequest, from which a ManagedClientConnection can be obtained or the request can be aborted.","abstract void shutdown() Shuts down this connection manager and releases allocated resources."],"package":"org.apache.http.impl.conn.tsccm","constants":[],"class":"ThreadSafeClientConnManager","constructors":[],"fields":["protected ClientConnectionOperator connOperator The operator for opening and updating connections.","protected final AbstractConnPool connectionPool The pool of connections being managed.","protected SchemeRegistry schemeRegistry The schemes supported by this connection manager."]}