{"methods":["static void clickView(InstrumentationTestCase test, View v) Simulate touching the center of a view and releasing.","static void drag(ActivityInstrumentationTestCase test, float fromX, float toX, float fromY, float toY, int stepCount) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void drag(InstrumentationTestCase test, float fromX, float toX, float fromY, float toY, int stepCount) Simulate touching a specific location and dragging to a new location.","static void dragQuarterScreenDown(InstrumentationTestCase test, Activity activity) Simulate touching in the center of the screen and dragging one quarter of the way down","static void dragQuarterScreenDown(ActivityInstrumentationTestCase test) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void dragQuarterScreenUp(ActivityInstrumentationTestCase test) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void dragQuarterScreenUp(InstrumentationTestCase test, Activity activity) Simulate touching in the center of the screen and dragging one quarter of the way up","static int dragViewBy(ActivityInstrumentationTestCase test, View v, int gravity, int deltaX, int deltaY) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewBy(InstrumentationTestCase test, View v, int gravity, int deltaX, int deltaY) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewTo(ActivityInstrumentationTestCase test, View v, int gravity, int toX, int toY) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewTo(InstrumentationTestCase test, View v, int gravity, int toX, int toY) Simulate touching a view and dragging it to a specified location.","static void dragViewToBottom(InstrumentationTestCase test, Activity activity, View v, int stepCount) Simulate touching the center of a view and dragging to the bottom of the screen.","static void dragViewToBottom(ActivityInstrumentationTestCase test, View v, int stepCount) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void dragViewToBottom(InstrumentationTestCase test, Activity activity, View v) Simulate touching the center of a view and dragging to the bottom of the screen.","static void dragViewToBottom(ActivityInstrumentationTestCase test, View v) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void dragViewToTop(InstrumentationTestCase test, View v, int stepCount) Simulate touching the center of a view and dragging to the top of the screen.","static void dragViewToTop(ActivityInstrumentationTestCase test, View v, int stepCount) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void dragViewToTop(InstrumentationTestCase test, View v) Simulate touching the center of a view and dragging to the top of the screen.","static void dragViewToTop(ActivityInstrumentationTestCase test, View v) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewToX(InstrumentationTestCase test, View v, int gravity, int toX) Simulate touching a view and dragging it to a specified location.","static int dragViewToX(ActivityInstrumentationTestCase test, View v, int gravity, int toX) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewToY(ActivityInstrumentationTestCase test, View v, int gravity, int toY) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static int dragViewToY(InstrumentationTestCase test, View v, int gravity, int toY) Simulate touching a view and dragging it to a specified location.","static void longClickView(InstrumentationTestCase test, View v) Simulate touching the center of a view, holding until it is a long press, and then releasing.","static void longClickView(ActivityInstrumentationTestCase test, View v) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void scrollToBottom(InstrumentationTestCase test, Activity activity, ViewGroup v) Scroll a ViewGroup to the bottom by repeatedly calling dragQuarterScreenUp(InstrumentationTestCase, Activity)","static void scrollToBottom(ActivityInstrumentationTestCase test, ViewGroup v) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void scrollToTop(InstrumentationTestCase test, Activity activity, ViewGroup v) Scroll a ViewGroup to the top by repeatedly calling dragQuarterScreenDown(InstrumentationTestCase, Activity)","static void scrollToTop(ActivityInstrumentationTestCase test, ViewGroup v) This method was deprecated in API level 3. ActivityInstrumentationTestCase is deprecated in favor of ActivityInstrumentationTestCase2, which provides more options for configuring the Activity under test","static void tapView(InstrumentationTestCase test, View v) Simulate touching the center of a view and releasing quickly (before the tap timeout).","static void touchAndCancelView(InstrumentationTestCase test, View v) Simulate touching the center of a view and cancelling (so no onClick should fire, etc).","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.test","constants":[],"class":"TouchUtils","constructors":[],"fields":[]}