{"methods":["abstract Source getAssociatedStylesheet(Source source, String media, String title, String charset) Get the stylesheet specification(s) associated with the XML Source document via the xml-stylesheet processing instruction that match the given criteria.","abstract Object getAttribute(String name) Allows the user to retrieve specific attributes on the underlying implementation.","abstract ErrorListener getErrorListener() Get the error event handler for the TransformerFactory.","abstract boolean getFeature(String name) Look up the value of a feature.","abstract URIResolver getURIResolver() Get the object that is used by default during the transformation to resolve URIs used in document(), xsl:import, or xsl:include.","static TransformerFactory newInstance(String factoryClassName, ClassLoader classLoader) Returns an instance of the named implementation of TransformerFactory.","static TransformerFactory newInstance() Returns Android's implementation of TransformerFactory.","abstract Templates newTemplates(Source source) Process the Source into a Templates object, which is a a compiled representation of the source.","abstract Transformer newTransformer() Create a new Transformer that performs a copy of the Source to the Result.","abstract Transformer newTransformer(Source source) Process the Source into a Transformer Object.","abstract void setAttribute(String name, Object value) Allows the user to set specific attributes on the underlying implementation.","abstract void setErrorListener(ErrorListener listener) Set the error event listener for the TransformerFactory, which is used for the processing of transformation instructions, and not for the transformation itself.","abstract void setFeature(String name, boolean value) Set a feature for this TransformerFactory and Transformers or Templates created by this factory.","abstract void setURIResolver(URIResolver resolver) Set an object that is used by default during the transformation to resolve URIs used in document(), xsl:import, or xsl:include.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.transform","constants":[],"class":"TransformerFactory","constructors":[],"fields":[]}