{"methods":["void onAudioFocusChange(int focusChange) Report that audio focus has changed on the app.","int onGetBufferPercentage() Request to find out how much of the media has been buffered on the local device.","abstract long onGetCurrentPosition() Request to return the current playback position, in milliseconds.","abstract long onGetDuration() Request to return the duration of the current media, in milliseconds.","int onGetTransportControlFlags() Retrieves the flags for the media transport control buttons that this transport supports.","abstract boolean onIsPlaying() Request to find out whether the player is currently playing its media.","boolean onMediaButtonDown(int keyCode, KeyEvent event) Report that a media button has been pressed.","boolean onMediaButtonUp(int keyCode, KeyEvent event) Report that a media button has been released.","abstract void onPause() Request to pause playback of the media, staying at the current playback position and other state so a later call to onStart() will resume at the same place.","abstract void onSeekTo(long pos) Request to move the current playback position.","abstract void onStart() Request to start playback on the media, resuming from whatever current state (position etc) it is in.","abstract void onStop() Request to completely stop playback of the media, clearing whatever state the player thinks is appropriate.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.media","constants":[],"class":"TransportPerformer","constructors":[],"fields":[]}