{"methods":["abstract int getBufferPercentage() Retrieve amount, in percentage (0-100), that the media stream has been buffered on to the local device.","abstract long getCurrentPosition() Retrieve the current playback location in the media stream, in milliseconds.","abstract long getDuration() Retrieve the total duration of the media stream, in milliseconds.","abstract int getTransportControlFlags() Retrieve the flags for the media transport control buttons that this transport supports.","abstract boolean isPlaying() Return whether the player is currently playing its stream.","abstract void pausePlaying() Request that the player pause its playback and stay at its current position.","abstract void registerStateListener(TransportStateListener listener) Start listening to changes in playback state.","abstract void seekTo(long pos) Move to a new location in the media stream.","abstract void startPlaying() Request that the player start its playback at its current position.","abstract void stopPlaying() Request that the player stop its playback; it may clear its state in whatever way is appropriate.","abstract void unregisterStateListener(TransportStateListener listener) Stop listening to changes in playback state.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.media","constants":[],"class":"TransportController","constructors":[],"fields":[]}