{"methods":["final String getAlgorithm() Returns the name of this TrustManagerFactory algorithm implementation.","final static String getDefaultAlgorithm() Returns the default algorithm name for the TrustManagerFactory.","final static TrustManagerFactory getInstance(String algorithm, String provider) Creates a new TrustManagerFactory instance for the specified trust management algorithm from the specified provider.","final static TrustManagerFactory getInstance(String algorithm, Provider provider) Creates a new TrustManagerFactory instance for the specified trust management algorithm from the specified provider.","final static TrustManagerFactory getInstance(String algorithm) Creates a new TrustManagerFactory instance for the specified trust management algorithm.","final Provider getProvider() Returns the provider for this TrustManagerFactory instance.","final TrustManager[] getTrustManagers() Returns the list of TrustManagers with one entry for each type of trust material.","final void init(ManagerFactoryParameters spec) Initializes this factory instance with the specified provider-specific parameters for a source of trust material.","final void init(KeyStore ks) Initializes this factory instance with the specified keystore as source of certificate authorities and trust material.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.net.ssl","constants":[],"class":"TrustManagerFactory","constructors":[],"fields":[]}