{"methods":["TtsSpan.CardinalBuilder setNumber(String number) Sets the ARG_NUMBER argument.","TtsSpan.CardinalBuilder setNumber(long number) Convenience method that converts the number to a String and set it to the value for ARG_NUMBER.","[Expand] Inherited Methods","From class android.text.style.TtsSpan.SemioticClassBuilder C setAnimacy(String animacy) Sets the animacy information for this instance. C setCase(String grammaticalCase) Sets the grammatical case information for this instance. C setGender(String gender) Sets the gender information for this instance. C setMultiplicity(String multiplicity) Sets the multiplicity information for this instance.","C setAnimacy(String animacy) Sets the animacy information for this instance.","C setCase(String grammaticalCase) Sets the grammatical case information for this instance.","C setGender(String gender) Sets the gender information for this instance.","C setMultiplicity(String multiplicity) Sets the multiplicity information for this instance.","From class android.text.style.TtsSpan.Builder TtsSpan build() Returns a TtsSpan built from the parameters set by the setter methods. C setIntArgument(String arg, int value) Sets an argument to an int value. C setLongArgument(String arg, long value) Sets an argument to a long value. C setStringArgument(String arg, String value) Sets an argument to a string value.","TtsSpan build() Returns a TtsSpan built from the parameters set by the setter methods.","C setIntArgument(String arg, int value) Sets an argument to an int value.","C setLongArgument(String arg, long value) Sets an argument to a long value.","C setStringArgument(String arg, String value) Sets an argument to a string value.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.text.style","constants":[],"class":"TtsSpan.CardinalBuilder","constructors":[],"fields":[]}