{"methods":["final static Uri buildChannelLogoUri(Uri channelUri) Builds a URI that points to a channel logo.","final static Uri buildChannelLogoUri(long channelId) Builds a URI that points to a channel logo.","final static Uri buildChannelUri(long channelId) Builds a URI that points to a specific channel.","final static Uri buildChannelUriForPassthroughInput(String inputId) Build a special channel URI intended to be used with pass-through inputs.","final static Uri buildChannelsUriForInput(String inputId) Builds a URI that points to all channels from a given TV input.","final static String buildInputId(ComponentName name) Builds an ID that uniquely identifies a TV input service.","final static Uri buildProgramUri(long programId) Builds a URI that points to a specific program.","final static Uri buildProgramsUriForChannel(Uri channelUri) Builds a URI that points to all programs on a given channel.","final static Uri buildProgramsUriForChannel(long channelId, long startTime, long endTime) Builds a URI that points to programs on a specific channel whose schedules overlap with the given time frame.","final static Uri buildProgramsUriForChannel(Uri channelUri, long startTime, long endTime) Builds a URI that points to programs on a specific channel whose schedules overlap with the given time frame.","final static Uri buildProgramsUriForChannel(long channelId) Builds a URI that points to all programs on a given channel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.tv","constants":["String AUTHORITY The authority for the TV provider."],"class":"TvContract","constructors":[],"fields":[]}