{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.tv","constants":["String COLUMN_AUDIO_LANGUAGE The comma-separated audio languages of this TV program.","String COLUMN_BROADCAST_GENRE The comma-separated genre string of this TV program.","String COLUMN_CANONICAL_GENRE The comma-separated canonical genre string of this TV program.","String COLUMN_CHANNEL_ID The ID of the TV channel that provides this TV program.","String COLUMN_CONTENT_RATING The comma-separated content ratings of this TV program.","String COLUMN_END_TIME_UTC_MILLIS The end time of this TV program, in milliseconds since the epoch.","String COLUMN_EPISODE_NUMBER The episode number of this TV program for episodic TV shows.","String COLUMN_EPISODE_TITLE The episode title of this TV program for episodic TV shows.","String COLUMN_INTERNAL_PROVIDER_DATA Internal data used by individual TV input services.","String COLUMN_LONG_DESCRIPTION The detailed, lengthy description of this TV program that is displayed only when the user wants to see more information.","String COLUMN_POSTER_ART_URI The URI for the poster art of this TV program.","String COLUMN_SEASON_NUMBER The season number of this TV program for episodic TV shows.","String COLUMN_SHORT_DESCRIPTION The short description of this TV program that is displayed to the user by default.","String COLUMN_START_TIME_UTC_MILLIS The start time of this TV program, in milliseconds since the epoch.","String COLUMN_THUMBNAIL_URI The URI for the thumbnail of this TV program.","String COLUMN_TITLE The title of this TV program.","String COLUMN_VERSION_NUMBER The version number of this row entry used by TV input services.","String COLUMN_VIDEO_HEIGHT The height of the video for this TV program, in the unit of pixels.","String COLUMN_VIDEO_WIDTH The width of the video for this TV program, in the unit of pixels.","String CONTENT_ITEM_TYPE The MIME type of a single TV program.","String CONTENT_TYPE The MIME type of a directory of TV programs.","[Expand] Inherited Constants","From interface android.media.tv.TvContract.BaseTvColumns String COLUMN_PACKAGE_NAME The name of the package that owns a row in each table.","String COLUMN_PACKAGE_NAME The name of the package that owns a row in each table.","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"TvContract.Programs","constructors":[],"fields":["public static final Uri CONTENT_URI The content:// style URI for this table."]}