{"methods":["Intent createSettingsIntent() Returns an intent to start the settings activity for this TV input.","Intent createSetupIntent() Returns an intent to start the setup activity for this TV input.","int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","String getId() Returns a unique ID for this TV input.","String getParentId() Returns the parent input ID.","ServiceInfo getServiceInfo() Returns the information of the service that implements this TV input.","int getType() Returns the type of this TV input.","int hashCode() Returns an integer hash code for this object.","boolean isPassthroughInput() Returns true if this TV input is pass-though which does not have any real channels in TvProvider.","Drawable loadIcon(Context context) Loads the user-displayed icon for this TV input.","CharSequence loadLabel(Context context) Loads the user-displayed label for this TV input.","String toString() Returns a string containing a concise, human-readable description of this object.","void writeToParcel(Parcel dest, int flags) Used to package this object into a Parcel.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.os.Parcelable abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation. abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel.","abstract int describeContents() Describe the kinds of special objects contained in this Parcelable's marshalled representation.","abstract void writeToParcel(Parcel dest, int flags) Flatten this object in to a Parcel."],"package":"android.media.tv","constants":["String EXTRA_INPUT_ID The ID of the TV input to provide to the setup activity and settings activity.","int TYPE_COMPONENT TV input type: the TV input service represents a component port.","int TYPE_COMPOSITE TV input type: the TV input service represents a composite port.","int TYPE_DISPLAY_PORT TV input type: the TV input service represents a display port.","int TYPE_DVI TV input type: the TV input service represents a DVI port.","int TYPE_HDMI TV input type: the TV input service is HDMI.","int TYPE_OTHER TV input type: a generic hardware TV input type.","int TYPE_SCART TV input type: the TV input service represents a SCART port.","int TYPE_SVIDEO TV input type: the TV input service represents a SVIDEO port.","int TYPE_TUNER TV input type: the TV input service is a tuner which provides channels.","int TYPE_VGA TV input type: the TV input service represents a VGA port.","[Expand] Inherited Constants","From interface android.os.Parcelable int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled. int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\".","int CONTENTS_FILE_DESCRIPTOR Bit masks for use with describeContents(): each bit represents a kind of object considered to have potential special significance when marshalled.","int PARCELABLE_WRITE_RETURN_VALUE Flag for use with writeToParcel(Parcel, int): the object being written is a return value, that is the result of a function such as \"Parcelable someFunction()\", \"void someFunction(out Parcelable)\", or \"void someFunction(inout Parcelable)\"."],"class":"TvInputInfo","constructors":[],"fields":["public static final Creator<TvInputInfo> CREATOR"]}