{"methods":["void notifyChannelRetuned(Uri channelUri) Notifies the channel of the session is retuned by TV input.","void notifyContentAllowed() Informs the application that the user is allowed to watch the current program content.","void notifyContentBlocked(TvContentRating rating) Informs the application that the current program content is blocked by parent controls.","void notifyTrackSelected(int type, String trackId) Sends the ID of the selected track for a given track type.","void notifyTracksChanged(List<TvTrackInfo> tracks) Sends the change on the track information.","void notifyVideoAvailable() Informs the application that the video is now available for watching.","void notifyVideoUnavailable(int reason) Informs the application that the video became unavailable for some reason.","View onCreateOverlayView() Called when an application requests to create an overlay view.","boolean onGenericMotionEvent(MotionEvent event) Implement this method to handle generic motion events on the current input session.","boolean onKeyDown(int keyCode, KeyEvent event) Default implementation of KeyEvent.Callback.onKeyDown(): always returns false (doesn't handle the event).","boolean onKeyLongPress(int keyCode, KeyEvent event) Default implementation of KeyEvent.Callback.onKeyLongPress(): always returns false (doesn't handle the event).","boolean onKeyMultiple(int keyCode, int count, KeyEvent event) Default implementation of KeyEvent.Callback.onKeyMultiple(): always returns false (doesn't handle the event).","boolean onKeyUp(int keyCode, KeyEvent event) Default implementation of KeyEvent.Callback.onKeyUp(): always returns false (doesn't handle the event).","abstract void onRelease() Called when the session is released.","boolean onSelectTrack(int type, String trackId) Select a given track.","abstract void onSetCaptionEnabled(boolean enabled) Enables or disables the caption.","abstract void onSetStreamVolume(float volume) Sets the relative stream volume of the current TV input session to handle the change of audio focus by setting.","abstract boolean onSetSurface(Surface surface) Sets the Surface for the current input session on which the TV input renders video.","void onSurfaceChanged(int format, int width, int height) Called after any structural changes (format or size) have been made to the Surface passed by onSetSurface(Surface).","boolean onTouchEvent(MotionEvent event) Implement this method to handle touch screen motion events on the current input session.","boolean onTrackballEvent(MotionEvent event) Implement this method to handle trackball events on the current input session.","abstract boolean onTune(Uri channelUri) Tunes to a given channel.","void onUnblockContent(TvContentRating unblockedRating) Requests to unblock the content according to the given rating.","void setOverlayViewEnabled(boolean enable) Enables or disables the overlay view.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.view.KeyEvent.Callback abstract boolean onKeyDown(int keyCode, KeyEvent event) Called when a key down event has occurred. abstract boolean onKeyLongPress(int keyCode, KeyEvent event) Called when a long press has occurred. abstract boolean onKeyMultiple(int keyCode, int count, KeyEvent event) Called when multiple down/up pairs of the same key have occurred in a row. abstract boolean onKeyUp(int keyCode, KeyEvent event) Called when a key up event has occurred.","abstract boolean onKeyDown(int keyCode, KeyEvent event) Called when a key down event has occurred.","abstract boolean onKeyLongPress(int keyCode, KeyEvent event) Called when a long press has occurred.","abstract boolean onKeyMultiple(int keyCode, int count, KeyEvent event) Called when multiple down/up pairs of the same key have occurred in a row.","abstract boolean onKeyUp(int keyCode, KeyEvent event) Called when a key up event has occurred."],"package":"android.media.tv","constants":[],"class":"TvInputService.Session","constructors":[],"fields":[]}