{"methods":["int getInputState(String inputId) Returns the state of a given TV input.","TvInputInfo getTvInputInfo(String inputId) Returns the TvInputInfo for a given TV input.","List<TvInputInfo> getTvInputList() Returns the complete list of TV inputs on the system.","boolean isParentalControlsEnabled() Returns the user's parental controls enabled state.","boolean isRatingBlocked(TvContentRating rating) Checks whether a given TV content rating is blocked by the user.","void registerCallback(TvInputManager.TvInputCallback callback, Handler handler) Registers a TvInputManager.TvInputCallback.","void unregisterCallback(TvInputManager.TvInputCallback callback) Unregisters the existing TvInputManager.TvInputCallback.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.tv","constants":["String ACTION_BLOCKED_RATINGS_CHANGED Broadcast intent action when the user blocked content ratings change.","String ACTION_PARENTAL_CONTROLS_ENABLED_CHANGED Broadcast intent action when the parental controls enabled state changes.","String ACTION_QUERY_CONTENT_RATING_SYSTEMS Broadcast intent action used to query available content rating systems.","int INPUT_STATE_CONNECTED The TV input is connected.","int INPUT_STATE_CONNECTED_STANDBY The TV input is connected but in standby mode.","int INPUT_STATE_DISCONNECTED The TV input is disconnected.","String META_DATA_CONTENT_RATING_SYSTEMS Content rating systems metadata associated with ACTION_QUERY_CONTENT_RATING_SYSTEMS.","int VIDEO_UNAVAILABLE_REASON_BUFFERING Video is not available because the TV input stopped the playback temporarily to buffer more data.","int VIDEO_UNAVAILABLE_REASON_TUNING Video is not available because the TV input is in the middle of tuning to a new channel.","int VIDEO_UNAVAILABLE_REASON_UNKNOWN A generic reason.","int VIDEO_UNAVAILABLE_REASON_WEAK_SIGNAL Video is not available due to the weak TV signal."],"class":"TvInputManager","constructors":[],"fields":[]}