{"methods":["void onChannelRetuned(String inputId, Uri channelUri) This is invoked when the channel of this TvView is changed by the underlying TV input with out any tune(String, Uri) request.","void onConnectionFailed(String inputId) This is invoked when an error occurred while establishing a connection to the underlying TV input.","void onContentAllowed(String inputId) This is called when the current program content turns out to be allowed to watch since its content rating is not blocked by parental controls.","void onContentBlocked(String inputId, TvContentRating rating) This is called when the current program content turns out to be not allowed to watch since its content rating is blocked by parental controls.","void onDisconnected(String inputId) This is invoked when the existing connection to the underlying TV input is lost.","void onTrackSelected(String inputId, int type, String trackId) This is called when there is a change on the selected tracks.","void onTracksChanged(String inputId, List<TvTrackInfo> tracks) This is called when the track information has been changed.","void onVideoAvailable(String inputId) This is called when the video is available, so the TV input starts the playback.","void onVideoSizeChanged(String inputId, int width, int height) This is invoked when the view is tuned to a specific channel and starts decoding video stream from there.","void onVideoUnavailable(String inputId, int reason) This is called when the video is not available, so the TV input stops the playback.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.tv","constants":[],"class":"TvView.TvInputCallback","constructors":[],"fields":[]}