{"methods":["static Typeface create(String familyName, int style) Create a typeface object given a family name, and option style information.","static Typeface create(Typeface family, int style) Create a typeface object that best matches the specified existing typeface and the specified Style.","static Typeface createFromAsset(AssetManager mgr, String path) Create a new typeface from the specified font data.","static Typeface createFromFile(String path) Create a new typeface from the specified font file.","static Typeface createFromFile(File path) Create a new typeface from the specified font file.","static Typeface defaultFromStyle(int style) Returns one of the default typeface objects, based on the specified style","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","int getStyle() Returns the typeface's intrinsic style attributes","int hashCode() Returns an integer hash code for this object.","final boolean isBold() Returns true if getStyle() has the BOLD bit set.","final boolean isItalic() Returns true if getStyle() has the ITALIC bit set.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.graphics","constants":["int BOLD","int BOLD_ITALIC","int ITALIC","int NORMAL"],"class":"Typeface","constructors":[],"fields":["public static final Typeface DEFAULT The default NORMAL typeface object","public static final Typeface DEFAULT_BOLD The default BOLD typeface object.","public static final Typeface MONOSPACE The NORMAL style of the default monospace typeface.","public static final Typeface SANS_SERIF The NORMAL style of the default sans serif typeface.","public static final Typeface SERIF The NORMAL style of the default serif typeface."]}