{"methods":["[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.sql","constants":["int ARRAY The type code that identifies the SQL type ARRAY.","int BIGINT The type code that identifies the SQL type BIGINT.","int BINARY The type code that identifies the SQL type BINARY.","int BIT The type code that identifies the SQL type BIT.","int BLOB The type code that identifies the SQL type BLOB.","int BOOLEAN The type code that identifies the SQL type BOOLEAN.","int CHAR The type code that identifies the SQL type CHAR.","int CLOB The type code that identifies the SQL type CLOB.","int DATALINK The type code that identifies the SQL type DATALINK.","int DATE The type code that identifies the SQL type DATE.","int DECIMAL The type code that identifies the SQL type DECIMAL.","int DISTINCT The type code that identifies the SQL type DISTINCT.","int DOUBLE The type code that identifies the SQL type DOUBLE.","int FLOAT The type code that identifies the SQL type FLOAT.","int INTEGER The type code that identifies the SQL type INTEGER.","int JAVA_OBJECT The type code that identifies the SQL type JAVA_OBJECT.","int LONGNVARCHAR The type code that identifies the SQL type LONGNVARCHAR.","int LONGVARBINARY The type code that identifies the SQL type LONGVARBINARY.","int LONGVARCHAR The type code that identifies the SQL type LONGVARCHAR.","int NCHAR The type code that identifies the SQL type NCHAR.","int NCLOB The type code that identifies the SQL type NCLOB.","int NULL The type code that identifies the SQL type NULL.","int NUMERIC The type code that identifies the SQL type NUMERIC.","int NVARCHAR The type code that identifies the SQL type NVARCHAR.","int OTHER The type code that identifies that the SQL type is database specific and is mapped to a Java object, accessed via the methods getObject and setObject.","int REAL The type code that identifies the SQL type REAL.","int REF The type code that identifies the SQL type REF.","int ROWID The type code that identifies the SQL type ROWID.","int SMALLINT The type code that identifies the SQL type SMALLINT.","int SQLXML The type code that identifies the SQL type SQLXML.","int STRUCT The type code that identifies the SQL type STRUCT.","int TIME The type code that identifies the SQL type TIME.","int TIMESTAMP The type code that identifies the SQL type TIMESTAMP.","int TINYINT The type code that identifies the SQL type TINYINT.","int VARBINARY The type code that identifies the SQL type VARBINARY.","int VARCHAR The type code that identifies the SQL type VARCHAR."],"class":"Types","constructors":[],"fields":[]}