{"methods":["void clearWindowAnimationFrameStats() Clears the window animation rendering statistics.","boolean clearWindowContentFrameStats(int windowId) Clears the frame statistics for the content of a given window.","AccessibilityEvent executeAndWaitForEvent(Runnable command, UiAutomation.AccessibilityEventFilter filter, long timeoutMillis) Executes a command and waits for a specific accessibility event up to a given wait timeout.","ParcelFileDescriptor executeShellCommand(String command) Executes a shell command.","AccessibilityNodeInfo findFocus(int focus) Find the view that has the specified focus type.","AccessibilityNodeInfo getRootInActiveWindow() Gets the root AccessibilityNodeInfo in the active window.","final AccessibilityServiceInfo getServiceInfo() Gets the an AccessibilityServiceInfo describing this UiAutomation.","WindowAnimationFrameStats getWindowAnimationFrameStats() Gets the window animation frame statistics.","WindowContentFrameStats getWindowContentFrameStats(int windowId) Gets the frame statistics for a given window.","List<AccessibilityWindowInfo> getWindows() Gets the windows on the screen.","boolean injectInputEvent(InputEvent event, boolean sync) A method for injecting an arbitrary input event.","final boolean performGlobalAction(int action) Performs a global action.","void setOnAccessibilityEventListener(UiAutomation.OnAccessibilityEventListener listener) Sets a callback for observing the stream of AccessibilityEvents.","boolean setRotation(int rotation) Sets the device rotation.","void setRunAsMonkey(boolean enable) Sets whether this UiAutomation to run in a \"monkey\" mode.","final void setServiceInfo(AccessibilityServiceInfo info) Sets the AccessibilityServiceInfo that describes how this UiAutomation will be handled by the platform accessibility layer.","Bitmap takeScreenshot() Takes a screenshot.","void waitForIdle(long idleTimeoutMillis, long globalTimeoutMillis) Waits for the accessibility event stream to become idle, which is not to have received an accessibility event within idleTimeoutMillis.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["int ROTATION_FREEZE_0 Rotation constant: Freeze rotation to 0 degrees (natural orientation)","int ROTATION_FREEZE_180 Rotation constant: Freeze rotation to 180 degrees .","int ROTATION_FREEZE_270 Rotation constant: Freeze rotation to 270 degrees .","int ROTATION_FREEZE_90 Rotation constant: Freeze rotation to 90 degrees .","int ROTATION_FREEZE_CURRENT Rotation constant: Freeze rotation to its current state.","int ROTATION_UNFREEZE Rotation constant: Unfreeze rotation (rotating the device changes its rotation state)."],"class":"UiAutomation","constructors":[],"fields":[]}