{"methods":["void disableCarMode(int flags) Turn off special mode if currently in car mode.","void enableCarMode(int flags) Force device into car mode, like it had been placed in the car dock.","int getCurrentModeType() Return the current running mode type.","int getNightMode() Returns the currently configured night mode.","void setNightMode(int mode) Sets the night mode.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app","constants":["int DISABLE_CAR_MODE_GO_HOME Flag for use with disableCarMode(int): go to the normal home activity as part of the disable.","int ENABLE_CAR_MODE_ALLOW_SLEEP Flag for use with enableCarMode(int): allow sleep mode while in car mode.","int ENABLE_CAR_MODE_GO_CAR_HOME Flag for use with enableCarMode(int): go to the car home activity as part of the enable.","int MODE_NIGHT_AUTO Constant for setNightMode(int) and getNightMode(): automatically switch night mode on and off based on the time.","int MODE_NIGHT_NO Constant for setNightMode(int) and getNightMode(): never run in night mode.","int MODE_NIGHT_YES Constant for setNightMode(int) and getNightMode(): always run in night mode."],"class":"UiModeManager","constructors":[],"fields":["public static String ACTION_ENTER_CAR_MODE Broadcast sent when the device's UI has switched to car mode, either by being placed in a car dock or explicit action of the user.","public static String ACTION_ENTER_DESK_MODE Broadcast sent when the device's UI has switched to desk mode, by being placed in a desk dock.","public static String ACTION_EXIT_CAR_MODE Broadcast sent when the device's UI has switch away from car mode back to normal mode.","public static String ACTION_EXIT_DESK_MODE Broadcast sent when the device's UI has switched away from desk mode back to normal mode."]}