{"methods":["int compareTo(URI uri) Compares this URI with the given argument uri.","static URI create(String uri) Returns the URI formed by parsing uri.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","String getAuthority() Returns the decoded authority part of this URI, or null if this URI has no authority.","String getFragment() Returns the decoded fragment of this URI, or null if this URI has no fragment.","String getHost() Returns the host of this URI, or null if this URI has no host.","String getPath() Returns the decoded path of this URI, or null if this URI has no path.","int getPort() Returns the port number of this URI, or -1 if this URI has no explicit port.","String getQuery() Returns the decoded query of this URI, or null if this URI has no query.","String getRawAuthority() Returns the encoded authority of this URI, or null if this URI has no authority.","String getRawFragment() Gets the encoded fragment of this URI, or null if this URI has no fragment.","String getRawPath() Returns the encoded path of this URI, or null if this URI has no path.","String getRawQuery() Returns the encoded query of this URI, or null if this URI has no query.","String getRawSchemeSpecificPart() Returns the encoded scheme-specific part of this URI, or null if this URI has no scheme-specific part.","String getRawUserInfo() Returns the encoded user info of this URI, or null if this URI has no user info.","String getScheme() Returns the scheme of this URI, or null if this URI has no scheme.","String getSchemeSpecificPart() Returns the decoded scheme-specific part of this URI, or null if this URI has no scheme-specific part.","String getUserInfo() Returns the decoded user info of this URI, or null if this URI has no user info.","int hashCode() Returns an integer hash code for this object.","boolean isAbsolute() Returns true if this URI is absolute, which means that a scheme is defined.","boolean isOpaque() Returns true if this URI is opaque.","URI normalize() Normalizes the path part of this URI.","URI parseServerAuthority() Tries to parse the authority component of this URI to divide it into the host, port, and user-info.","URI relativize(URI relative) Makes the given URI relative to a relative URI against the URI represented by this instance.","URI resolve(String relative) Creates a new URI instance by parsing the given string relative and resolves the created URI against the URI represented by this instance.","URI resolve(URI relative) Resolves the given URI relative against the URI represented by this instance.","String toASCIIString() Returns the textual string representation of this URI instance using the US-ASCII encoding.","String toString() Returns the encoded URI.","URL toURL() Converts this URI instance to a URL.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.net","constants":[],"class":"URI","constructors":[],"fields":[]}