{"methods":["boolean equals(Object o) Returns true if this URL equals o.","String getAuthority() Returns the authority part of this URL, or null if this URL has no authority.","final Object getContent(Class[] types) Equivalent to openConnection().getContent(types).","final Object getContent() Returns the content of the resource which is referred by this URL.","int getDefaultPort() Returns the default port number of the protocol used by this URL.","String getFile() Returns the file of this URL.","String getHost() Returns the host name or IP address of this URL.","String getPath() Returns the path part of this URL.","int getPort() Returns the port number of this URL or -1 if this URL has no explicit port.","String getProtocol() Returns the protocol of this URL like \"http\" or \"file\".","String getQuery() Returns the query part of this URL, or null if this URL has no query.","String getRef() Returns the value of the reference part of this URL, or null if this URL has no reference part.","String getUserInfo() Returns the user info of this URL, or null if this URL has no user info.","int hashCode() Returns an integer hash code for this object.","URLConnection openConnection(Proxy proxy) Returns a new connection to the resource referred to by this URL.","URLConnection openConnection() Returns a new connection to the resource referred to by this URL.","final InputStream openStream() Equivalent to openConnection().getInputStream(types).","boolean sameFile(URL otherURL) Returns true if this URL refers to the same resource as otherURL.","synchronized static void setURLStreamHandlerFactory(URLStreamHandlerFactory factory) Sets the stream handler factory for this VM.","String toExternalForm() Returns a string containing a concise, human-readable representation of this URL.","String toString() Returns a string containing a concise, human-readable representation of this URL.","URI toURI() Returns the URI equivalent to this URL.","void set(String protocol, String host, int port, String authority, String userInfo, String path, String query, String ref) Sets the properties of this URL using the provided arguments.","void set(String protocol, String host, int port, String file, String ref) Sets the properties of this URL using the provided arguments.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"URL","constructors":[],"fields":[]}