{"methods":["final static UrlQuerySanitizer.ValueSanitizer getAllButNulAndAngleBracketsLegal() Return a value sanitizer that allows any special characters except angle brackets ('<' and '>') and Nul ('\\0').","final static UrlQuerySanitizer.ValueSanitizer getAllButNulLegal() Return a value sanitizer that allows everything except Nul ('\\0') characters.","final static UrlQuerySanitizer.ValueSanitizer getAllButWhitespaceLegal() Return a value sanitizer that allows everything except Nul ('\\0') characters, space (' '), and other whitespace characters.","final static UrlQuerySanitizer.ValueSanitizer getAllIllegal() Return a value sanitizer that does not allow any special characters, and also does not allow script URLs.","boolean getAllowUnregisteredParamaters() Get whether or not unregistered parameters are allowed.","final static UrlQuerySanitizer.ValueSanitizer getAmpAndSpaceLegal() Return a value sanitizer that does not allow any special characters except ampersand ('&') and space (' ').","final static UrlQuerySanitizer.ValueSanitizer getAmpLegal() Return a value sanitizer that does not allow any special characters except ampersand ('&').","UrlQuerySanitizer.ValueSanitizer getEffectiveValueSanitizer(String parameter) Get the effective value sanitizer for a parameter.","List<UrlQuerySanitizer.ParameterValuePair> getParameterList() An array list of all of the parameter value pairs in the sanitized query, in the order they appeared in the query.","Set<String> getParameterSet() Get a set of all of the parameters found in the sanitized query.","boolean getPreferFirstRepeatedParameter() Get whether or not the first occurrence of a repeated parameter is preferred.","final static UrlQuerySanitizer.ValueSanitizer getSpaceLegal() Return a value sanitizer that does not allow any special characters except space (' ').","UrlQuerySanitizer.ValueSanitizer getUnregisteredParameterValueSanitizer() Get the current value sanitizer used when processing unregistered parameter values.","final static UrlQuerySanitizer.ValueSanitizer getUrlAndSpaceLegal() Return a value sanitizer that allows all the characters used by encoded URLs and allows spaces, which are not technically legal in encoded URLs, but commonly appear anyway.","final static UrlQuerySanitizer.ValueSanitizer getUrlLegal() Return a value sanitizer that allows all the characters used by encoded URLs.","String getValue(String parameter) Get the value for a parameter in the current sanitized query.","UrlQuerySanitizer.ValueSanitizer getValueSanitizer(String parameter) Get the value sanitizer for a parameter.","boolean hasParameter(String parameter) Check if a parameter exists in the current sanitized query.","void parseQuery(String query) Parse a query.","void parseUrl(String url) Parse the query parameters out of an encoded URL.","void registerParameter(String parameter, UrlQuerySanitizer.ValueSanitizer valueSanitizer) Register a value sanitizer for a particular parameter.","void registerParameters(String[] parameters, UrlQuerySanitizer.ValueSanitizer valueSanitizer) Register a value sanitizer for an array of parameters.","void setAllowUnregisteredParamaters(boolean allowUnregisteredParamaters) Set whether or not unregistered parameters are allowed.","void setPreferFirstRepeatedParameter(boolean preferFirstRepeatedParameter) Set whether or not the first occurrence of a repeated parameter is preferred.","void setUnregisteredParameterValueSanitizer(UrlQuerySanitizer.ValueSanitizer sanitizer) Set the value sanitizer used when processing unregistered parameter values.","String unescape(String string) Unescape an escaped string.","void addSanitizedEntry(String parameter, String value) Record a sanitized parameter-value pair.","void clear() Clear the existing entries.","int decodeHexDigit(char c) Convert a character that represents a hexidecimal digit into an integer.","boolean isHexDigit(char c) Test if a character is a hexidecimal digit.","void parseEntry(String parameter, String value) Parse an escaped parameter-value pair.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net","constants":[],"class":"UrlQuerySanitizer","constructors":[],"fields":[]}