{"methods":["boolean equals(URL a, URL b) Returns true if a and b have the same protocol, host, port, file, and reference.","int getDefaultPort() Returns the default port of the protocol used by the handled URL.","InetAddress getHostAddress(URL url) Returns the host address of url.","int hashCode(URL url) Returns the hash code of url.","boolean hostsEqual(URL a, URL b) Returns true if the hosts of a and b are equal.","URLConnection openConnection(URL u, Proxy proxy) Establishes a new connection to the resource specified by the URL u using the given proxy.","abstract URLConnection openConnection(URL u) Establishes a new connection to the resource specified by the URL u.","void parseURL(URL url, String spec, int start, int end) Parses the clear text URL in str into a URL object.","boolean sameFile(URL a, URL b) Returns true if a and b have the same protocol, host, port and file.","void setURL(URL u, String protocol, String host, int port, String file, String ref) This method was deprecated in API level 1. Use setURL(URL, String String, int, String, String, String, String, String) instead.","void setURL(URL u, String protocol, String host, int port, String authority, String userInfo, String path, String query, String ref) Sets the fields of the URL u to the values of the supplied arguments.","String toExternalForm(URL url) Returns the clear text representation of a given URL using HTTP format.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"java.net","constants":[],"class":"URLStreamHandler","constructors":[],"fields":[]}