{"methods":["Map<String, UsageStats> queryAndAggregateUsageStats(long beginTime, long endTime) A convenience method that queries for all stats in the given range (using the best interval for that range), merges the resulting data, and keys it by package name.","List<ConfigurationStats> queryConfigurations(int intervalType, long beginTime, long endTime) Gets the hardware configurations the device was in for the given time range, aggregated by the specified interval.","UsageEvents queryEvents(long beginTime, long endTime) Query for events in the given time range.","List<UsageStats> queryUsageStats(int intervalType, long beginTime, long endTime) Gets application usage stats for the given time range, aggregated by the specified interval.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.app.usage","constants":["int INTERVAL_BEST An interval type that will use the best fit interval for the given time range.","int INTERVAL_DAILY An interval type that spans a day.","int INTERVAL_MONTHLY An interval type that spans a month.","int INTERVAL_WEEKLY An interval type that spans a week.","int INTERVAL_YEARLY An interval type that spans a year."],"class":"UsageStatsManager","constructors":[],"fields":[]}