{"methods":["int bulkTransfer(UsbEndpoint endpoint, byte[] buffer, int length, int timeout) Performs a bulk transaction on the given endpoint.","int bulkTransfer(UsbEndpoint endpoint, byte[] buffer, int offset, int length, int timeout) Performs a bulk transaction on the given endpoint.","boolean claimInterface(UsbInterface intf, boolean force) Claims exclusive access to a UsbInterface.","void close() Releases all system resources related to the device.","int controlTransfer(int requestType, int request, int value, int index, byte[] buffer, int length, int timeout) Performs a control transaction on endpoint zero for this device.","int controlTransfer(int requestType, int request, int value, int index, byte[] buffer, int offset, int length, int timeout) Performs a control transaction on endpoint zero for this device.","int getFileDescriptor() Returns the native file descriptor for the device, or -1 if the device is not opened.","byte[] getRawDescriptors() Returns the raw USB descriptors for the device.","String getSerial() Returns the serial number for the device.","boolean releaseInterface(UsbInterface intf) Releases exclusive access to a UsbInterface.","UsbRequest requestWait() Waits for the result of a queue(ByteBuffer, int) operation Note that this may return requests queued on multiple UsbEndpoints.","boolean setConfiguration(UsbConfiguration configuration) Sets the device's current UsbConfiguration.","boolean setInterface(UsbInterface intf) Sets the current UsbInterface.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.hardware.usb","constants":[],"class":"UsbDeviceConnection","constructors":[],"fields":[]}