{"methods":["int clockSequence() The clock sequence value of the version 1, variant 2 UUID as per RFC 4122.","int compareTo(UUID uuid) Compares this UUID to the specified UUID.","boolean equals(Object object) Compares this UUID to another object for equality.","static UUID fromString(String uuid) Parses a UUID string with the format defined by toString().","long getLeastSignificantBits() The 64 least significant bits of the UUID.","long getMostSignificantBits() The 64 most significant bits of the UUID.","int hashCode() Returns a hash value for this UUID that is consistent with the equals(Object) method.","static UUID nameUUIDFromBytes(byte[] name) Generates a variant 2, version 3 (name-based, MD5-hashed) UUID as per RFC 4122.","long node() The node value of the version 1, variant 2 UUID as per RFC 4122.","static UUID randomUUID() Generates a variant 2, version 4 (randomly generated number) UUID as per RFC 4122.","long timestamp() The timestamp value of the version 1, variant 2 UUID as per RFC 4122.","String toString() Returns a string representation of this UUID in the following format, as per RFC 4122.","int variant() The variant of the UUID as per RFC 4122.","int version() The version of the variant 2 UUID as per RFC 4122.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Comparable abstract int compareTo(T another) Compares this object to the specified object to determine their relative order.","abstract int compareTo(T another) Compares this object to the specified object to determine their relative order."],"package":"java.util","constants":[],"class":"UUID","constructors":[],"fields":[]}