{"methods":["abstract ContentHandler getContentHandler() Gets the ContentHandler which receives the augmented validation result.","abstract ErrorHandler getErrorHandler() Gets the current ErrorHandler set to this ValidatorHandler.","boolean getFeature(String name) Look up the value of a feature flag.","Object getProperty(String name) Look up the value of a property.","abstract LSResourceResolver getResourceResolver() Gets the current LSResourceResolver set to this ValidatorHandler.","abstract TypeInfoProvider getTypeInfoProvider() Obtains the TypeInfoProvider implementation of this ValidatorHandler.","abstract void setContentHandler(ContentHandler receiver) Sets the ContentHandler which receives the augmented validation result.","abstract void setErrorHandler(ErrorHandler errorHandler) Sets the ErrorHandler to receive errors encountered during the validation.","void setFeature(String name, boolean value) Set the value of a feature flag.","void setProperty(String name, Object object) Set the value of a property.","abstract void setResourceResolver(LSResourceResolver resourceResolver) Sets the LSResourceResolver to customize resource resolution while in a validation episode.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.ContentHandler abstract void characters(char[] ch, int start, int length) Receive notification of character data. abstract void endDocument() Receive notification of the end of a document. abstract void endElement(String uri, String localName, String qName) Receive notification of the end of an element. abstract void endPrefixMapping(String prefix) End the scope of a prefix-URI mapping. abstract void ignorableWhitespace(char[] ch, int start, int length) Receive notification of ignorable whitespace in element content. abstract void processingInstruction(String target, String data) Receive notification of a processing instruction. abstract void setDocumentLocator(Locator locator) Receive an object for locating the origin of SAX document events. abstract void skippedEntity(String name) Receive notification of a skipped entity. abstract void startDocument() Receive notification of the beginning of a document. abstract void startElement(String uri, String localName, String qName, Attributes atts) Receive notification of the beginning of an element. abstract void startPrefixMapping(String prefix, String uri) Begin the scope of a prefix-URI Namespace mapping.","abstract void characters(char[] ch, int start, int length) Receive notification of character data.","abstract void endDocument() Receive notification of the end of a document.","abstract void endElement(String uri, String localName, String qName) Receive notification of the end of an element.","abstract void endPrefixMapping(String prefix) End the scope of a prefix-URI mapping.","abstract void ignorableWhitespace(char[] ch, int start, int length) Receive notification of ignorable whitespace in element content.","abstract void processingInstruction(String target, String data) Receive notification of a processing instruction.","abstract void setDocumentLocator(Locator locator) Receive an object for locating the origin of SAX document events.","abstract void skippedEntity(String name) Receive notification of a skipped entity.","abstract void startDocument() Receive notification of the beginning of a document.","abstract void startElement(String uri, String localName, String qName, Attributes atts) Receive notification of the beginning of an element.","abstract void startPrefixMapping(String prefix, String uri) Begin the scope of a prefix-URI Namespace mapping."],"package":"javax.xml.validation","constants":[],"class":"ValidatorHandler","constructors":[],"fields":[]}