{"methods":["synchronized boolean add(E object) Adds the specified object at the end of this vector.","void add(int location, E object) Adds the specified object into this vector at the specified location.","synchronized boolean addAll(Collection<?만xtendsE> collection) Adds the objects in the specified collection to the end of this vector.","synchronized boolean addAll(int location, Collection<?만xtendsE> collection) Inserts the objects in the specified collection at the specified location in this vector.","synchronized void addElement(E object) Adds the specified object at the end of this vector.","synchronized int capacity() Returns the number of elements this vector can hold without growing.","void clear() Removes all elements from this vector, leaving it empty.","synchronized Object clone() Returns a new vector with the same elements, size, capacity and capacity increment as this vector.","boolean contains(Object object) Searches this vector for the specified object.","synchronized boolean containsAll(Collection<?> collection) Searches this vector for all objects in the specified collection.","synchronized void copyInto(Object[] elements) Attempts to copy elements contained by this Vector into the corresponding elements of the supplied Object array.","synchronized E elementAt(int location) Returns the element at the specified location in this vector.","Enumeration<E> elements() Returns an enumeration on the elements of this vector.","synchronized void ensureCapacity(int minimumCapacity) Ensures that this vector can hold the specified number of elements without growing.","synchronized boolean equals(Object object) Compares the specified object to this vector and returns if they are equal.","synchronized E firstElement() Returns the first element in this vector.","E get(int location) Returns the element at the specified location in this vector.","synchronized int hashCode() Returns an integer hash code for the receiver.","synchronized int indexOf(Object object, int location) Searches in this vector for the index of the specified object.","int indexOf(Object object) Searches in this vector for the index of the specified object.","synchronized void insertElementAt(E object, int location) Inserts the specified object into this vector at the specified location.","synchronized boolean isEmpty() Returns if this vector has no elements, a size of zero.","synchronized E lastElement() Returns the last element in this vector.","synchronized int lastIndexOf(Object object, int location) Searches in this vector for the index of the specified object.","synchronized int lastIndexOf(Object object) Searches in this vector for the index of the specified object.","synchronized E remove(int location) Removes the object at the specified location from this vector.","boolean remove(Object object) Removes the first occurrence, starting at the beginning and moving towards the end, of the specified object from this vector.","synchronized boolean removeAll(Collection<?> collection) Removes all occurrences in this vector of each object in the specified Collection.","synchronized void removeAllElements() Removes all elements from this vector, leaving the size zero and the capacity unchanged.","synchronized boolean removeElement(Object object) Removes the first occurrence, starting at the beginning and moving towards the end, of the specified object from this vector.","synchronized void removeElementAt(int location) Removes the element found at index position location from this Vector.","synchronized boolean retainAll(Collection<?> collection) Removes all objects from this vector that are not contained in the specified collection.","synchronized E set(int location, E object) Replaces the element at the specified location in this vector with the specified object.","synchronized void setElementAt(E object, int location) Replaces the element at the specified location in this vector with the specified object.","synchronized void setSize(int length) Sets the size of this vector to the specified size.","synchronized int size() Returns the number of elements in this vector.","synchronized List<E> subList(int start, int end) Returns a List of the specified portion of this vector from the start index to one less than the end index.","synchronized <T> T[] toArray(T[] contents) Returns an array containing all elements contained in this vector.","synchronized Object[] toArray() Returns a new array containing all elements contained in this vector.","synchronized String toString() Returns the string representation of this vector.","synchronized void trimToSize() Sets the capacity of this vector to be the same as the size.","void removeRange(int start, int end) Removes the objects in the specified range from the start to the, but not including, end index.","[Expand] Inherited Methods","From class java.util.AbstractList boolean add(E object) Adds the specified object at the end of this List. void add(int location, E object) Inserts the specified object into this List at the specified location. boolean addAll(int location, Collection<?만xtendsE> collection) Inserts the objects in the specified Collection at the specified location in this List. void clear() Removes all elements from this list, leaving it empty. boolean equals(Object object) Compares the specified object to this list and return true if they are equal. abstract E get(int location) Returns the element at the specified location in this list. int hashCode() Returns the hash code of this list. int indexOf(Object object) Searches this list for the specified object and returns the index of the first occurrence. Iterator<E> iterator() Returns an iterator on the elements of this list. int lastIndexOf(Object object) Searches this list for the specified object and returns the index of the last occurrence. ListIterator<E> listIterator(int location) Returns a list iterator on the elements of this list. ListIterator<E> listIterator() Returns a ListIterator on the elements of this list. E remove(int location) Removes the object at the specified location from this list. void removeRange(int start, int end) Removes the objects in the specified range from the start to the end index minus one. E set(int location, E object) Replaces the element at the specified location in this list with the specified object. List<E> subList(int start, int end) Returns a part of consecutive elements of this list as a view.","boolean add(E object) Adds the specified object at the end of this List.","void add(int location, E object) Inserts the specified object into this List at the specified location.","boolean addAll(int location, Collection<?만xtendsE> collection) Inserts the objects in the specified Collection at the specified location in this List.","void clear() Removes all elements from this list, leaving it empty.","boolean equals(Object object) Compares the specified object to this list and return true if they are equal.","abstract E get(int location) Returns the element at the specified location in this list.","int hashCode() Returns the hash code of this list.","int indexOf(Object object) Searches this list for the specified object and returns the index of the first occurrence.","Iterator<E> iterator() Returns an iterator on the elements of this list.","int lastIndexOf(Object object) Searches this list for the specified object and returns the index of the last occurrence.","ListIterator<E> listIterator(int location) Returns a list iterator on the elements of this list.","ListIterator<E> listIterator() Returns a ListIterator on the elements of this list.","E remove(int location) Removes the object at the specified location from this list.","void removeRange(int start, int end) Removes the objects in the specified range from the start to the end index minus one.","E set(int location, E object) Replaces the element at the specified location in this list with the specified object.","List<E> subList(int start, int end) Returns a part of consecutive elements of this list as a view.","From class java.util.AbstractCollection boolean add(E object) Attempts to add object to the contents of this Collection (optional). boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in collection to the contents of this Collection (optional). void clear() Removes all elements from this Collection, leaving it empty (optional). boolean contains(Object object) Tests whether this Collection contains the specified object. boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection. boolean isEmpty() Returns if this Collection contains no elements. abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection. boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional). boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional). boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional). abstract int size() Returns a count of how many objects this Collection contains. <T> T[] toArray(T[] contents) Returns an array containing all elements contained in this Collection. Object[] toArray() Returns a new array containing all elements contained in this Collection. String toString() Returns the string representation of this Collection.","boolean add(E object) Attempts to add object to the contents of this Collection (optional).","boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in collection to the contents of this Collection (optional).","void clear() Removes all elements from this Collection, leaving it empty (optional).","boolean contains(Object object) Tests whether this Collection contains the specified object.","boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection.","boolean isEmpty() Returns if this Collection contains no elements.","abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection.","boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional).","boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional).","boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional).","abstract int size() Returns a count of how many objects this Collection contains.","<T> T[] toArray(T[] contents) Returns an array containing all elements contained in this Collection.","Object[] toArray() Returns a new array containing all elements contained in this Collection.","String toString() Returns the string representation of this Collection.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.lang.Iterable abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","abstract Iterator<T> iterator() Returns an Iterator for the elements in this object.","From interface java.util.Collection abstract boolean add(E object) Attempts to add object to the contents of this Collection (optional). abstract boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in Collection to the contents of this Collection (optional). abstract void clear() Removes all elements from this Collection, leaving it empty (optional). abstract boolean contains(Object object) Tests whether this Collection contains the specified object. abstract boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection. abstract boolean equals(Object object) Compares the argument to the receiver, and returns true if they represent the same object using a class specific comparison. abstract int hashCode() Returns an integer hash code for the receiver. abstract boolean isEmpty() Returns if this Collection contains no elements. abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection. abstract boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional). abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional). abstract boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional). abstract int size() Returns a count of how many objects this Collection contains. abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this Collection. abstract Object[] toArray() Returns a new array containing all elements contained in this Collection.","abstract boolean add(E object) Attempts to add object to the contents of this Collection (optional).","abstract boolean addAll(Collection<?만xtendsE> collection) Attempts to add all of the objects contained in Collection to the contents of this Collection (optional).","abstract void clear() Removes all elements from this Collection, leaving it empty (optional).","abstract boolean contains(Object object) Tests whether this Collection contains the specified object.","abstract boolean containsAll(Collection<?> collection) Tests whether this Collection contains all objects contained in the specified Collection.","abstract boolean equals(Object object) Compares the argument to the receiver, and returns true if they represent the same object using a class specific comparison.","abstract int hashCode() Returns an integer hash code for the receiver.","abstract boolean isEmpty() Returns if this Collection contains no elements.","abstract Iterator<E> iterator() Returns an instance of Iterator that may be used to access the objects contained by this Collection.","abstract boolean remove(Object object) Removes one instance of the specified object from this Collection if one is contained (optional).","abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this Collection of each object in the specified Collection (optional).","abstract boolean retainAll(Collection<?> collection) Removes all objects from this Collection that are not also found in the Collection passed (optional).","abstract int size() Returns a count of how many objects this Collection contains.","abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this Collection.","abstract Object[] toArray() Returns a new array containing all elements contained in this Collection.","From interface java.util.List abstract boolean add(E object) Adds the specified object at the end of this List. abstract void add(int location, E object) Inserts the specified object into this List at the specified location. abstract boolean addAll(Collection<?만xtendsE> collection) Adds the objects in the specified collection to the end of this List. abstract boolean addAll(int location, Collection<?만xtendsE> collection) Inserts the objects in the specified collection at the specified location in this List. abstract void clear() Removes all elements from this List, leaving it empty. abstract boolean contains(Object object) Tests whether this List contains the specified object. abstract boolean containsAll(Collection<?> collection) Tests whether this List contains all objects contained in the specified collection. abstract boolean equals(Object object) Compares the given object with the List, and returns true if they represent the same object using a class specific comparison. abstract E get(int location) Returns the element at the specified location in this List. abstract int hashCode() Returns the hash code for this List. abstract int indexOf(Object object) Searches this List for the specified object and returns the index of the first occurrence. abstract boolean isEmpty() Returns whether this List contains no elements. abstract Iterator<E> iterator() Returns an iterator on the elements of this List. abstract int lastIndexOf(Object object) Searches this List for the specified object and returns the index of the last occurrence. abstract ListIterator<E> listIterator(int location) Returns a list iterator on the elements of this List. abstract ListIterator<E> listIterator() Returns a List iterator on the elements of this List. abstract E remove(int location) Removes the object at the specified location from this List. abstract boolean remove(Object object) Removes the first occurrence of the specified object from this List. abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this List of each object in the specified collection. abstract boolean retainAll(Collection<?> collection) Removes all objects from this List that are not contained in the specified collection. abstract E set(int location, E object) Replaces the element at the specified location in this List with the specified object. abstract int size() Returns the number of elements in this List. abstract List<E> subList(int start, int end) Returns a List of the specified portion of this List from the given start index to the end index minus one. abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this List. abstract Object[] toArray() Returns an array containing all elements contained in this List.","abstract boolean add(E object) Adds the specified object at the end of this List.","abstract void add(int location, E object) Inserts the specified object into this List at the specified location.","abstract boolean addAll(Collection<?만xtendsE> collection) Adds the objects in the specified collection to the end of this List.","abstract boolean addAll(int location, Collection<?만xtendsE> collection) Inserts the objects in the specified collection at the specified location in this List.","abstract void clear() Removes all elements from this List, leaving it empty.","abstract boolean contains(Object object) Tests whether this List contains the specified object.","abstract boolean containsAll(Collection<?> collection) Tests whether this List contains all objects contained in the specified collection.","abstract boolean equals(Object object) Compares the given object with the List, and returns true if they represent the same object using a class specific comparison.","abstract E get(int location) Returns the element at the specified location in this List.","abstract int hashCode() Returns the hash code for this List.","abstract int indexOf(Object object) Searches this List for the specified object and returns the index of the first occurrence.","abstract boolean isEmpty() Returns whether this List contains no elements.","abstract Iterator<E> iterator() Returns an iterator on the elements of this List.","abstract int lastIndexOf(Object object) Searches this List for the specified object and returns the index of the last occurrence.","abstract ListIterator<E> listIterator(int location) Returns a list iterator on the elements of this List.","abstract ListIterator<E> listIterator() Returns a List iterator on the elements of this List.","abstract E remove(int location) Removes the object at the specified location from this List.","abstract boolean remove(Object object) Removes the first occurrence of the specified object from this List.","abstract boolean removeAll(Collection<?> collection) Removes all occurrences in this List of each object in the specified collection.","abstract boolean retainAll(Collection<?> collection) Removes all objects from this List that are not contained in the specified collection.","abstract E set(int location, E object) Replaces the element at the specified location in this List with the specified object.","abstract int size() Returns the number of elements in this List.","abstract List<E> subList(int start, int end) Returns a List of the specified portion of this List from the given start index to the end index minus one.","abstract <T> T[] toArray(T[] array) Returns an array containing all elements contained in this List.","abstract Object[] toArray() Returns an array containing all elements contained in this List."],"package":"java.util","constants":[],"class":"Vector","constructors":[],"fields":["protected int capacityIncrement How many elements should be added to the vector when it is detected that it needs to grow to accommodate extra entries.","protected int elementCount The number of elements or the size of the vector.","protected Object[] elementData The elements of the vector."]}