{"methods":["final boolean areChildRoundedCornersEnabled() Returns true if rounded corners are enabled for children of this row.","final void enableChildRoundedCorners(boolean enable) Enables or disabled rounded corners on children of this row.","int getNumberOfColumns() Returns the number of columns in the vertical grid.","final OnItemClickedListener getOnItemClickedListener() This method is deprecated. Use getOnItemViewClickedListener()","final OnItemSelectedListener getOnItemSelectedListener() This method is deprecated. Use getOnItemViewSelectedListener()","final OnItemViewClickedListener getOnItemViewClickedListener() Returns the item clicked listener.","final OnItemViewSelectedListener getOnItemViewSelectedListener() Returns the item selected listener.","final boolean getShadowEnabled() Returns true if child shadow is enabled.","boolean isUsingDefaultShadow() Returns true if opticalBounds is supported (SDK >= 18) so that default shadow is applied to each individual child of VerticalGridView.","boolean isUsingZOrder() Returns true if SDK >= L, where Z shadow is enabled so that Z order is enabled on each child of vertical grid.","void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item.","final VerticalGridPresenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View.","void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item.","void setNumberOfColumns(int numColumns) Sets the number of columns in the vertical grid.","final void setOnItemClickedListener(OnItemClickedListener listener) This method is deprecated. Use setOnItemViewClickedListener(OnItemViewClickedListener)","final void setOnItemSelectedListener(OnItemSelectedListener listener) This method is deprecated. Use setOnItemViewSelectedListener(OnItemViewSelectedListener)","final void setOnItemViewClickedListener(OnItemViewClickedListener listener) Sets the item clicked listener.","final void setOnItemViewSelectedListener(OnItemViewSelectedListener listener) Sets the item selected listener.","final void setShadowEnabled(boolean enabled) Enable or disable child shadow.","VerticalGridPresenter.ViewHolder createGridViewHolder(ViewGroup parent) Subclass may override this to inflate a different layout.","void initializeGridViewHolder(VerticalGridPresenter.ViewHolder vh) Called after a VerticalGridPresenter.ViewHolder is created.","[Expand] Inherited Methods","From class android.support.v17.leanback.widget.Presenter static void cancelAnimationsRecursive(View view) Utility method for removing all running animations on a view. abstract void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item. abstract Presenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View. abstract void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item. void onViewAttachedToWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been attached to a window. void onViewDetachedFromWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been detached from its window. void setOnClickListener(Presenter.ViewHolder holder, View.OnClickListener listener) Called to set a click listener for the given view holder.","static void cancelAnimationsRecursive(View view) Utility method for removing all running animations on a view.","abstract void onBindViewHolder(Presenter.ViewHolder viewHolder, Object item) Binds a View to an item.","abstract Presenter.ViewHolder onCreateViewHolder(ViewGroup parent) Creates a new View.","abstract void onUnbindViewHolder(Presenter.ViewHolder viewHolder) Unbinds a View from an item.","void onViewAttachedToWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been attached to a window.","void onViewDetachedFromWindow(Presenter.ViewHolder holder) Called when a view created by this presenter has been detached from its window.","void setOnClickListener(Presenter.ViewHolder holder, View.OnClickListener listener) Called to set a click listener for the given view holder.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v17.leanback.widget","constants":[],"class":"VerticalGridPresenter","constructors":[],"fields":[]}