{"methods":["boolean dispatchPopulateAccessibilityEvent(View host, AccessibilityEvent event) Dispatches an AccessibilityEvent to the host View first and then to its children for adding their text content to the event.","AccessibilityNodeProvider getAccessibilityNodeProvider(View host) Gets the provider for managing a virtual view hierarchy rooted at this View and reported to AccessibilityServices that explore the window content.","void onInitializeAccessibilityEvent(View host, AccessibilityEvent event) Initializes an AccessibilityEvent with information about the the host View which is the event source.","void onInitializeAccessibilityNodeInfo(View host, AccessibilityNodeInfo info) Initializes an AccessibilityNodeInfo with information about the host view.","void onPopulateAccessibilityEvent(View host, AccessibilityEvent event) Gives a chance to the host View to populate the accessibility event with its text content.","boolean onRequestSendAccessibilityEvent(ViewGroup host, View child, AccessibilityEvent event) Called when a child of the host View has requested sending an AccessibilityEvent and gives an opportunity to the parent (the host) to augment the event.","boolean performAccessibilityAction(View host, int action, Bundle args) Performs the specified accessibility action on the view.","void sendAccessibilityEvent(View host, int eventType) Sends an accessibility event of the given type.","void sendAccessibilityEventUnchecked(View host, AccessibilityEvent event) Sends an accessibility event.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"View.AccessibilityDelegate","constructors":[],"fields":[]}