{"methods":["void addOnDrawListener(ViewTreeObserver.OnDrawListener listener) Register a callback to be invoked when the view tree is about to be drawn.","void addOnGlobalFocusChangeListener(ViewTreeObserver.OnGlobalFocusChangeListener listener) Register a callback to be invoked when the focus state within the view tree changes.","void addOnGlobalLayoutListener(ViewTreeObserver.OnGlobalLayoutListener listener) Register a callback to be invoked when the global layout state or the visibility of views within the view tree changes","void addOnPreDrawListener(ViewTreeObserver.OnPreDrawListener listener) Register a callback to be invoked when the view tree is about to be drawn","void addOnScrollChangedListener(ViewTreeObserver.OnScrollChangedListener listener) Register a callback to be invoked when a view has been scrolled.","void addOnTouchModeChangeListener(ViewTreeObserver.OnTouchModeChangeListener listener) Register a callback to be invoked when the invoked when the touch mode changes.","void addOnWindowAttachListener(ViewTreeObserver.OnWindowAttachListener listener) Register a callback to be invoked when the view hierarchy is attached to a window.","void addOnWindowFocusChangeListener(ViewTreeObserver.OnWindowFocusChangeListener listener) Register a callback to be invoked when the window focus state within the view tree changes.","final void dispatchOnDraw() Notifies registered listeners that the drawing pass is about to start.","final void dispatchOnGlobalLayout() Notifies registered listeners that a global layout happened.","final boolean dispatchOnPreDraw() Notifies registered listeners that the drawing pass is about to start.","boolean isAlive() Indicates whether this ViewTreeObserver is alive.","void removeGlobalOnLayoutListener(ViewTreeObserver.OnGlobalLayoutListener victim) This method was deprecated in API level 16. Use #removeOnGlobalLayoutListener instead","void removeOnDrawListener(ViewTreeObserver.OnDrawListener victim) Remove a previously installed pre-draw callback.","void removeOnGlobalFocusChangeListener(ViewTreeObserver.OnGlobalFocusChangeListener victim) Remove a previously installed focus change callback.","void removeOnGlobalLayoutListener(ViewTreeObserver.OnGlobalLayoutListener victim) Remove a previously installed global layout callback","void removeOnPreDrawListener(ViewTreeObserver.OnPreDrawListener victim) Remove a previously installed pre-draw callback","void removeOnScrollChangedListener(ViewTreeObserver.OnScrollChangedListener victim) Remove a previously installed scroll-changed callback","void removeOnTouchModeChangeListener(ViewTreeObserver.OnTouchModeChangeListener victim) Remove a previously installed touch mode change callback","void removeOnWindowAttachListener(ViewTreeObserver.OnWindowAttachListener victim) Remove a previously installed window attach callback.","void removeOnWindowFocusChangeListener(ViewTreeObserver.OnWindowFocusChangeListener victim) Remove a previously installed window focus change callback.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"ViewTreeObserver","constructors":[],"fields":[]}