{"methods":["int clampViewPositionHorizontal(View child, int left, int dx) Restrict the motion of the dragged child view along the horizontal axis.","int clampViewPositionVertical(View child, int top, int dy) Restrict the motion of the dragged child view along the vertical axis.","int getOrderedChildIndex(int index) Called to determine the Z-order of child views.","int getViewHorizontalDragRange(View child) Return the magnitude of a draggable child view's horizontal range of motion in pixels.","int getViewVerticalDragRange(View child) Return the magnitude of a draggable child view's vertical range of motion in pixels.","void onEdgeDragStarted(int edgeFlags, int pointerId) Called when the user has started a deliberate drag away from one of the subscribed edges in the parent view while no child view is currently captured.","boolean onEdgeLock(int edgeFlags) Called when the given edge may become locked.","void onEdgeTouched(int edgeFlags, int pointerId) Called when one of the subscribed edges in the parent view has been touched by the user while no child view is currently captured.","void onViewCaptured(View capturedChild, int activePointerId) Called when a child view is captured for dragging or settling.","void onViewDragStateChanged(int state) Called when the drag state changes.","void onViewPositionChanged(View changedView, int left, int top, int dx, int dy) Called when the captured view's position changes as the result of a drag or settle.","void onViewReleased(View releasedChild, float xvel, float yvel) Called when the child view is no longer being actively dragged.","abstract boolean tryCaptureView(View child, int pointerId) Called when the user's input indicates that they want to capture the given child view with the pointer indicated by pointerId.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.widget","constants":[],"class":"ViewDragHelper.Callback","constructors":[],"fields":[]}