{"methods":["static ViewConfiguration get(Context context) Returns a configuration for the specified context.","static int getDoubleTapTimeout()","static int getEdgeSlop() This method was deprecated in API level 3. Use getScaledEdgeSlop() instead.","static int getFadingEdgeLength() This method was deprecated in API level 3. Use getScaledFadingEdgeLength() instead.","static long getGlobalActionKeyTimeout() This method was deprecated in API level 20. This timeout should not be used by applications","static int getJumpTapTimeout()","static int getKeyRepeatDelay()","static int getKeyRepeatTimeout()","static int getLongPressTimeout()","static int getMaximumDrawingCacheSize() This method was deprecated in API level 3. Use getScaledMaximumDrawingCacheSize() instead.","static int getMaximumFlingVelocity() This method was deprecated in API level 4. Use getScaledMaximumFlingVelocity() instead.","static int getMinimumFlingVelocity() This method was deprecated in API level 3. Use getScaledMinimumFlingVelocity() instead.","static int getPressedStateDuration()","int getScaledDoubleTapSlop()","int getScaledEdgeSlop()","int getScaledFadingEdgeLength()","int getScaledMaximumDrawingCacheSize() The maximum drawing cache size expressed in bytes.","int getScaledMaximumFlingVelocity()","int getScaledMinimumFlingVelocity()","int getScaledOverflingDistance()","int getScaledOverscrollDistance()","int getScaledPagingTouchSlop()","int getScaledScrollBarSize()","int getScaledTouchSlop()","int getScaledWindowTouchSlop()","static int getScrollBarFadeDuration()","static int getScrollBarSize() This method was deprecated in API level 3. Use getScaledScrollBarSize() instead.","static int getScrollDefaultDelay()","static float getScrollFriction() The amount of friction applied to scrolls and flings.","static int getTapTimeout()","static int getTouchSlop() This method was deprecated in API level 3. Use getScaledTouchSlop() instead.","static int getWindowTouchSlop() This method was deprecated in API level 3. Use getScaledWindowTouchSlop() instead.","static long getZoomControlsTimeout() The amount of time that the zoom controls should be displayed on the screen expressed in milliseconds.","boolean hasPermanentMenuKey() Report if the device has a permanent menu key available to the user.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":[],"class":"ViewConfiguration","constructors":[],"fields":[]}