{"methods":["static void dumpCapturedView(String tag, Object view) Dump view info for id based instrument test generation (and possibly further data analysis).","static void startHierarchyTracing(String prefix, View view) This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","static void startRecyclerTracing(String prefix, View view) This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","static void stopHierarchyTracing() This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","static void stopRecyclerTracing() This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","static void trace(View view, ViewDebug.RecyclerTraceType type, int... parameters) This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","static void trace(View view, ViewDebug.HierarchyTraceType type) This method was deprecated in API level 16. This method is now unused and invoking it is a no-op","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.view","constants":["boolean TRACE_HIERARCHY This constant was deprecated in API level 16. This flag is now unused","boolean TRACE_RECYCLER This constant was deprecated in API level 16. This flag is now unused"],"class":"ViewDebug","constructors":[],"fields":[]}