{"methods":["static int getLayoutMode(ViewGroup group) Returns the basis of alignment during layout operations on this ViewGroup: either LAYOUT_MODE_CLIP_BOUNDS or LAYOUT_MODE_OPTICAL_BOUNDS.","static boolean isTransitionGroup(ViewGroup group) Returns true if this ViewGroup should be considered as a single entity for removal when executing an Activity transition.","static boolean onRequestSendAccessibilityEvent(ViewGroup group, View child, AccessibilityEvent event) Called when a child has requested sending an AccessibilityEvent and gives an opportunity to its parent to augment the event.","static void setLayoutMode(ViewGroup group, int mode) Sets the basis of alignment during the layout of this ViewGroup.","static void setMotionEventSplittingEnabled(ViewGroup group, boolean split) Enable or disable the splitting of MotionEvents to multiple children during touch event dispatch.","static void setTransitionGroup(ViewGroup group, boolean isTransitionGroup) Changes whether or not this ViewGroup should be treated as a single entity during Activity Transitions.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.view","constants":["int LAYOUT_MODE_CLIP_BOUNDS This constant is a layoutMode.","int LAYOUT_MODE_OPTICAL_BOUNDS This constant is a layoutMode."],"class":"ViewGroupCompat","constructors":[],"fields":[]}