{"methods":["boolean canVirtualize(int inputChannelMask, int virtualizationMode) Checks if the combination of a channel mask and virtualization mode is supported by this virtualizer.","boolean forceVirtualizationMode(int virtualizationMode) Forces the virtualizer effect to use the given processing mode.","Virtualizer.Settings getProperties() Gets the virtualizer properties.","short getRoundedStrength() Gets the current strength of the effect.","boolean getSpeakerAngles(int inputChannelMask, int virtualizationMode, int[] angles) Queries the virtual speaker angles (azimuth and elevation) for a combination of a channel mask and virtualization mode.","boolean getStrengthSupported() Indicates whether setting strength is supported.","int getVirtualizationMode() Return the virtualization mode being used, if any.","void setParameterListener(Virtualizer.OnParameterChangeListener listener) Registers an OnParameterChangeListener interface.","void setProperties(Virtualizer.Settings settings) Sets the virtualizer properties.","void setStrength(short strength) Sets the strength of the virtualizer effect.","[Expand] Inherited Methods","From class android.media.audiofx.AudioEffect void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. AudioEffect.Descriptor getDescriptor() Get the effect descriptor. boolean getEnabled() Returns effect enabled state int getId() Returns effect unique identifier. boolean hasControl() Checks if this AudioEffect object is controlling the effect engine. static Descriptor[] queryEffects() Query all effects available on the platform. void release() Releases the native AudioEffect resources. void setControlStatusListener(AudioEffect.OnControlStatusChangeListener listener) Sets the listener AudioEffect notifies when the effect engine control is taken or returned. void setEnableStatusListener(AudioEffect.OnEnableStatusChangeListener listener) Sets the listener AudioEffect notifies when the effect engine is enabled or disabled. int setEnabled(boolean enabled) Enable or disable the effect.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","AudioEffect.Descriptor getDescriptor() Get the effect descriptor.","boolean getEnabled() Returns effect enabled state","int getId() Returns effect unique identifier.","boolean hasControl() Checks if this AudioEffect object is controlling the effect engine.","static Descriptor[] queryEffects() Query all effects available on the platform.","void release() Releases the native AudioEffect resources.","void setControlStatusListener(AudioEffect.OnControlStatusChangeListener listener) Sets the listener AudioEffect notifies when the effect engine control is taken or returned.","void setEnableStatusListener(AudioEffect.OnEnableStatusChangeListener listener) Sets the listener AudioEffect notifies when the effect engine is enabled or disabled.","int setEnabled(boolean enabled) Enable or disable the effect.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.audiofx","constants":["int PARAM_STRENGTH Virtualizer effect strength.","int PARAM_STRENGTH_SUPPORTED Is strength parameter supported by virtualizer engine.","int VIRTUALIZATION_MODE_AUTO A virtualization mode used to indicate the virtualizer effect must stop forcing the processing to a particular mode in forceVirtualizationMode(int).","int VIRTUALIZATION_MODE_BINAURAL A virtualization mode typically used over headphones.","int VIRTUALIZATION_MODE_OFF A virtualization mode indicating virtualization processing is not active.","int VIRTUALIZATION_MODE_TRANSAURAL A virtualization mode typically used over speakers.","[Expand] Inherited Constants","From class android.media.audiofx.AudioEffect String ACTION_CLOSE_AUDIO_EFFECT_CONTROL_SESSION Intent to signal to the effect control application or service that an audio session is closed and that effects should not be applied anymore. String ACTION_DISPLAY_AUDIO_EFFECT_CONTROL_PANEL Intent to launch an audio effect control panel UI. String ACTION_OPEN_AUDIO_EFFECT_CONTROL_SESSION Intent to signal to the effect control application or service that a new audio session is opened and requires audio effects to be applied. int ALREADY_EXISTS Internal operation status. int CONTENT_TYPE_GAME Value for EXTRA_CONTENT_TYPE when the type of content played is game audio int CONTENT_TYPE_MOVIE Value for EXTRA_CONTENT_TYPE when the type of content played is video or movie int CONTENT_TYPE_MUSIC Value for EXTRA_CONTENT_TYPE when the type of content played is music int CONTENT_TYPE_VOICE Value for EXTRA_CONTENT_TYPE when the type of content played is voice audio String EFFECT_AUXILIARY Effect connection mode is auxiliary. String EFFECT_INSERT Effect connection mode is insert. int ERROR Unspecified error. int ERROR_BAD_VALUE Operation failed due to bad parameter value. int ERROR_DEAD_OBJECT Operation failed due to dead remote object. int ERROR_INVALID_OPERATION Operation failed because it was requested in wrong state. int ERROR_NO_INIT Operation failed due to bad object initialization. int ERROR_NO_MEMORY Operation failed due to lack of memory. String EXTRA_AUDIO_SESSION Contains the ID of the audio session the effects should be applied to. String EXTRA_CONTENT_TYPE Indicates which type of content is played by the application. String EXTRA_PACKAGE_NAME Contains the package name of the calling application. int SUCCESS Successful operation.","String ACTION_CLOSE_AUDIO_EFFECT_CONTROL_SESSION Intent to signal to the effect control application or service that an audio session is closed and that effects should not be applied anymore.","String ACTION_DISPLAY_AUDIO_EFFECT_CONTROL_PANEL Intent to launch an audio effect control panel UI.","String ACTION_OPEN_AUDIO_EFFECT_CONTROL_SESSION Intent to signal to the effect control application or service that a new audio session is opened and requires audio effects to be applied.","int ALREADY_EXISTS Internal operation status.","int CONTENT_TYPE_GAME Value for EXTRA_CONTENT_TYPE when the type of content played is game audio","int CONTENT_TYPE_MOVIE Value for EXTRA_CONTENT_TYPE when the type of content played is video or movie","int CONTENT_TYPE_MUSIC Value for EXTRA_CONTENT_TYPE when the type of content played is music","int CONTENT_TYPE_VOICE Value for EXTRA_CONTENT_TYPE when the type of content played is voice audio","String EFFECT_AUXILIARY Effect connection mode is auxiliary.","String EFFECT_INSERT Effect connection mode is insert.","int ERROR Unspecified error.","int ERROR_BAD_VALUE Operation failed due to bad parameter value.","int ERROR_DEAD_OBJECT Operation failed due to dead remote object.","int ERROR_INVALID_OPERATION Operation failed because it was requested in wrong state.","int ERROR_NO_INIT Operation failed due to bad object initialization.","int ERROR_NO_MEMORY Operation failed due to lack of memory.","String EXTRA_AUDIO_SESSION Contains the ID of the audio session the effects should be applied to.","String EXTRA_CONTENT_TYPE Indicates which type of content is played by the application.","String EXTRA_PACKAGE_NAME Contains the package name of the calling application.","int SUCCESS Successful operation."],"class":"Virtualizer","constructors":[],"fields":[]}