{"methods":["int getCaptureSize() Returns current capture size.","static int[] getCaptureSizeRange() Returns the capture size range.","boolean getEnabled() Get current activation state of the visualizer.","int getFft(byte[] fft) Returns a frequency capture of currently playing audio content.","static int getMaxCaptureRate() Returns the maximum capture rate for the callback capture method.","int getMeasurementMode() Returns the current measurement modes performed by this audio effect","int getMeasurementPeakRms(Visualizer.MeasurementPeakRms measurement) Retrieves the latest peak and RMS measurement.","int getSamplingRate() Returns the sampling rate of the captured audio.","int getScalingMode() Returns the current scaling mode on the captured visualization data.","int getWaveForm(byte[] waveform) Returns a waveform capture of currently playing audio content.","void release() Releases the native Visualizer resources.","int setCaptureSize(int size) Sets the capture size, i.e.","int setDataCaptureListener(Visualizer.OnDataCaptureListener listener, int rate, boolean waveform, boolean fft) Registers an OnDataCaptureListener interface and specifies the rate at which the capture should be updated as well as the type of capture requested.","int setEnabled(boolean enabled) Enable or disable the visualization engine.","int setMeasurementMode(int mode) Sets the combination of measurement modes to be performed by this audio effect.","int setScalingMode(int mode) Set the type of scaling applied on the captured visualization data.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.media.audiofx","constants":["int ALREADY_EXISTS Internal operation status.","int ERROR Unspecified error.","int ERROR_BAD_VALUE Operation failed due to bad parameter value.","int ERROR_DEAD_OBJECT Operation failed due to dead remote object.","int ERROR_INVALID_OPERATION Operation failed because it was requested in wrong state.","int ERROR_NO_INIT Operation failed due to bad object initialization.","int ERROR_NO_MEMORY Operation failed due to lack of memory.","int MEASUREMENT_MODE_NONE Defines a measurement mode in which no measurements are performed.","int MEASUREMENT_MODE_PEAK_RMS Defines a measurement mode which computes the peak and RMS value in mB, where 0mB is the maximum sample value, and -9600mB is the minimum value.","int SCALING_MODE_AS_PLAYED Defines a capture mode where the playback volume will affect (scale) the range of the captured data.","int SCALING_MODE_NORMALIZED Defines a capture mode where amplification is applied based on the content of the captured data.","int STATE_ENABLED State of a Visualizer object that is active.","int STATE_INITIALIZED State of a Visualizer object that is ready to be used.","int STATE_UNINITIALIZED State of a Visualizer object that was not successfully initialized upon creation","int SUCCESS Successful operation."],"class":"Visualizer","constructors":[],"fields":[]}