{"methods":["static Uri buildSourceUri(String packageName) A convenience method to build voicemail URI specific to a source package by appending PARAM_KEY_SOURCE_PACKAGE param to the base URI.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String DATE The date the voicemail was sent, in milliseconds since the epoch Type: INTEGER (long)","String DIR_TYPE The MIME type for a collection of voicemails.","String DURATION The duration of the voicemail in seconds.","String HAS_CONTENT Whether the media content for this voicemail is available for consumption.","String IS_READ Whether this item has been read or otherwise consumed by the user.","String ITEM_TYPE The MIME type for a single voicemail.","String MIME_TYPE MIME type of the media content for the voicemail.","String NUMBER Phone number of the voicemail sender.","String SOURCE_DATA Application-specific data available to the source application that inserted the voicemail.","String SOURCE_PACKAGE Package name of the source application that inserted the voicemail.","String TRANSCRIPTION The transcription of the voicemail entry.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row.","From interface android.provider.OpenableColumns String DISPLAY_NAME The human-friendly name of file. String SIZE The number of bytes in the file identified by the openable URI.","String DISPLAY_NAME The human-friendly name of file.","String SIZE The number of bytes in the file identified by the openable URI."],"class":"VoicemailContract.Voicemails","constructors":[],"fields":["public static final Uri CONTENT_URI URI to insert/retrieve voicemails."]}