{"methods":["static Uri buildSourceUri(String packageName) A convenience method to build status URI specific to a source package by appending PARAM_KEY_SOURCE_PACKAGE param to the base URI.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.provider","constants":["String CONFIGURATION_STATE The configuration state of the voicemail source.","int CONFIGURATION_STATE_CAN_BE_CONFIGURED Value of CONFIGURATION_STATE to indicate the visual voicemail is not yet configured on this device but can be configured by the user.","int CONFIGURATION_STATE_NOT_CONFIGURED Value of CONFIGURATION_STATE to indicate the visual voicemail is not yet configured on this device.","int CONFIGURATION_STATE_OK Value of CONFIGURATION_STATE to indicate an all OK configuration status.","String DATA_CHANNEL_STATE The data channel state of the voicemail source.","int DATA_CHANNEL_STATE_NO_CONNECTION Value of DATA_CHANNEL_STATE to indicate that data channel connection is not working.","int DATA_CHANNEL_STATE_OK Value of DATA_CHANNEL_STATE to indicate that data channel is working fine.","String DIR_TYPE The MIME type for a collection of voicemail source statuses.","String ITEM_TYPE The MIME type for a single voicemail source status entry.","String NOTIFICATION_CHANNEL_STATE The notification channel state of the voicemail source.","int NOTIFICATION_CHANNEL_STATE_MESSAGE_WAITING Value of NOTIFICATION_CHANNEL_STATE to indicate that there are messages waiting on the server but the details are not known.","int NOTIFICATION_CHANNEL_STATE_NO_CONNECTION Value of NOTIFICATION_CHANNEL_STATE to indicate that the notification channel connection is not working.","int NOTIFICATION_CHANNEL_STATE_OK Value of NOTIFICATION_CHANNEL_STATE to indicate that the notification channel is working fine.","String SETTINGS_URI The URI to call to invoke source specific voicemail settings screen.","String SOURCE_PACKAGE The package name of the voicemail source.","String VOICEMAIL_ACCESS_URI The URI to call when the user requests to directly access the voicemail from the remote server.","[Expand] Inherited Constants","From interface android.provider.BaseColumns String _COUNT The count of rows in a directory. String _ID The unique ID for a row.","String _COUNT The count of rows in a directory.","String _ID The unique ID for a row."],"class":"VoicemailContract.Status","constructors":[],"fields":["public static final Uri CONTENT_URI URI to insert/retrieve status of voicemail source."]}