{"methods":["final int getCurrentVolume() Get the current volume of the provider.","final int getMaxVolume() Get the maximum volume this provider allows.","final int getVolumeControl() Get the volume control type that this volume provider uses.","Object getVolumeProvider() Gets the underlying framework VolumeProvider object.","void onAdjustVolume(int direction) Override to handle requests to adjust the volume of the current output.","void onSetVolumeTo(int volume) Override to handle requests to set the volume of the current output.","void setCallback(VolumeProviderCompat.Callback callback) Sets a callback to receive volume changes.","final void setCurrentVolume(int currentVolume) Set the current volume and notify the system that the volume has been changed.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.support.v4.media","constants":["int VOLUME_CONTROL_ABSOLUTE The volume control uses an absolute value.","int VOLUME_CONTROL_FIXED The volume is fixed and can not be modified.","int VOLUME_CONTROL_RELATIVE The volume control uses relative adjustment via onAdjustVolume(int)."],"class":"VolumeProviderCompat","constructors":[],"fields":[]}