{"methods":["VpnService.Builder addAddress(String address, int prefixLength) Convenience method to add a network address to the VPN interface using a numeric address string.","VpnService.Builder addAddress(InetAddress address, int prefixLength) Add a network address to the VPN interface.","VpnService.Builder addAllowedApplication(String packageName) Adds an application that's allowed to access the VPN connection.","VpnService.Builder addDisallowedApplication(String packageName) Adds an application that's denied access to the VPN connection.","VpnService.Builder addDnsServer(String address) Convenience method to add a DNS server to the VPN connection using a numeric address string.","VpnService.Builder addDnsServer(InetAddress address) Add a DNS server to the VPN connection.","VpnService.Builder addRoute(String address, int prefixLength) Convenience method to add a network route to the VPN interface using a numeric address string.","VpnService.Builder addRoute(InetAddress address, int prefixLength) Add a network route to the VPN interface.","VpnService.Builder addSearchDomain(String domain) Add a search domain to the DNS resolver.","VpnService.Builder allowBypass() Allows all apps to bypass this VPN connection.","VpnService.Builder allowFamily(int family) Allows traffic from the specified address family.","ParcelFileDescriptor establish() Create a VPN interface using the parameters supplied to this builder.","VpnService.Builder setBlocking(boolean blocking) Sets the VPN interface's file descriptor to be in blocking/non-blocking mode.","VpnService.Builder setConfigureIntent(PendingIntent intent) Set the PendingIntent to an activity for users to configure the VPN connection.","VpnService.Builder setMtu(int mtu) Set the maximum transmission unit (MTU) of the VPN interface.","VpnService.Builder setSession(String session) Set the name of this session.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net","constants":[],"class":"VpnService.Builder","constructors":[],"fields":[]}