{"methods":["[Expand] Inherited Methods","From class com.google.android.gms.common.api.CommonStatusCodes static String getStatusCodeString(int statusCode)","static String getStatusCodeString(int statusCode)","From class java.lang.Object Object clone() boolean equals(Object arg0) void finalize() final Class<?> getClass() int hashCode() final void notify() final void notifyAll() String toString() final void wait() final void wait(long arg0, int arg1) final void wait(long arg0)","Object clone()","boolean equals(Object arg0)","void finalize()","final Class<?> getClass()","int hashCode()","final void notify()","final void notifyAll()","String toString()","final void wait()","final void wait(long arg0, int arg1)","final void wait(long arg0)"],"package":"com.google.android.gms.wearable","constants":["int ASSET_UNAVAILABLE Indicates that the requested asset is unavailable.","int DATA_ITEM_TOO_LARGE Indicates that the data item was too large to set.","int DUPLICATE_LISTENER Indicates that the specified listener is already registered.","int INVALID_TARGET_NODE Indicates that the targeted node is not a valid node in the wearable network.","int TARGET_NODE_NOT_CONNECTED Indicates that the targeted node is not accessible in the wearable network.","int UNKNOWN_LISTENER Indicates that the specified listener is not recognized.","[Expand] Inherited Constants","From class com.google.android.gms.common.api.CommonStatusCodes int CANCELED The result was canceled either due to client disconnect or cancel(). int DEVELOPER_ERROR The application is misconfigured. int ERROR The operation failed with no more detailed information. int INTERNAL_ERROR An internal error occurred. int INTERRUPTED A blocking call was interrupted while waiting and did not run to completion. int INVALID_ACCOUNT The client attempted to connect to the service with an invalid account name specified. int LICENSE_CHECK_FAILED The application is not licensed to the user. int NETWORK_ERROR A network error occurred. int RESOLUTION_REQUIRED Completing the connection requires some form of resolution. int SERVICE_DISABLED The installed version of Google Play services has been disabled on this device. int SERVICE_INVALID The version of the Google Play services installed on this device is not authentic. int SERVICE_MISSING Google Play services is missing on this device. int SERVICE_VERSION_UPDATE_REQUIRED The installed version of Google Play services is out of date. int SIGN_IN_REQUIRED The client attempted to connect to the service but the user is not signed in. int SUCCESS The operation was successful. int SUCCESS_CACHE The operation was successful, but was used the device's cache. int TIMEOUT Timed out while awaiting the result.","int CANCELED The result was canceled either due to client disconnect or cancel().","int DEVELOPER_ERROR The application is misconfigured.","int ERROR The operation failed with no more detailed information.","int INTERNAL_ERROR An internal error occurred.","int INTERRUPTED A blocking call was interrupted while waiting and did not run to completion.","int INVALID_ACCOUNT The client attempted to connect to the service with an invalid account name specified.","int LICENSE_CHECK_FAILED The application is not licensed to the user.","int NETWORK_ERROR A network error occurred.","int RESOLUTION_REQUIRED Completing the connection requires some form of resolution.","int SERVICE_DISABLED The installed version of Google Play services has been disabled on this device.","int SERVICE_INVALID The version of the Google Play services installed on this device is not authentic.","int SERVICE_MISSING Google Play services is missing on this device.","int SERVICE_VERSION_UPDATE_REQUIRED The installed version of Google Play services is out of date.","int SIGN_IN_REQUIRED The client attempted to connect to the service but the user is not signed in.","int SUCCESS The operation was successful.","int SUCCESS_CACHE The operation was successful, but was used the device's cache.","int TIMEOUT Timed out while awaiting the result."],"class":"WearableStatusCodes","constructors":[],"fields":[]}