{"methods":["Bitmap getDefaultVideoPoster() When not playing, video elements are represented by a 'poster' image.","View getVideoLoadingProgressView() When the user starts to playback a video element, it may take time for enough data to be buffered before the first frames can be rendered.","void getVisitedHistory(ValueCallback<String[]> callback) Obtains a list of all visited history items, used for link coloring","void onCloseWindow(WebView window) Notify the host application to close the given WebView and remove it from the view system if necessary.","void onConsoleMessage(String message, int lineNumber, String sourceID) This method was deprecated in API level 8. Use onConsoleMessage(ConsoleMessage) instead.","boolean onConsoleMessage(ConsoleMessage consoleMessage) Report a JavaScript console message to the host application.","boolean onCreateWindow(WebView view, boolean isDialog, boolean isUserGesture, Message resultMsg) Request the host application to create a new window.","void onExceededDatabaseQuota(String url, String databaseIdentifier, long quota, long estimatedDatabaseSize, long totalQuota, WebStorage.QuotaUpdater quotaUpdater) This method was deprecated in API level 19. This method is no longer called; WebView now uses the HTML5 / JavaScript Quota Management API.","void onGeolocationPermissionsHidePrompt() Notify the host application that a request for Geolocation permissions, made with a previous call to onGeolocationPermissionsShowPrompt() has been canceled.","void onGeolocationPermissionsShowPrompt(String origin, GeolocationPermissions.Callback callback) Notify the host application that web content from the specified origin is attempting to use the Geolocation API, but no permission state is currently set for that origin.","void onHideCustomView() Notify the host application that the current page would like to hide its custom view.","boolean onJsAlert(WebView view, String url, String message, JsResult result) Tell the client to display a javascript alert dialog.","boolean onJsBeforeUnload(WebView view, String url, String message, JsResult result) Tell the client to display a dialog to confirm navigation away from the current page.","boolean onJsConfirm(WebView view, String url, String message, JsResult result) Tell the client to display a confirm dialog to the user.","boolean onJsPrompt(WebView view, String url, String message, String defaultValue, JsPromptResult result) Tell the client to display a prompt dialog to the user.","boolean onJsTimeout() This method was deprecated in API level 17. This method is no longer supported and will not be invoked.","void onPermissionRequest(PermissionRequest request) Notify the host application that web content is requesting permission to access the specified resources and the permission currently isn't granted or denied.","void onPermissionRequestCanceled(PermissionRequest request) Notify the host application that the given permission request has been canceled.","void onProgressChanged(WebView view, int newProgress) Tell the host application the current progress of loading a page.","void onReachedMaxAppCacheSize(long requiredStorage, long quota, WebStorage.QuotaUpdater quotaUpdater) This method was deprecated in API level 19. This method is no longer called; WebView now uses the HTML5 / JavaScript Quota Management API.","void onReceivedIcon(WebView view, Bitmap icon) Notify the host application of a new favicon for the current page.","void onReceivedTitle(WebView view, String title) Notify the host application of a change in the document title.","void onReceivedTouchIconUrl(WebView view, String url, boolean precomposed) Notify the host application of the url for an apple-touch-icon.","void onRequestFocus(WebView view) Request display and focus for this WebView.","void onShowCustomView(View view, WebChromeClient.CustomViewCallback callback) Notify the host application that the current page would like to show a custom View.","void onShowCustomView(View view, int requestedOrientation, WebChromeClient.CustomViewCallback callback) This method was deprecated in API level 18. This method supports the obsolete plugin mechanism, and will not be invoked in future","boolean onShowFileChooser(WebView webView, ValueCallback<Uri[]> filePathCallback, WebChromeClient.FileChooserParams fileChooserParams) Tell the client to show a file chooser.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.webkit","constants":[],"class":"WebChromeClient","constructors":[],"fields":[]}