{"methods":["void doUpdateVisitedHistory(WebView view, String url, boolean isReload) Notify the host application to update its visited links database.","void onFormResubmission(WebView view, Message dontResend, Message resend) As the host application if the browser should resend data as the requested page was a result of a POST.","void onLoadResource(WebView view, String url) Notify the host application that the WebView will load the resource specified by the given url.","void onPageFinished(WebView view, String url) Notify the host application that a page has finished loading.","void onPageStarted(WebView view, String url, Bitmap favicon) Notify the host application that a page has started loading.","void onReceivedClientCertRequest(WebView view, ClientCertRequest request) Notify the host application to handle a SSL client certificate request.","void onReceivedError(WebView view, int errorCode, String description, String failingUrl) Report an error to the host application.","void onReceivedHttpAuthRequest(WebView view, HttpAuthHandler handler, String host, String realm) Notifies the host application that the WebView received an HTTP authentication request.","void onReceivedLoginRequest(WebView view, String realm, String account, String args) Notify the host application that a request to automatically log in the user has been processed.","void onReceivedSslError(WebView view, SslErrorHandler handler, SslError error) Notify the host application that an SSL error occurred while loading a resource.","void onScaleChanged(WebView view, float oldScale, float newScale) Notify the host application that the scale applied to the WebView has changed.","void onTooManyRedirects(WebView view, Message cancelMsg, Message continueMsg) This method was deprecated in API level 8. This method is no longer called. When the WebView encounters a redirect loop, it will cancel the load.","void onUnhandledInputEvent(WebView view, InputEvent event) Notify the host application that a input event was not handled by the WebView.","void onUnhandledKeyEvent(WebView view, KeyEvent event) This method was deprecated in API level 21. This method is subsumed by the more generic onUnhandledInputEvent.","WebResourceResponse shouldInterceptRequest(WebView view, WebResourceRequest request) Notify the host application of a resource request and allow the application to return the data.","WebResourceResponse shouldInterceptRequest(WebView view, String url) This method was deprecated in API level 21. Use shouldInterceptRequest(WebView, WebResourceRequest) instead.","boolean shouldOverrideKeyEvent(WebView view, KeyEvent event) Give the host application a chance to handle the key event synchronously.","boolean shouldOverrideUrlLoading(WebView view, String url) Give the host application a chance to take over the control when a new url is about to be loaded in the current WebView.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.webkit","constants":["int ERROR_AUTHENTICATION User authentication failed on server","int ERROR_BAD_URL Malformed URL","int ERROR_CONNECT Failed to connect to the server","int ERROR_FAILED_SSL_HANDSHAKE Failed to perform SSL handshake","int ERROR_FILE Generic file error","int ERROR_FILE_NOT_FOUND File not found","int ERROR_HOST_LOOKUP Server or proxy hostname lookup failed","int ERROR_IO Failed to read or write to the server","int ERROR_PROXY_AUTHENTICATION User authentication failed on proxy","int ERROR_REDIRECT_LOOP Too many redirects","int ERROR_TIMEOUT Connection timed out","int ERROR_TOO_MANY_REQUESTS Too many requests during this load","int ERROR_UNKNOWN Generic error","int ERROR_UNSUPPORTED_AUTH_SCHEME Unsupported authentication scheme (not basic or digest)","int ERROR_UNSUPPORTED_SCHEME Unsupported URI scheme"],"class":"WebViewClient","constructors":[],"fields":[]}