{"methods":["void addLocalService(WifiP2pManager.Channel c, WifiP2pServiceInfo servInfo, WifiP2pManager.ActionListener listener) Register a local service for service discovery.","void addServiceRequest(WifiP2pManager.Channel c, WifiP2pServiceRequest req, WifiP2pManager.ActionListener listener) Add a service discovery request.","void cancelConnect(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Cancel any ongoing p2p group negotiation The function call immediately returns after sending a connection cancellation request to the framework.","void clearLocalServices(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Clear all registered local services of service discovery.","void clearServiceRequests(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Clear all registered service discovery requests.","void connect(WifiP2pManager.Channel c, WifiP2pConfig config, WifiP2pManager.ActionListener listener) Start a p2p connection to a device with the specified configuration.","void createGroup(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Create a p2p group with the current device as the group owner.","void discoverPeers(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Initiate peer discovery.","void discoverServices(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Initiate service discovery.","WifiP2pManager.Channel initialize(Context srcContext, Looper srcLooper, WifiP2pManager.ChannelListener listener) Registers the application with the Wi-Fi framework.","void removeGroup(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Remove the current p2p group.","void removeLocalService(WifiP2pManager.Channel c, WifiP2pServiceInfo servInfo, WifiP2pManager.ActionListener listener) Remove a registered local service added with addLocalService(WifiP2pManager.Channel, WifiP2pServiceInfo, WifiP2pManager.ActionListener) The function call immediately returns after sending a request to remove a local service to the framework.","void removeServiceRequest(WifiP2pManager.Channel c, WifiP2pServiceRequest req, WifiP2pManager.ActionListener listener) Remove a specified service discovery request added with addServiceRequest(WifiP2pManager.Channel, WifiP2pServiceRequest, WifiP2pManager.ActionListener) The function call immediately returns after sending a request to remove service discovery request to the framework.","void requestConnectionInfo(WifiP2pManager.Channel c, WifiP2pManager.ConnectionInfoListener listener) Request device connection info.","void requestGroupInfo(WifiP2pManager.Channel c, WifiP2pManager.GroupInfoListener listener) Request p2p group info.","void requestPeers(WifiP2pManager.Channel c, WifiP2pManager.PeerListListener listener) Request the current list of peers.","void setDnsSdResponseListeners(WifiP2pManager.Channel c, WifiP2pManager.DnsSdServiceResponseListener servListener, WifiP2pManager.DnsSdTxtRecordListener txtListener) Register a callback to be invoked on receiving Bonjour service discovery response.","void setServiceResponseListener(WifiP2pManager.Channel c, WifiP2pManager.ServiceResponseListener listener) Register a callback to be invoked on receiving service discovery response.","void setUpnpServiceResponseListener(WifiP2pManager.Channel c, WifiP2pManager.UpnpServiceResponseListener listener) Register a callback to be invoked on receiving upnp service discovery response.","void stopPeerDiscovery(WifiP2pManager.Channel c, WifiP2pManager.ActionListener listener) Stop an ongoing peer discovery The function call immediately returns after sending a stop request to the framework.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"android.net.wifi.p2p","constants":["int BUSY Passed with onFailure(int).","int ERROR Passed with onFailure(int).","String EXTRA_DISCOVERY_STATE The lookup key for an int that indicates whether p2p discovery has started or stopped.","String EXTRA_NETWORK_INFO The lookup key for a NetworkInfo object associated with the p2p network.","String EXTRA_P2P_DEVICE_LIST The lookup key for a WifiP2pDeviceList object representing the new peer list when WIFI_P2P_PEERS_CHANGED_ACTION broadcast is sent.","String EXTRA_WIFI_P2P_DEVICE The lookup key for a WifiP2pDevice object Retrieve with getParcelableExtra(String).","String EXTRA_WIFI_P2P_GROUP The lookup key for a WifiP2pGroup object associated with the p2p network.","String EXTRA_WIFI_P2P_INFO The lookup key for a WifiP2pInfo object Retrieve with getParcelableExtra(String).","String EXTRA_WIFI_STATE The lookup key for an int that indicates whether Wi-Fi p2p is enabled or disabled.","int NO_SERVICE_REQUESTS Passed with onFailure(int).","int P2P_UNSUPPORTED Passed with onFailure(int).","String WIFI_P2P_CONNECTION_CHANGED_ACTION Broadcast intent action indicating that the state of Wi-Fi p2p connectivity has changed.","String WIFI_P2P_DISCOVERY_CHANGED_ACTION Broadcast intent action indicating that peer discovery has either started or stopped.","int WIFI_P2P_DISCOVERY_STARTED p2p discovery has started","int WIFI_P2P_DISCOVERY_STOPPED p2p discovery has stopped","String WIFI_P2P_PEERS_CHANGED_ACTION Broadcast intent action indicating that the available peer list has changed.","String WIFI_P2P_STATE_CHANGED_ACTION Broadcast intent action to indicate whether Wi-Fi p2p is enabled or disabled.","int WIFI_P2P_STATE_DISABLED Wi-Fi p2p is disabled.","int WIFI_P2P_STATE_ENABLED Wi-Fi p2p is enabled.","String WIFI_P2P_THIS_DEVICE_CHANGED_ACTION Broadcast intent action indicating that this device details have changed."],"class":"WifiP2pManager","constructors":[],"fields":[]}