{"methods":["abstract boolean dispatchGenericMotionEvent(MotionEvent event) Called to process generic motion events.","abstract boolean dispatchKeyEvent(KeyEvent event) Called to process key events.","abstract boolean dispatchKeyShortcutEvent(KeyEvent event) Called to process a key shortcut event.","abstract boolean dispatchPopulateAccessibilityEvent(AccessibilityEvent event) Called to process population of AccessibilityEvents.","abstract boolean dispatchTouchEvent(MotionEvent event) Called to process touch screen events.","abstract boolean dispatchTrackballEvent(MotionEvent event) Called to process trackball events.","abstract void onActionModeFinished(ActionMode mode) Called when an action mode has been finished.","abstract void onActionModeStarted(ActionMode mode) Called when an action mode has been started.","abstract void onAttachedToWindow() Called when the window has been attached to the window manager.","abstract void onContentChanged() This hook is called whenever the content view of the screen changes (due to a call to Window.setContentView or Window.addContentView).","abstract boolean onCreatePanelMenu(int featureId, Menu menu) Initialize the contents of the menu for panel 'featureId'.","abstract View onCreatePanelView(int featureId) Instantiate the view to display in the panel for 'featureId'.","abstract void onDetachedFromWindow() Called when the window has been attached to the window manager.","abstract boolean onMenuItemSelected(int featureId, MenuItem item) Called when a panel's menu item has been selected by the user.","abstract boolean onMenuOpened(int featureId, Menu menu) Called when a panel's menu is opened by the user.","abstract void onPanelClosed(int featureId, Menu menu) Called when a panel is being closed.","abstract boolean onPreparePanel(int featureId, View view, Menu menu) Prepare a panel to be displayed.","abstract boolean onSearchRequested() Called when the user signals the desire to start a search.","abstract void onWindowAttributesChanged(WindowManager.LayoutParams attrs) This is called whenever the current window attributes change.","abstract void onWindowFocusChanged(boolean hasFocus) This hook is called whenever the window focus changes.","abstract ActionMode onWindowStartingActionMode(ActionMode.Callback callback) Called when an action mode is being started for this window."],"package":"android.view","constants":[],"class":"Window.Callback","constructors":[],"fields":[]}