{"methods":["boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","byte[] getEncoded() Returns an ASN.1 DER-encoded representation of the distinguished name contained in this X.500 principal.","String getName() Returns a human-readable string representation of the distinguished name contained in this X.500 principal.","String getName(String format) Returns a string representation of the distinguished name contained in this X.500 principal.","String getName(String format, Map<String, String> oidMap)","int hashCode() Returns an integer hash code for this object.","String toString() Returns a string containing a concise, human-readable description of this object.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.security.Principal abstract boolean equals(Object obj) Compares the specified object with this Principal for equality and returns true if the specified object is equal, false otherwise. abstract String getName() Returns the name of this Principal. abstract int hashCode() Returns the hash code value for this Principal. abstract String toString() Returns a string containing a concise, human-readable description of this Principal.","abstract boolean equals(Object obj) Compares the specified object with this Principal for equality and returns true if the specified object is equal, false otherwise.","abstract String getName() Returns the name of this Principal.","abstract int hashCode() Returns the hash code value for this Principal.","abstract String toString() Returns a string containing a concise, human-readable description of this Principal."],"package":"javax.security.auth.x500","constants":["String CANONICAL Defines a constant for the canonical string format of distinguished names.","String RFC1779 Defines a constant for the RFC 1779 string format of distinguished names.","String RFC2253 Defines a constant for the RFC 2253 string format of distinguished names."],"class":"X500Principal","constructors":[],"fields":[]}