{"methods":["boolean equals(Object other) Returns whether the specified object equals to this instance.","X500Principal getCertificateIssuer() Returns the issuer of the revoked certificate.","abstract byte[] getEncoded() Returns this entry in ASN.1 DER encoded form.","abstract Date getRevocationDate() Returns the date when the certificate is revoked.","abstract BigInteger getSerialNumber() Returns the serial number of the revoked certificate.","abstract boolean hasExtensions() Returns whether this CRL entry has extensions.","int hashCode() Returns the hashcode of this instance.","abstract String toString() Returns a string representation of this instance.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.security.cert.X509Extension abstract Set<String> getCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as CRITICAL, that this implementation manages. abstract byte[] getExtensionValue(String oid) Returns the extension value as DER-encoded OCTET string for the specified OID. abstract Set<String> getNonCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as NON-CRITICAL, that this implementation manages. abstract boolean hasUnsupportedCriticalExtension() Returns whether this instance has an extension marked as CRITICAL that it cannot support.","abstract Set<String> getCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as CRITICAL, that this implementation manages.","abstract byte[] getExtensionValue(String oid) Returns the extension value as DER-encoded OCTET string for the specified OID.","abstract Set<String> getNonCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as NON-CRITICAL, that this implementation manages.","abstract boolean hasUnsupportedCriticalExtension() Returns whether this instance has an extension marked as CRITICAL that it cannot support."],"package":"java.security.cert","constants":[],"class":"X509CRLEntry","constructors":[],"fields":[]}