{"methods":["String chooseEngineClientAlias(String[] keyType, Principal[] issuers, SSLEngine engine) Chooses an alias for the client side of an SSL connection to authenticate it with the specified public key type and certificate issuers.","String chooseEngineServerAlias(String keyType, Principal[] issuers, SSLEngine engine) Chooses an alias for the server side of an SSL connection to authenticate it with the specified public key type and certificate issuers.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface javax.net.ssl.X509KeyManager abstract String chooseClientAlias(String[] keyType, Principal[] issuers, Socket socket) Chooses an alias for the client side of an SSL connection to authenticate it with the specified public key type and certificate issuers. abstract String chooseServerAlias(String keyType, Principal[] issuers, Socket socket) Chooses an alias for the server side of an SSL connection to authenticate it with the specified public key type and certificate issuers. abstract X509Certificate[] getCertificateChain(String alias) Returns the certificate chain for the specified alias. abstract String[] getClientAliases(String keyType, Principal[] issuers) Returns the client aliases for the specified public key type and list of certificate issuers. abstract PrivateKey getPrivateKey(String alias) Returns the private key for the specified alias. abstract String[] getServerAliases(String keyType, Principal[] issuers) Returns the server aliases for the specified public key type and list of certificate issuers.","abstract String chooseClientAlias(String[] keyType, Principal[] issuers, Socket socket) Chooses an alias for the client side of an SSL connection to authenticate it with the specified public key type and certificate issuers.","abstract String chooseServerAlias(String keyType, Principal[] issuers, Socket socket) Chooses an alias for the server side of an SSL connection to authenticate it with the specified public key type and certificate issuers.","abstract X509Certificate[] getCertificateChain(String alias) Returns the certificate chain for the specified alias.","abstract String[] getClientAliases(String keyType, Principal[] issuers) Returns the client aliases for the specified public key type and list of certificate issuers.","abstract PrivateKey getPrivateKey(String alias) Returns the private key for the specified alias.","abstract String[] getServerAliases(String keyType, Principal[] issuers) Returns the server aliases for the specified public key type and list of certificate issuers."],"package":"javax.net.ssl","constants":[],"class":"X509ExtendedKeyManager","constructors":[],"fields":[]}