{"methods":["boolean equals(Object other) Returns whether the specified object equals to this instance.","abstract byte[] getEncoded() Returns this CRL in ASN.1 DER encoded form.","abstract Principal getIssuerDN() Do not use, use getIssuerX500Principal() instead.","X500Principal getIssuerX500Principal() Returns the issuer distinguished name of this CRL.","abstract Date getNextUpdate() Returns the nextUpdate value of this CRL.","X509CRLEntry getRevokedCertificate(X509Certificate certificate) Returns the CRL entry for the specified certificate.","abstract X509CRLEntry getRevokedCertificate(BigInteger serialNumber) Returns the CRL entry with the specified certificate serial number.","abstract Set<? extends X509CRLEntry> getRevokedCertificates() Returns the set of revoked certificates.","abstract String getSigAlgName() Returns the name of the signature algorithm.","abstract String getSigAlgOID() Returns the OID of the signature algorithm.","abstract byte[] getSigAlgParams() Returns the parameters of the signature algorithm in DER encoded form.","abstract byte[] getSignature() Returns the signature bytes of this CRL.","abstract byte[] getTBSCertList() Returns the tbsCertList information of this CRL in DER encoded form.","abstract Date getThisUpdate() Returns the thisUpdate value of this CRL.","abstract int getVersion() Returns the version number of this CRL.","int hashCode() Returns the hashcode of this CRL instance.","abstract void verify(PublicKey key, String sigProvider) Verifies this CRL by verifying that this CRL was signed with the corresponding private key to the specified public key.","abstract void verify(PublicKey key) Verifies this CRL by verifying that this CRL was signed with the corresponding private key to the specified public key.","[Expand] Inherited Methods","From class java.security.cert.CRL final String getType() Returns the type of this CRL. abstract boolean isRevoked(Certificate cert) Returns whether the specified certificate is revoked by this CRL. abstract String toString() Returns the string representation of this instance.","final String getType() Returns the type of this CRL.","abstract boolean isRevoked(Certificate cert) Returns whether the specified certificate is revoked by this CRL.","abstract String toString() Returns the string representation of this instance.","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface java.security.cert.X509Extension abstract Set<String> getCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as CRITICAL, that this implementation manages. abstract byte[] getExtensionValue(String oid) Returns the extension value as DER-encoded OCTET string for the specified OID. abstract Set<String> getNonCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as NON-CRITICAL, that this implementation manages. abstract boolean hasUnsupportedCriticalExtension() Returns whether this instance has an extension marked as CRITICAL that it cannot support.","abstract Set<String> getCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as CRITICAL, that this implementation manages.","abstract byte[] getExtensionValue(String oid) Returns the extension value as DER-encoded OCTET string for the specified OID.","abstract Set<String> getNonCriticalExtensionOIDs() Returns the set of OIDs of the extension(s) marked as NON-CRITICAL, that this implementation manages.","abstract boolean hasUnsupportedCriticalExtension() Returns whether this instance has an extension marked as CRITICAL that it cannot support."],"package":"java.security.cert","constants":[],"class":"X509CRL","constructors":[],"fields":[]}