{"methods":["abstract void add(Duration duration) Add duration to this instance.","abstract void clear() Unset all fields to undefined.","abstract Object clone() Creates and returns a copy of this object.","abstract int compare(XMLGregorianCalendar xmlGregorianCalendar) Compare two instances of W3C XML Schema 1.0 date/time datatypes according to partial order relation defined in W3C XML Schema 1.0 Part 2, Section 3.2.7.3, Order relation on dateTime.","boolean equals(Object obj) Indicates whether parameter obj is \"equal to\" this one.","abstract int getDay() Return day in month or FIELD_UNDEFINED.","abstract BigInteger getEon() Return high order component for XML Schema 1.0 dateTime datatype field for year.","abstract BigInteger getEonAndYear() Return XML Schema 1.0 dateTime datatype field for year.","abstract BigDecimal getFractionalSecond() Return fractional seconds.","abstract int getHour() Return hours or FIELD_UNDEFINED.","int getMillisecond() Return millisecond precision of getFractionalSecond().","abstract int getMinute() Return minutes or FIELD_UNDEFINED.","abstract int getMonth() Return number of month or FIELD_UNDEFINED.","abstract int getSecond() Return seconds or FIELD_UNDEFINED.","abstract TimeZone getTimeZone(int defaultZoneoffset) Returns a java.util.TimeZone for this class.","abstract int getTimezone() Return timezone offset in minutes or FIELD_UNDEFINED if this optional field is not defined.","abstract QName getXMLSchemaType() Return the name of the XML Schema date/time type that this instance maps to.","abstract int getYear() Return low order component for XML Schema 1.0 dateTime datatype field for year or FIELD_UNDEFINED.","int hashCode() Returns a hash code consistent with the definition of the equals method.","abstract boolean isValid() Validate instance by getXMLSchemaType() constraints.","abstract XMLGregorianCalendar normalize() Normalize this instance to UTC.","abstract void reset() Reset this XMLGregorianCalendar to its original values.","abstract void setDay(int day) Set days in month.","abstract void setFractionalSecond(BigDecimal fractional) Set fractional seconds.","abstract void setHour(int hour) Set hours.","abstract void setMillisecond(int millisecond) Set milliseconds.","abstract void setMinute(int minute) Set minutes.","abstract void setMonth(int month) Set month.","abstract void setSecond(int second) Set seconds.","void setTime(int hour, int minute, int second, BigDecimal fractional) Set time as one unit, including the optional infinite precision fractional seconds.","void setTime(int hour, int minute, int second, int millisecond) Set time as one unit, including optional milliseconds.","void setTime(int hour, int minute, int second) Set time as one unit.","abstract void setTimezone(int offset) Set the number of minutes in the timezone offset.","abstract void setYear(int year) Set year of XSD dateTime year field.","abstract void setYear(BigInteger year) Set low and high order component of XSD dateTime year field.","abstract GregorianCalendar toGregorianCalendar(TimeZone timezone, Locale aLocale, XMLGregorianCalendar defaults) Convert this XMLGregorianCalendar along with provided parameters to a GregorianCalendar instance.","abstract GregorianCalendar toGregorianCalendar() Convert this XMLGregorianCalendar to a GregorianCalendar.","String toString() Returns a String representation of this XMLGregorianCalendar Object.","abstract String toXMLFormat() Return the lexical representation of this instance.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.datatype","constants":[],"class":"XMLGregorianCalendar","constructors":[],"fields":[]}