{"methods":["void characters(char[] ch, int start, int length) Adapt a SAX2 characters event.","void endDocument() End document event.","void endElement(String uri, String localName, String qName) Adapt a SAX2 end element event.","void endPrefixMapping(String prefix) Adapt a SAX2 end prefix mapping event.","void ignorableWhitespace(char[] ch, int start, int length) Adapt a SAX2 ignorable whitespace event.","void parse(String systemId) Parse the document.","void parse(InputSource input) Parse the document.","void processingInstruction(String target, String data) Adapt a SAX2 processing instruction event.","void setDTDHandler(DTDHandler handler) Register the DTD event handler.","void setDocumentHandler(DocumentHandler handler) Register the SAX1 document event handler.","void setDocumentLocator(Locator locator) Set a document locator.","void setEntityResolver(EntityResolver resolver) Register the entity resolver.","void setErrorHandler(ErrorHandler handler) Register the error event handler.","void setLocale(Locale locale) Set the locale for error reporting.","void skippedEntity(String name) Adapt a SAX2 skipped entity event.","void startDocument() Start document event.","void startElement(String uri, String localName, String qName, Attributes atts) Adapt a SAX2 start element event.","void startPrefixMapping(String prefix, String uri) Adapt a SAX2 start prefix mapping event.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface org.xml.sax.ContentHandler abstract void characters(char[] ch, int start, int length) Receive notification of character data. abstract void endDocument() Receive notification of the end of a document. abstract void endElement(String uri, String localName, String qName) Receive notification of the end of an element. abstract void endPrefixMapping(String prefix) End the scope of a prefix-URI mapping. abstract void ignorableWhitespace(char[] ch, int start, int length) Receive notification of ignorable whitespace in element content. abstract void processingInstruction(String target, String data) Receive notification of a processing instruction. abstract void setDocumentLocator(Locator locator) Receive an object for locating the origin of SAX document events. abstract void skippedEntity(String name) Receive notification of a skipped entity. abstract void startDocument() Receive notification of the beginning of a document. abstract void startElement(String uri, String localName, String qName, Attributes atts) Receive notification of the beginning of an element. abstract void startPrefixMapping(String prefix, String uri) Begin the scope of a prefix-URI Namespace mapping.","abstract void characters(char[] ch, int start, int length) Receive notification of character data.","abstract void endDocument() Receive notification of the end of a document.","abstract void endElement(String uri, String localName, String qName) Receive notification of the end of an element.","abstract void endPrefixMapping(String prefix) End the scope of a prefix-URI mapping.","abstract void ignorableWhitespace(char[] ch, int start, int length) Receive notification of ignorable whitespace in element content.","abstract void processingInstruction(String target, String data) Receive notification of a processing instruction.","abstract void setDocumentLocator(Locator locator) Receive an object for locating the origin of SAX document events.","abstract void skippedEntity(String name) Receive notification of a skipped entity.","abstract void startDocument() Receive notification of the beginning of a document.","abstract void startElement(String uri, String localName, String qName, Attributes atts) Receive notification of the beginning of an element.","abstract void startPrefixMapping(String prefix, String uri) Begin the scope of a prefix-URI Namespace mapping.","From interface org.xml.sax.Parser abstract void parse(String systemId) Parse an XML document from a system identifier (URI). abstract void parse(InputSource source) Parse an XML document. abstract void setDTDHandler(DTDHandler handler) Allow an application to register a DTD event handler. abstract void setDocumentHandler(DocumentHandler handler) Allow an application to register a document event handler. abstract void setEntityResolver(EntityResolver resolver) Allow an application to register a custom entity resolver. abstract void setErrorHandler(ErrorHandler handler) Allow an application to register an error event handler. abstract void setLocale(Locale locale) Allow an application to request a locale for errors and warnings.","abstract void parse(String systemId) Parse an XML document from a system identifier (URI).","abstract void parse(InputSource source) Parse an XML document.","abstract void setDTDHandler(DTDHandler handler) Allow an application to register a DTD event handler.","abstract void setDocumentHandler(DocumentHandler handler) Allow an application to register a document event handler.","abstract void setEntityResolver(EntityResolver resolver) Allow an application to register a custom entity resolver.","abstract void setErrorHandler(ErrorHandler handler) Allow an application to register an error event handler.","abstract void setLocale(Locale locale) Allow an application to request a locale for errors and warnings."],"package":"org.xml.sax.helpers","constants":[],"class":"XMLReaderAdapter","constructors":[],"fields":[]}