{"methods":["abstract boolean getFeature(String name) Get the state of the named feature.","abstract boolean isObjectModelSupported(String objectModel) Is specified object model supported by this XPathFactory?","static XPathFactory newInstance(String uri, String factoryClassName, ClassLoader classLoader)","final static XPathFactory newInstance(String uri) Get a new XPathFactory instance using the specified object model.","final static XPathFactory newInstance() Get a new XPathFactory instance using the default object model, DEFAULT_OBJECT_MODEL_URI, the W3C DOM.","abstract XPath newXPath() Return a new XPath using the underlying object model determined when the XPathFactory was instantiated.","abstract void setFeature(String name, boolean value) Set a feature for this XPathFactory and XPaths created by this factory.","abstract void setXPathFunctionResolver(XPathFunctionResolver resolver) Establish a default function resolver.","abstract void setXPathVariableResolver(XPathVariableResolver resolver) Establish a default variable resolver.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires."],"package":"javax.xml.xpath","constants":["String DEFAULT_OBJECT_MODEL_URI Default Object Model URI.","String DEFAULT_PROPERTY_NAME The default property name according to the JAXP spec."],"class":"XPathFactory","constructors":[],"fields":[]}