{"methods":["ViewGroup getContainer() Gets the container that is the parent of the zoom controls.","View getZoomControls() Gets the view for the zoom controls.","boolean isAutoDismissed() Whether the zoom controls will be automatically dismissed after showing.","boolean isVisible() Whether the zoom controls are visible to the user.","void setAutoDismissed(boolean autoDismiss) Sets whether the zoom controls will be automatically dismissed after showing.","void setFocusable(boolean focusable) Sets whether the zoom controls should be focusable.","void setOnZoomListener(ZoomButtonsController.OnZoomListener listener) Sets the ZoomButtonsController.OnZoomListener listener that receives callbacks to zoom.","void setVisible(boolean visible) Sets whether the zoom controls should be visible to the user.","void setZoomInEnabled(boolean enabled) Whether to enable the zoom in control.","void setZoomOutEnabled(boolean enabled) Whether to enable the zoom out control.","void setZoomSpeed(long speed) Sets the delay between zoom callbacks as the user holds a zoom button.","[Expand] Inherited Methods","From class java.lang.Object Object clone() Creates and returns a copy of this Object. boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal. void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable. final Class<?> getClass() Returns the unique instance of Class that represents this object's class. int hashCode() Returns an integer hash code for this object. final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up. String toString() Returns a string containing a concise, human-readable description of this object. final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object. final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires. final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","Object clone() Creates and returns a copy of this Object.","boolean equals(Object o) Compares this instance with the specified object and indicates if they are equal.","void finalize() Invoked when the garbage collector has detected that this instance is no longer reachable.","final Class<?> getClass() Returns the unique instance of Class that represents this object's class.","int hashCode() Returns an integer hash code for this object.","final void notify() Causes a thread which is waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","final void notifyAll() Causes all threads which are waiting on this object's monitor (by means of calling one of the wait() methods) to be woken up.","String toString() Returns a string containing a concise, human-readable description of this object.","final void wait() Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object.","final void wait(long millis, int nanos) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","final void wait(long millis) Causes the calling thread to wait until another thread calls the notify() or notifyAll() method of this object or until the specified timeout expires.","From interface android.view.View.OnTouchListener abstract boolean onTouch(View v, MotionEvent event) Called when a touch event is dispatched to a view.","abstract boolean onTouch(View v, MotionEvent event) Called when a touch event is dispatched to a view."],"package":"android.widget","constants":[],"class":"ZoomButtonsController","constructors":[],"fields":[]}